[
    {
        "problem": "Joan found 70 seashells on the beach. she gave Sam some of her seashells. She has 27 seashell left. How many seashells did she give to Sam ?",
        "conditions": [
            "Joan found 70 seashells on the beach.",
            "she gave Sam some of her seashells.",
            "She has 27 seashell left."
        ],
        "question": "How many seashells did she give to Sam ?",
        "equation": "70-x=27",
        "gold_answer": 43.0,
        "verify_condition_index": 2
    },
    {
        "problem": "There were 28 bales of hay in the barn. Tim stacked more bales in the barn today. There are now 54 bales of hay in the barn. How many bales did he store in the barn ?",
        "conditions": [
            "There were 28 bales of hay in the barn.",
            "Tim stacked more bales in the barn today.",
            "There are now 54 bales of hay in the barn."
        ],
        "question": "How many bales did he store in the barn ?",
        "equation": "28+x=54",
        "gold_answer": 26.0,
        "verify_condition_index": 0
    },
    {
        "problem": "After eating at the restaurant, Sally, Sam, and Alyssa decided to divide the bill evenly. If each person paid 45 dollars, what was the total of the bill ?",
        "conditions": [
            "After eating at the restaurant, Sally, Sam, and Alyssa decided to divide the bill evenly.",
            "If each person paid 45 dollars"
        ],
        "question": "what was the total of the bill ?",
        "equation": "45*3=x",
        "gold_answer": 135.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mary is baking a cake. The recipe wants 8 cups of flour. She already put in 2 cups. How many more cups does she need to add ?",
        "conditions": [
            "Mary is baking a cake.",
            "The recipe wants 8 cups of flour.",
            "She already put in 2 cups."
        ],
        "question": "How many more cups does she need to add ?",
        "equation": "8=2+x",
        "gold_answer": 6.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Sara's high school played 12 basketball games this year. The team won most of their games. They were defeated during 4 games. How many games did they win ?",
        "conditions": [
            "Sara's high school played 12 basketball games this year.",
            "The team won most of their games.",
            "They were defeated during 4 games."
        ],
        "question": "How many games did they win ?",
        "equation": "12=x+4",
        "gold_answer": 8.0,
        "verify_condition_index": 2
    },
    {
        "problem": "There are 22 walnut trees currently in the park. Park workers will plant more walnut trees today. When the workers are finished there will be 55 walnut trees in the park. How many walnut trees did the workers plant today ?",
        "conditions": [
            "There are 22 walnut trees currently in the park.",
            "Park workers will plant more walnut trees today.",
            "When the workers are finished there will be 55 walnut trees in the park."
        ],
        "question": "How many walnut trees did the workers plant today ?",
        "equation": "22+x=55",
        "gold_answer": 33.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Mike had 34 peaches left at his roadside fruit stand. He went to the orchard and picked more peaches to stock up the stand. There are now 86 peaches at the stand, how many did he pick ?",
        "conditions": [
            "Mike had 34 peaches left at his roadside fruit stand.",
            "He went to the orchard and picked more peaches to stock up the stand."
        ],
        "question": "There are now 86 peaches at the stand, how many did he pick ?",
        "equation": "34+x=86",
        "gold_answer": 52.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were 6 roses in the vase. Mary cut some more roses from her flower garden. There are now 16 roses in the vase. How many roses did she cut ?",
        "conditions": [
            "There were 6 roses in the vase.",
            "Mary cut some more roses from her flower garden.",
            "There are now 16 roses in the vase."
        ],
        "question": "How many roses did she cut ?",
        "equation": "6+x=16",
        "gold_answer": 10.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Benny bought a soft drink for 2 dollars and 5 candy bars. He spent a total of 27 dollars. How much did each candy bar cost ?",
        "conditions": [
            "Benny bought a soft drink for 2 dollars,",
            "and 5 candy bars.",
            "He spent a total of 27 dollars."
        ],
        "question": "How much did each candy bar cost ?",
        "equation": "2+(5*x)=27",
        "gold_answer": 5.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Benny bought 4 new baseball trading cards to add to his collection. The next day his dog ate half of his collection. There are now only 34 cards left. How many cards did Benny start with ?",
        "conditions": [
            "Benny bought 4 new baseball trading cards to add to his collection.",
            "The next day his dog ate half of his collection.",
            "There are now only 34 cards left."
        ],
        "question": "How many cards did Benny start with ?",
        "equation": "(x+4)/2=34",
        "gold_answer": 64.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Alyssa spent half of her allowance going to the movies. She washed the family car and earned 8 dollars. What is her weekly allowance if she ended with 12 dollars ?",
        "conditions": [
            "Alyssa spent half of her allowance going to the movies.",
            "She washed the family car and earned 8 dollars."
        ],
        "question": "What is her weekly allowance if she ended with 12 dollars ?",
        "equation": "(x/2)+8=12",
        "gold_answer": 8.0,
        "verify_condition_index": 1
    },
    {
        "problem": "The sum of three consecutive even numbers is 162. What is the smallest of the three numbers ?",
        "conditions": [
            "The sum of three consecutive even numbers is 162."
        ],
        "question": "What is the smallest of the three numbers ?",
        "equation": "(3*x)+6=162",
        "gold_answer": 52.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sam had 79 dollars to spend on 9 books. After buying them he had 16 dollars. How much did each book cost ?",
        "conditions": [
            "Sam had 79 dollars to spend on 9 books.",
            "After buying them he had 16 dollars."
        ],
        "question": "How much did each book cost ?",
        "equation": "79-(9*x)=16",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Oceanside Bike Rental Shop charges 17 dollars plus 7 dollars an hour for renting a bike. Tom paid 80 dollars to rent a bike. How many hours did he pay to have the bike checked out ?",
        "conditions": [
            "Oceanside Bike Rental Shop charges 17 dollars plus 7 dollars an hour for renting a bike.",
            "Tom paid 80 dollars to rent a bike."
        ],
        "question": "How many hours did he pay to have the bike checked out ?",
        "equation": "17+(7*x)=80",
        "gold_answer": 9.0,
        "verify_condition_index": 1
    },
    {
        "problem": "On Monday, 375 students went on a trip to the zoo. All 7 buses were filled and 4 students had to travel in cars. How many students were in each bus ?",
        "conditions": [
            "On Monday, 375 students went on a trip to the zoo.",
            "All 7 buses were filled,",
            "and 4 students had to travel in cars."
        ],
        "question": "How many students were in each bus ?",
        "equation": "375=(7*x)+4",
        "gold_answer": 53.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Sandy sold half of her comic books and then bought 6 more. She now has 13. How many did she begin with ?",
        "conditions": [
            "Sandy sold half of her comic books and then bought 6 more.",
            "She now has 13."
        ],
        "question": "How many did she begin with ?",
        "equation": "(x/2)+6=13",
        "gold_answer": 14.0,
        "verify_condition_index": 1
    },
    {
        "problem": "The sum of three consecutive odd numbers is 69. What is the smallest of the three numbers ?",
        "conditions": [
            "The sum of three consecutive odd numbers is 69."
        ],
        "question": "What is the smallest of the three numbers ?",
        "equation": "(3*x)+6=69",
        "gold_answer": 21.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan went to 4 football games this year. She went to 9 football games last year. How many football games did Joan go to in all ?",
        "conditions": [
            "Joan went to 4 football games this year.",
            "She went to 9 football games last year."
        ],
        "question": "How many football games did Joan go to in all ?",
        "equation": "4+9=x",
        "gold_answer": 13.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Tom has 9 yellow balloons. Sara has 8 yellow balloons. How many yellow balloons do they have in total ?",
        "conditions": [
            "Tom has 9 yellow balloons.",
            "Sara has 8 yellow balloons."
        ],
        "question": "How many yellow balloons do they have in total ?",
        "equation": "9+8=x",
        "gold_answer": 17.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 4 walnut trees currently in the park. Park workers will plant 6 more walnut trees today. How many walnut trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 4 walnut trees currently in the park.",
            "Park workers will plant 6 more walnut trees today."
        ],
        "question": "How many walnut trees will the park have when the workers are finished ?",
        "equation": "4+6=x",
        "gold_answer": 10.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sam had 9 dimes in his bank. His dad gave him 7 more dimes. How many dimes does Sam have now ?",
        "conditions": [
            "Sam had 9 dimes in his bank.",
            "His dad gave him 7 more dimes."
        ],
        "question": "How many dimes does Sam have now ?",
        "equation": "9+7=x",
        "gold_answer": 16.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Alyssa's dog had puppies. She gave 7 to her friends.  She now has 5 puppies left. How many puppies did she have to start with ?",
        "conditions": [
            "Alyssa's dog had puppies.",
            "She gave 7 to her friends.",
            "She now has 5 puppies left."
        ],
        "question": "How many puppies did she have to start with ?",
        "equation": "x-7=5",
        "gold_answer": 12.0,
        "verify_condition_index": 2
    },
    {
        "problem": "A restaurant served 9 pizzas during lunch and 6 during dinner today. How many pizzas were served today ?",
        "conditions": [
            "A restaurant served 9 pizzas during lunch,",
            "and 6 during dinner today."
        ],
        "question": "How many pizzas were served today ?",
        "equation": "9+6=x",
        "gold_answer": 15.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 2 pencils in the drawer. Tim placed 3 more pencils in the drawer. How many pencils are now there in total ?",
        "conditions": [
            "There are 2 pencils in the drawer.",
            "Tim placed 3 more pencils in the drawer."
        ],
        "question": "How many pencils are now there in total ?",
        "equation": "2+3=x",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan found 6 seashells and Jessica found 8 seashells on the beach. How many seashells did they find together ?",
        "conditions": [
            "Joan found 6 seashells,",
            "and Jessica found 8 seashells on the beach."
        ],
        "question": "How many seashells did they find together ?",
        "equation": "6+8=x",
        "gold_answer": 14.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sandy grew 6 carrots. Sam grew 3 carrots. How many carrots did they grow in total ?",
        "conditions": [
            "Sandy grew 6 carrots.",
            "Sam grew 3 carrots."
        ],
        "question": "How many carrots did they grow in total ?",
        "equation": "6+3=x",
        "gold_answer": 9.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Benny picked 2 apples and Dan picked 9 apples from the apple tree. How many apples were picked in total ?",
        "conditions": [
            "Benny picked 2 apples,",
            "and Dan picked 9 apples from the apple tree."
        ],
        "question": "How many apples were picked in total ?",
        "equation": "2+9=x",
        "gold_answer": 11.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sally found 9 seashells, Tom found 7 seashells, and Jessica found 5 seashells on the beach. How many seashells did they find together ?",
        "conditions": [
            "Sally found 9 seashells,",
            "Tom found 7 seashells,",
            "and Jessica found 5 seashells on the beach."
        ],
        "question": "How many seashells did they find together ?",
        "equation": "9+7+5=x",
        "gold_answer": 21.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Tim's cat had kittens. He gave 3 to Jessica and 6 to Sara. He now has 9 kittens left. How many kittens did he have to start with ?",
        "conditions": [
            "Tim's cat had kittens.",
            "He gave 3 to Jessica,",
            "and 6 to Sara.",
            "He now has 9 kittens left."
        ],
        "question": "How many kittens did he have to start with ?",
        "equation": "x-3-6=9",
        "gold_answer": 18.0,
        "verify_condition_index": 3
    },
    {
        "problem": "Joan has 9 blue balloons, Sally has 5 blue balloons, and Jessica has 2 blue balloons. How many blue balloons do they have in total ?",
        "conditions": [
            "Joan has 9 blue balloons,",
            "Sally has 5 blue balloons,",
            "and Jessica has 2 blue balloons."
        ],
        "question": "How many blue balloons do they have in total ?",
        "equation": "9+5+2=x",
        "gold_answer": 16.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Melanie had 7 dimes in her bank. Her dad gave her 8 dimes and her mother gave her 4 dimes. How many dimes does Melanie have now ?",
        "conditions": [
            "Melanie had 7 dimes in her bank.",
            "Her dad gave her 8 dimes,",
            "and her mother gave her 4 dimes."
        ],
        "question": "How many dimes does Melanie have now ?",
        "equation": "7+8+4=x",
        "gold_answer": 19.0,
        "verify_condition_index": 2
    },
    {
        "problem": "A restaurant served 5 cakes during lunch and 6 during dinner today. The restaurant served 3 cakes yesterday. How many cakes were served in total ?",
        "conditions": [
            "A restaurant served 5 cakes during lunch,",
            "and 6 during dinner today.",
            "The restaurant served 3 cakes yesterday."
        ],
        "question": "How many cakes were served in total ?",
        "equation": "5+6+3=x",
        "gold_answer": 14.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Melanie picked 4 plums, Dan picked 9 plums, and Sally picked 3 plums from the plum tree. How many plums were picked in total ?",
        "conditions": [
            "Melanie picked 4 plums,",
            "Dan picked 9 plums,",
            "and Sally picked 3 plums from the plum tree."
        ],
        "question": "How many plums were picked in total ?",
        "equation": "4+9+3=x",
        "gold_answer": 16.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 7 dogwood trees currently in the park. Park workers will plant 3 more dogwood trees today and 2 more dogwood trees tomorrow. How many dogwood trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 7 dogwood trees currently in the park.",
            "Park workers will plant 3 more dogwood trees today,",
            "and 2 more dogwood trees tomorrow."
        ],
        "question": "How many dogwood trees will the park have when the workers are finished ?",
        "equation": "7+3+2=x",
        "gold_answer": 12.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sara grew 4 onions, Sally grew 5 onions, and Fred grew  9 onions. How many onions did they grow in all ?",
        "conditions": [
            "Sara grew 4 onions,",
            "Sally grew 5 onions,",
            "and Fred grew  9 onions."
        ],
        "question": "How many onions did they grow in all ?",
        "equation": "4+5+9=x",
        "gold_answer": 18.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sam found 18 seashells and Mary found 47 seashells on the beach. How many seashells did they find together ?",
        "conditions": [
            "Sam found 18 seashells,",
            "and Mary found 47 seashells on the beach."
        ],
        "question": "How many seashells did they find together ?",
        "equation": "18+47=x",
        "gold_answer": 65.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sara picked 45 pears and Sally picked 11 pears from the pear tree. How many pears were picked in total ?",
        "conditions": [
            "Sara picked 45 pears,",
            "and Sally picked 11 pears from the pear tree."
        ],
        "question": "How many pears were picked in total ?",
        "equation": "45+11=x",
        "gold_answer": 56.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Keith has 20 books. Jason has 21 books.  How many books do they have together ?",
        "conditions": [
            "Keith has 20 books.",
            "Jason has 21 books."
        ],
        "question": "How many books do they have together ?",
        "equation": "20+21=x",
        "gold_answer": 41.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jason had 49 quarters in his bank. His dad gave him 25 more quarters. How many quarters does he have now ?",
        "conditions": [
            "Jason had 49 quarters in his bank.",
            "His dad gave him 25 more quarters."
        ],
        "question": "How many quarters does he have now ?",
        "equation": "49+25=x",
        "gold_answer": 74.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 33 walnut trees currently in the park. Park workers will plant  44 more walnut trees today. How many walnut trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 33 walnut trees currently in the park.",
            "Park workers will plant  44 more walnut trees today."
        ],
        "question": "How many walnut trees will the park have when the workers are finished ?",
        "equation": "33+44=x",
        "gold_answer": 77.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sara had 21 quarters in her bank. Her dad gave her 49 more quarters. How many quarters does she have now ?",
        "conditions": [
            "Sara had 21 quarters in her bank.",
            "Her dad gave her 49 more quarters."
        ],
        "question": "How many quarters does she have now ?",
        "equation": "21+49=x",
        "gold_answer": 70.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 41 pencils in the drawer. Mike placed 30 more  pencils in the drawer. How many pencils are now there in total ?",
        "conditions": [
            "There are 41 pencils in the drawer.",
            "Mike placed 30 more  pencils in the drawer."
        ],
        "question": "How many pencils are now there in total ?",
        "equation": "41+30=x",
        "gold_answer": 71.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan has 10 books. Tom has 38 books.  How many books do they have together ?",
        "conditions": [
            "Joan has 10 books.",
            "Tom has 38 books."
        ],
        "question": "How many books do they have together ?",
        "equation": "10+38=x",
        "gold_answer": 48.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Joan has 40 blue balloons Melanie has 41 blue balloons. How many blue balloons do they have in total ?",
        "conditions": [
            "Joan has 40 blue balloons Melanie has 41 blue balloons."
        ],
        "question": "How many blue balloons do they have in total ?",
        "equation": "40+41=x",
        "gold_answer": 81.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred grew 38 cantelopes. Tim grew 44 cantelopes. How many cantelopes did they grow in total ?",
        "conditions": [
            "Fred grew 38 cantelopes.",
            "Tim grew 44 cantelopes."
        ],
        "question": "How many cantelopes did they grow in total ?",
        "equation": "38+44=x",
        "gold_answer": 82.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sam went to 14 football games this year. He went to 29 games  last year. How many football games did Sam go to in all ?",
        "conditions": [
            "Sam went to 14 football games this year.",
            "He went to 29 games last year."
        ],
        "question": "How many football games did Sam go to in all ?",
        "equation": "14+29=x",
        "gold_answer": 43.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mary found 18 seashells and Jessica found 41 seashells on the beach. How many seashells did they find together ?",
        "conditions": [
            "Mary found 18 seashells,",
            "and Jessica found 41 seashells on the beach."
        ],
        "question": "How many seashells did they find together ?",
        "equation": "18+41=x",
        "gold_answer": 59.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 39 dogwood trees currently in the park. Park workers will plant  41 more dogwood trees today and 20 more dogwood trees tomorrow. How many dogwood trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 39 dogwood trees currently in the park.",
            "Park workers will plant  41 more dogwood trees today,",
            "and 20 more dogwood trees tomorrow."
        ],
        "question": "How many dogwood trees will the park have when the workers are finished ?",
        "equation": "39+41+20=x",
        "gold_answer": 100.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sandy has 10 books, Benny has 24 books, and Tim has  33 books. How many books do they have together ?",
        "conditions": [
            "Sandy has 10 books,",
            "Benny has 24 books,",
            "and Tim has 33 books."
        ],
        "question": "How many books do they have together ?",
        "equation": "10+24+33=x",
        "gold_answer": 67.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Jason picked 46 pears, Keith picked 47 pears, and Mike picked  12 pears from the pear tree. How many pears were picked in total ?",
        "conditions": [
            "Jason picked 46 pears,",
            "Keith picked 47 pears,",
            "and Mike picked  12 pears from the pear tree."
        ],
        "question": "How many pears were picked in total ?",
        "equation": "46+47+12=x",
        "gold_answer": 105.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Keith grew 29 cantelopes, Fred grew 16 cantelopes, and Jason grew  20 cantelopes. How many cantelopes did they grow in total ?",
        "conditions": [
            "Keith grew 29 cantelopes,",
            "Fred grew 16 cantelopes,",
            "and Jason grew  20 cantelopes."
        ],
        "question": "How many cantelopes did they grow in total ?",
        "equation": "29+16+20=x",
        "gold_answer": 65.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Melanie had 19 dimes in her bank. Her dad gave her 39 dimes and her mother gave her 25 dimes. How many dimes does Melanie have now ?",
        "conditions": [
            "Melanie had 19 dimes in her bank.",
            "Her dad gave her 39 dimes,",
            "and her mother gave her 25 dimes."
        ],
        "question": "How many dimes does Melanie have now ?",
        "equation": "19+39+25=x",
        "gold_answer": 83.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Alyssa has 37 blue balloons, Sandy has 28 blue balloons, and Sally  has 39 blue balloons. How many blue balloons do they have in all ?",
        "conditions": [
            "Alyssa has 37 blue balloons,",
            "Sandy has 28 blue balloons,",
            "and Sally  has 39 blue balloons."
        ],
        "question": "How many blue balloons do they have in all ?",
        "equation": "37+28+39=x",
        "gold_answer": 104.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Sally had 27 cards. Dan gave her 41 new cards. Sally bought 20 cards. How many cards does Sally have now ?",
        "conditions": [
            "Sally had 27 cards.",
            "Dan gave her 41 new cards.",
            "Sally bought 20 cards."
        ],
        "question": "How many cards does Sally have now ?",
        "equation": "27+41+20=x",
        "gold_answer": 88.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Jason went to 11 football games this month. He went to 17 games last month, and plans to go to 16 games next month. How many games will he attend in all ?",
        "conditions": [
            "Jason went to 11 football games this month.",
            "He went to 17 games last month,",
            "and plans to go to 16 games next month."
        ],
        "question": "How many games will he attend in all ?",
        "equation": "11+17+16=x",
        "gold_answer": 44.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 43 pencils in the drawer and 19 pencils on the desk. Dan placed  16 more pencils on the desk. How many pencils are now there in total ?",
        "conditions": [
            "There are 43 pencils in the drawer,",
            "and 19 pencils on the desk.",
            "Dan placed  16 more pencils on the desk."
        ],
        "question": "How many pencils are now there in total ?",
        "equation": "43+19+16=x",
        "gold_answer": 78.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mike has 35 books in his library. He bought several books at a yard sale over the weekend. He now has 56 books in his library. How many books did he buy at the yard sale ?",
        "conditions": [
            "Mike has 35 books in his library.",
            "He bought several books at a yard sale over the weekend.",
            "He now has 56 books in his library."
        ],
        "question": "How many books did he buy at the yard sale ?",
        "equation": "35+x=56",
        "gold_answer": 21.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Sandy is baking a cake. The recipe wants 7 cups of flour. She already put in 4 cups. How many more cups does she need to add ?",
        "conditions": [
            "Sandy is baking a cake.",
            "The recipe wants 7 cups of flour.",
            "She already put in 4 cups."
        ],
        "question": "How many more cups does she need to add ?",
        "equation": "7=4+x",
        "gold_answer": 3.0,
        "verify_condition_index": 2
    },
    {
        "problem": "There are 53 maple trees currently in the park. Park workers will plant more maple trees today. When the workers are finished there will be 64 maple trees in the park. How many maple trees did the workers plant today ?",
        "conditions": [
            "There are 53 maple trees currently in the park.",
            "Park workers will plant more maple trees today.",
            "When the workers are finished there will be 64 maple trees in the park."
        ],
        "question": "How many maple trees did the workers plant today ?",
        "equation": "53+x=64",
        "gold_answer": 11.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Dan found 56 seashells on the beach, he gave Jessica some of his seashells. He has 22 seashell left. How many seashells did he give to Jessica ?",
        "conditions": [
            "Dan found 56 seashells on the beach, he gave Jessica some of his seashells.",
            "He has 22 seashell left."
        ],
        "question": "How many seashells did he give to Jessica ?",
        "equation": "56-x=22",
        "gold_answer": 34.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sally had 13 peaches left at her roadside fruit stand. She went to the orchard and picked more peaches to stock up the stand. There are now 55 peaches at the stand, how many did she pick ?",
        "conditions": [
            "Sally had 13 peaches left at her roadside fruit stand.",
            "She went to the orchard and picked more peaches to stock up the stand."
        ],
        "question": "There are now 55 peaches at the stand, how many did she pick ?",
        "equation": "13+x=55",
        "gold_answer": 42.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Benny received 67 dollars for his birthday. He went to a sporting goods store and bought a baseball glove, baseball, and bat. He had 33 dollars left over. How much did he spent on the baseball gear ?",
        "conditions": [
            "Benny received 67 dollars for his birthday.",
            "He went to a sporting goods store and bought a baseball glove, baseball, and bat.",
            "He had 33 dollars left over."
        ],
        "question": "How much did he spent on the baseball gear ?",
        "equation": "67-x=33",
        "gold_answer": 34.0,
        "verify_condition_index": 2
    },
    {
        "problem": "There were 3 roses in the vase. Alyssa cut some more roses from her flower garden. There are now 14 roses in the vase. How many roses did she cut ?",
        "conditions": [
            "There were 3 roses in the vase.",
            "Alyssa cut some more roses from her flower garden.",
            "There are now 14 roses in the vase."
        ],
        "question": "How many roses did she cut ?",
        "equation": "3+x=14",
        "gold_answer": 11.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Last week Tom had 74 dollars. He washed cars over the weekend and now has 86 dollars. How much money did he make washing cars ?",
        "conditions": [
            "Last week Tom had 74 dollars.",
            "He washed cars over the weekend and now has 86 dollars."
        ],
        "question": "How much money did he make washing cars ?",
        "equation": "74+x=86",
        "gold_answer": 12.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There were 73 bales of hay in the barn. Jason stacked more bales in the barn today. There are now 96 bales of hay in the barn. How many bales did he store in the barn ?",
        "conditions": [
            "There were 73 bales of hay in the barn.",
            "Jason stacked more bales in the barn today.",
            "There are now 96 bales of hay in the barn."
        ],
        "question": "How many bales did he store in the barn ?",
        "equation": "73+x=96",
        "gold_answer": 23.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Nancy grew 6 potatoes. Sandy grew 7 potatoes. How many potatoes did they grow in total ?",
        "conditions": [
            "Nancy grew 6 potatoes.",
            "Sandy grew 7 potatoes."
        ],
        "question": "How many potatoes did they grow in total ?",
        "equation": "6+7=x",
        "gold_answer": 13.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 9 crayons in the drawer. Benny placed 3 more crayons in the drawer. How many crayons are now there in total ?",
        "conditions": [
            "There are 9 crayons in the drawer.",
            "Benny placed 3 more crayons in the drawer."
        ],
        "question": "How many crayons are now there in total ?",
        "equation": "9+3=x",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 5 oak trees currently in the park. Park workers will plant 4 more oak trees today. How many oak trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 5 oak trees currently in the park.",
            "Park workers will plant 4 more oak trees today."
        ],
        "question": "How many oak trees will the park have when the workers are finished ?",
        "equation": "5+4=x",
        "gold_answer": 9.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There were a total of 7 football games this year. Melanie missed 4 of the games. How many football games did Melanie go to in all ?",
        "conditions": [
            "There were a total of 7 football games this year.",
            "Melanie missed 4 of the games."
        ],
        "question": "How many football games did Melanie go to in all ?",
        "equation": "7=4+x",
        "gold_answer": 3.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Tom found 7 seashells but 4 were broken.  How many unbroken seashells did Tom find ?",
        "conditions": [
            "Tom found 7 seashells but 4 were broken."
        ],
        "question": "How many unbroken seashells did Tom find ?",
        "equation": "7=4+x",
        "gold_answer": 3.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sally picked 7 lemons and Mary picked 9 lemons from the lemon tree. How many lemons were picked in total ?",
        "conditions": [
            "Sally picked 7 lemons,",
            "and Mary picked 9 lemons from the lemon tree."
        ],
        "question": "How many lemons were picked in total ?",
        "equation": "7+9=x",
        "gold_answer": 16.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A restaurant served 6 cakes during lunch and 9 during dinner today. How many cakes were served today ?",
        "conditions": [
            "A restaurant served 6 cakes during lunch,",
            "and 9 during dinner today."
        ],
        "question": "How many cakes were served today ?",
        "equation": "6+9=x",
        "gold_answer": 15.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan has 8 orange balloons  but lost 2 of them. How many orange balloons does Joan have now ?",
        "conditions": [
            "Joan has 8 orange balloons  but lost 2 of them."
        ],
        "question": "How many orange balloons does Joan have now ?",
        "equation": "8-2=x",
        "gold_answer": 6.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred had 7 dimes in his bank. His sister borrowed 3 of his dimes. How many dimes does Fred have now ?",
        "conditions": [
            "Fred had 7 dimes in his bank.",
            "His sister borrowed 3 of his dimes."
        ],
        "question": "How many dimes does Fred have now ?",
        "equation": "7-3=x",
        "gold_answer": 4.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan's cat had 8 kittens. She gave 2 to her friends.  How many kittens does she have now ?",
        "conditions": [
            "Joan's cat had 8 kittens.",
            "She gave 2 to her friends."
        ],
        "question": "How many kittens does she have now ?",
        "equation": "8-2=x",
        "gold_answer": 6.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 34 dogwood trees currently in the park. Park workers will plant  49 more dogwood trees today. How many dogwood trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 34 dogwood trees currently in the park.",
            "Park workers will plant  49 more dogwood trees today."
        ],
        "question": "How many dogwood trees will the park have when the workers are finished ?",
        "equation": "34+49=x",
        "gold_answer": 83.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 27 pencils in the drawer. Nancy placed 45 more  pencils in the drawer. How many pencils are now there in total ?",
        "conditions": [
            "There are 27 pencils in the drawer.",
            "Nancy placed 45 more  pencils in the drawer."
        ],
        "question": "How many pencils are now there in total ?",
        "equation": "27+45=x",
        "gold_answer": 72.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Benny's high school played 39 baseball games this year. He attended  14 games. How many baseball games did Benny miss ?",
        "conditions": [
            "Benny's high school played 39 baseball games this year.",
            "He attended  14 games."
        ],
        "question": "How many baseball games did Benny miss ?",
        "equation": "39-14=x",
        "gold_answer": 25.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sam found 35 seashells on the beach, he gave Joan 18 of the seashells. How many seashells does he now have ?",
        "conditions": [
            "Sam found 35 seashells on the beach, he gave Joan 18 of the seashells."
        ],
        "question": "How many seashells does he now have ?",
        "equation": "35-18=x",
        "gold_answer": 17.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Tim has 22 books. Mike has 20 books.  How many books do they have together ?",
        "conditions": [
            "Tim has 22 books.",
            "Mike has 20 books."
        ],
        "question": "How many books do they have together ?",
        "equation": "22+20=x",
        "gold_answer": 42.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mike has 87 baseball cards. Sam bought 13 of Mike's  baseball cards. How many baseball cards does Mike have now ?",
        "conditions": [
            "Mike has 87 baseball cards.",
            "Sam bought 13 of Mike's  baseball cards."
        ],
        "question": "How many baseball cards does Mike have now ?",
        "equation": "87-13=x",
        "gold_answer": 74.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sandy grew 51 pumpkins. Mike grew 23 pumpkins. How many pumpkins did they grow in total ?",
        "conditions": [
            "Sandy grew 51 pumpkins.",
            "Mike grew 23 pumpkins."
        ],
        "question": "How many pumpkins did they grow in total ?",
        "equation": "51+23=x",
        "gold_answer": 74.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Tim has 44 books. Sam has 52 books.  How many books do they have together ?",
        "conditions": [
            "Tim has 44 books.",
            "Sam has 52 books."
        ],
        "question": "How many books do they have together ?",
        "equation": "44+52=x",
        "gold_answer": 96.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Dan has 64 violet marbles, he gave Mary 14 of the marbles. How many violet marbles does he now have ?",
        "conditions": [
            "Dan has 64 violet marbles, he gave Mary 14 of the marbles."
        ],
        "question": "How many violet marbles does he now have ?",
        "equation": "64-14=x",
        "gold_answer": 50.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 25 popular trees currently in the park. Park workers will plant  73 more popular trees today. How many popular trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 25 popular trees currently in the park.",
            "Park workers will plant  73 more popular trees today."
        ],
        "question": "How many popular trees will the park have when the workers are finished ?",
        "equation": "25+73=x",
        "gold_answer": 98.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 54 scissors in the drawer. Keith placed 22 more  scissors in the drawer. How many scissors are now there in all ?",
        "conditions": [
            "There are 54 scissors in the drawer.",
            "Keith placed 22 more  scissors in the drawer."
        ],
        "question": "How many scissors are now there in all ?",
        "equation": "54+22=x",
        "gold_answer": 76.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Alyssa picked 42 pears and Nancy picked 17 pears from the pear tree. How many pears were picked in all ?",
        "conditions": [
            "Alyssa picked 42 pears,",
            "and Nancy picked 17 pears from the pear tree."
        ],
        "question": "How many pears were picked in all ?",
        "equation": "42+17=x",
        "gold_answer": 59.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sam had 98 pennies in his bank. He spent 93 of his pennies. How many pennies does he have now ?",
        "conditions": [
            "Sam had 98 pennies in his bank.",
            "He spent 93 of his pennies."
        ],
        "question": "How many pennies does he have now ?",
        "equation": "98-93=x",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan found 79 seashells on the beach, she gave Mike 63 of the seashells. How many seashells does she now have ?",
        "conditions": [
            "Joan found 79 seashells on the beach, she gave Mike 63 of the seashells."
        ],
        "question": "How many seashells does she now have ?",
        "equation": "79-63=x",
        "gold_answer": 16.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Melanie's high school played 64 soccer games this year. She attended  32 games. How many soccer games did Melanie miss ?",
        "conditions": [
            "Melanie's high school played 64 soccer games this year.",
            "She attended  32 games."
        ],
        "question": "How many soccer games did Melanie miss ?",
        "equation": "64=32+x",
        "gold_answer": 32.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sam has 110 books. Joan has 102 books.  How many books do they have together ?",
        "conditions": [
            "Sam has 110 books.",
            "Joan has 102 books."
        ],
        "question": "How many books do they have together ?",
        "equation": "110+102=x",
        "gold_answer": 212.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mary picked 122 oranges and Jason picked 105 oranges from the orange tree. How many oranges were picked in total ?",
        "conditions": [
            "Mary picked 122 oranges,",
            "and Jason picked 105 oranges from the orange tree."
        ],
        "question": "How many oranges were picked in total ?",
        "equation": "122+105=x",
        "gold_answer": 227.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sally had 760 quarters in her bank. She spent 418 of her quarters. How many quarters does she have now ?",
        "conditions": [
            "Sally had 760 quarters in her bank.",
            "She spent 418 of her quarters."
        ],
        "question": "How many quarters does she have now ?",
        "equation": "760-418=x",
        "gold_answer": 342.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred's high school played 616 baseball games this year. He attended  147 games. How many baseball games did Fred miss ?",
        "conditions": [
            "Fred's high school played 616 baseball games this year.",
            "He attended  147 games."
        ],
        "question": "How many baseball games did Fred miss ?",
        "equation": "616=147+x",
        "gold_answer": 469.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Melanie grew 139 turnips. Benny grew 113 turnips. How many turnips did they grow in all ?",
        "conditions": [
            "Melanie grew 139 turnips.",
            "Benny grew 113 turnips."
        ],
        "question": "How many turnips did they grow in all ?",
        "equation": "139+113=x",
        "gold_answer": 252.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Jason has 676 Pokemon cards. Alyssa bought 224 of Jason's  Pokemon cards. How many Pokemon cards does Jason have now ?",
        "conditions": [
            "Jason has 676 Pokemon cards.",
            "Alyssa bought 224 of Jason's  Pokemon cards."
        ],
        "question": "How many Pokemon cards does Jason have now ?",
        "equation": "676-224=x",
        "gold_answer": 452.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 107 walnut trees currently in the park. Park workers will plant  104 more walnut trees today. How many walnut trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 107 walnut trees currently in the park.",
            "Park workers will plant  104 more walnut trees today."
        ],
        "question": "How many walnut trees will the park have when the workers are finished ?",
        "equation": "107+104=x",
        "gold_answer": 211.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Fred has 709 green balloons, he gave Sandy 221 of the balloons. How many green balloons does he now have ?",
        "conditions": [
            "Fred has 709 green balloons, he gave Sandy 221 of the balloons."
        ],
        "question": "How many green balloons does he now have ?",
        "equation": "709-221=x",
        "gold_answer": 488.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 115 pencils in the drawer. Sara placed 100 more  pencils in the drawer. How many pencils are now there in all ?",
        "conditions": [
            "There are 115 pencils in the drawer.",
            "Sara placed 100 more  pencils in the drawer."
        ],
        "question": "How many pencils are now there in all ?",
        "equation": "115+100=x",
        "gold_answer": 215.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mike has 45 dollars in 5 dollar bills.  How many five dollars bills does  he have ?",
        "conditions": [
            "Mike has 45 dollars in 5 dollar bills."
        ],
        "question": "How many five dollars bills does  he have ?",
        "equation": "45/5=x",
        "gold_answer": 9.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Nancy goes fishing with Joan. They catch 18 trout.  If they equally split up the trout, how many will each one get ?",
        "conditions": [
            "Nancy goes fishing with Joan.",
            "They catch 18 trout."
        ],
        "question": "If they equally split up the trout, how many will each one get ?",
        "equation": "18/2=x",
        "gold_answer": 9.0,
        "verify_condition_index": 1
    },
    {
        "problem": "A restaurant sold 63 hamburgers last week. How many hamburgers on average were sold each day ?",
        "conditions": [
            "A restaurant sold 63 hamburgers last week."
        ],
        "question": "How many hamburgers on average were sold each day ?",
        "equation": "63/7=x",
        "gold_answer": 9.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sandy worked 45 hours in the last 5 days. Assuming that she worked the same amount of hours each day, how long did she work each day ?",
        "conditions": [
            "Sandy worked 45 hours in the last 5 days."
        ],
        "question": "Assuming that she worked the same amount of hours each day, how long did she work each day ?",
        "equation": "45/5=x",
        "gold_answer": 9.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were a total of 27 soccer games during the 3 month season.  If the games are equally divided, how many soccer games are played a month ?",
        "conditions": [
            "There were a total of 27 soccer games during the 3 month season."
        ],
        "question": "If the games are equally divided, how many soccer games are played a month ?",
        "equation": "27/3=x",
        "gold_answer": 9.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred has 90 cents in his bank.  How many dimes does Fred have ?",
        "conditions": [
            "Fred has 90 cents in his bank."
        ],
        "question": "How many dimes does Fred have ?",
        "equation": "90/10=x",
        "gold_answer": 9.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred has 110 blue marbles. Fred has 22 times more blue marbles than Tim. How many blue marbles does Tim have?",
        "conditions": [
            "Fred has 110 blue marbles.",
            "Fred has 22 times more blue marbles than Tim."
        ],
        "question": "How many blue marbles does Tim have?",
        "equation": "110/22=x",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 390 students at a school. If each classroom holds 30 students, how many classrooms are needed at the school?",
        "conditions": [
            "There are 390 students at a school."
        ],
        "question": "If each classroom holds 30 students, how many classrooms are needed at the school?",
        "equation": "390=30*x",
        "gold_answer": 13.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mike has 96 muffins, which he needs to box up into dozens. How many boxes does he need?",
        "conditions": [
            "Mike has 96 muffins, which he needs to box up into dozens."
        ],
        "question": "How many boxes does he need?",
        "equation": "96/12=x",
        "gold_answer": 8.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Tim has saved 2000 cents from selling lemonade.  How many dollars does Tim have?",
        "conditions": [
            "Tim has saved 2000 cents from selling lemonade."
        ],
        "question": "How many dollars does Tim have?",
        "equation": "2000/100=x",
        "gold_answer": 20.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jason's shelves hold 45 books each. How many shelves will Jason need if Jason has 315 books?",
        "conditions": [
            "Jason's shelves hold 45 books each."
        ],
        "question": "How many shelves will Jason need if Jason has 315 books?",
        "equation": "45*x=315",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Nancy bought 615 crayons that came in packs of 15.  How many packs of crayons did Nancy buy?",
        "conditions": [
            "Nancy bought 615 crayons that came in packs of 15."
        ],
        "question": "How many packs of crayons did Nancy buy?",
        "equation": "615/15=x",
        "gold_answer": 41.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mary earns $46 cleaning a home. How many homes did she clean, if she made 276 dollars?",
        "conditions": [
            "Mary earns $46 cleaning a home."
        ],
        "question": "How many homes did she clean, if she made 276 dollars?",
        "equation": "46*x=276",
        "gold_answer": 6.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were a total of 323 football games in the season. The season is played for 17 months. How many football games were played each month, if each month has the same number of games?",
        "conditions": [
            "There were a total of 323 football games in the season.",
            "The season is played for 17 months."
        ],
        "question": "How many football games were played each month, if each month has the same number of games?",
        "equation": "323/17=x",
        "gold_answer": 19.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Nancy, Melanie, Mary, and Alyssa each bought 540 baseball cards,  which come in packs of 20. How many packs of baseball cards do they have in all?",
        "conditions": [
            "Nancy, Melanie, Mary, and Alyssa each bought 540 baseball cards,  which come in packs of 20."
        ],
        "question": "How many packs of baseball cards do they have in all?",
        "equation": "(4*540)/20=x",
        "gold_answer": 108.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A teacher has 344 pieces of candy. If there are 43 students, and the candy is divided evenly, How many pieces will each student get?",
        "conditions": [
            "A teacher has 344 pieces of candy.",
            "If there are 43 students, and the candy is divided evenly,"
        ],
        "question": "How many pieces will each student get?",
        "equation": "344/43=x",
        "gold_answer": 8.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sally earns $25.00 for each house she cleans. If she cleans 96 houses, how many dozens of dollars will she make?",
        "conditions": [
            "Sally earns $25.00 for each house she cleans."
        ],
        "question": "If she cleans 96 houses, how many dozens of dollars will she make?",
        "equation": "(25*96)=x*12",
        "gold_answer": 200.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 60 calories in a candy bar. How many dozen calories are there in 45 candy bars?",
        "conditions": [
            "There are 60 calories in a candy bar."
        ],
        "question": "How many dozen calories are there in 45 candy bars?",
        "equation": "60*45=x*12",
        "gold_answer": 225.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sara saw 96 birds in a tree. How many dozen birds did Sara see?",
        "conditions": [
            "Sara saw 96 birds in a tree."
        ],
        "question": "How many dozen birds did Sara see?",
        "equation": "96=x*12",
        "gold_answer": 8.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Melanie has 84 blue marbles. Sandy has 8 times more blue marbles than Melanie. How many dozen blue marbles does Sandy have?",
        "conditions": [
            "Melanie has 84 blue marbles.",
            "Sandy has 8 times more blue marbles than Melanie."
        ],
        "question": "How many dozen blue marbles does Sandy have?",
        "equation": "84*8=x*12",
        "gold_answer": 56.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sara has 192 golf balls. How many dozen golf balls does she have?",
        "conditions": [
            "Sara has 192 golf balls."
        ],
        "question": "How many dozen golf balls does she have?",
        "equation": "192=x*12",
        "gold_answer": 16.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Keith bought 72 eggs from the store to bake some cakes.  How many dozen eggs did Keith buy?",
        "conditions": [
            "Keith bought 72 eggs from the store to bake some cakes."
        ],
        "question": "How many dozen eggs did Keith buy?",
        "equation": "72=x*12",
        "gold_answer": 6.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mike has 48 books. Alyssa has 8 times more books than  Mike. How many dozen books does Alyssa have?",
        "conditions": [
            "Mike has 48 books.",
            "Alyssa has 8 times more books than  Mike."
        ],
        "question": "How many dozen books does Alyssa have?",
        "equation": "48*8=x*12",
        "gold_answer": 32.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sara has saved 9 dollars from washing cars.  How many dozen quarters does Sara have?",
        "conditions": [
            "Sara has saved 9 dollars from washing cars."
        ],
        "question": "How many dozen quarters does Sara have?",
        "equation": "9=(0.25*12)*x",
        "gold_answer": 3.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sara, Keith, Benny, and Alyssa each have 96 baseball cards.  How many dozen baseball cards do they have in all?",
        "conditions": [
            "Sara, Keith, Benny, and Alyssa each have 96 baseball cards."
        ],
        "question": "How many dozen baseball cards do they have in all?",
        "equation": "4*96=x*12",
        "gold_answer": 32.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jason has 3 Pokemon cards. Benny bought 2 of Jason's  Pokemon cards. How many Pokemon cards does Jason have now ?",
        "conditions": [
            "Jason has 3 Pokemon cards.",
            "Benny bought 2 of Jason's  Pokemon cards."
        ],
        "question": "How many Pokemon cards does Jason have now ?",
        "equation": "3-2=x",
        "gold_answer": 1.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mike has 8 orange marbles, he gave Sam 4 of the marbles. How many orange marbles does he now have ?",
        "conditions": [
            "Mike has 8 orange marbles, he gave Sam 4 of the marbles."
        ],
        "question": "How many orange marbles does he now have ?",
        "equation": "8-4=x",
        "gold_answer": 4.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan had 5 dimes in her bank. She spent 2 of her dimes. How many dimes does she have now ?",
        "conditions": [
            "Joan had 5 dimes in her bank.",
            "She spent 2 of her dimes."
        ],
        "question": "How many dimes does she have now ?",
        "equation": "5-2=x",
        "gold_answer": 3.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 2 rose bushes currently in the park. Park workers will plant 4 more rose bushes today. How many rose bushes will the park have when the workers are finished ?",
        "conditions": [
            "There are 2 rose bushes currently in the park.",
            "Park workers will plant 4 more rose bushes today."
        ],
        "question": "How many rose bushes will the park have when the workers are finished ?",
        "equation": "2+4=x",
        "gold_answer": 6.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sara picked 6 pears and Tim picked 5 pears from the pear tree. How many pears were picked in total ?",
        "conditions": [
            "Sara picked 6 pears,",
            "and Tim picked 5 pears from the pear tree."
        ],
        "question": "How many pears were picked in total ?",
        "equation": "6+5=x",
        "gold_answer": 11.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sam grew 4 watermelons, but the rabbits ate 3 watermelons. How many watermelons does Sam have left ?",
        "conditions": [
            "Sam grew 4 watermelons,",
            "but the rabbits ate 3 watermelons."
        ],
        "question": "How many watermelons does Sam have left ?",
        "equation": "4-3=x",
        "gold_answer": 1.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 3 calories in a candy bar. How many calories are there in 5 candy bars ?",
        "conditions": [
            "There are 3 calories in a candy bar."
        ],
        "question": "How many calories are there in 5 candy bars ?",
        "equation": "3*5=x",
        "gold_answer": 15.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Dan has 5 blue marbles. Mary has 2 times more blue marbles than Dan. How many blue marbles does Mary have ?",
        "conditions": [
            "Dan has 5 blue marbles.",
            "Mary has 2 times more blue marbles than Dan."
        ],
        "question": "How many blue marbles does Mary have ?",
        "equation": "5*2=x",
        "gold_answer": 10.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sara has 9 dozen golf balls. How many golf balls does she have ?",
        "conditions": [
            "Sara has 9 dozen golf balls."
        ],
        "question": "How many golf balls does she have ?",
        "equation": "9*12=x",
        "gold_answer": 108.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jason had Pokemon cards. He gave 9 Pokemon cards to his friends. He now has 4 Pokemon cards left. How many Pokemon cards did he have to start with ?",
        "conditions": [
            "Jason had Pokemon cards.",
            "He gave 9 Pokemon cards to his friends.",
            "He now has 4 Pokemon cards left."
        ],
        "question": "How many Pokemon cards did he have to start with ?",
        "equation": "x-9=4",
        "gold_answer": 13.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mary had 7 nickels in her bank. Her dad gave her 5 more nickels. How many nickels does Mary have now ?",
        "conditions": [
            "Mary had 7 nickels in her bank.",
            "Her dad gave her 5 more nickels."
        ],
        "question": "How many nickels does Mary have now ?",
        "equation": "7+5=x",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Melanie, Benny, Sally, and Jessica each have 3 baseball cards.  How many baseball cards do they have in all ?",
        "conditions": [
            "Melanie, Benny, Sally, and Jessica each have 3 baseball cards."
        ],
        "question": "How many baseball cards do they have in all ?",
        "equation": "4*3=x",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Keith grew 6 turnips. Alyssa grew 9 turnips. How many turnips did they grow in all ?",
        "conditions": [
            "Keith grew 6 turnips.",
            "Alyssa grew 9 turnips."
        ],
        "question": "How many turnips did they grow in all ?",
        "equation": "6+9=x",
        "gold_answer": 15.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 4 children in the classroom, each student will get 2 pencils. How many pencils will the teacher have to give out ?",
        "conditions": [
            "There are 4 children in the classroom, each student will get 2 pencils."
        ],
        "question": "How many pencils will the teacher have to give out ?",
        "equation": "4*2=x",
        "gold_answer": 8.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mary has 9 yellow marbles Joan has 3 yellow marbles. How many yellow marbles do they have in all ?",
        "conditions": [
            "Mary has 9 yellow marbles Joan has 3 yellow marbles."
        ],
        "question": "How many yellow marbles do they have in all ?",
        "equation": "9+3=x",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 8 calories in a candy bar. How many calories are there in 3 candy bars ?",
        "conditions": [
            "There are 8 calories in a candy bar."
        ],
        "question": "How many calories are there in 3 candy bars ?",
        "equation": "8*3=x",
        "gold_answer": 24.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan has saved 6 quarters from washing cars.  How many cents does Joan have ?",
        "conditions": [
            "Joan has saved 6 quarters from washing cars."
        ],
        "question": "How many cents does Joan have ?",
        "equation": "6*25=x",
        "gold_answer": 150.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 960 students at a school. If each classroom holds 30 students, how many classrooms are needed at the school?",
        "conditions": [
            "There are 960 students at a school."
        ],
        "question": "If each classroom holds 30 students, how many classrooms are needed at the school?",
        "equation": "960=30*x",
        "gold_answer": 32.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sally earns $12.50 an hour cleaning houses. If she works for 12 hours, how much money will she make ?",
        "conditions": [
            "Sally earns $12.50 an hour cleaning houses."
        ],
        "question": "If she works for 12 hours, how much money will she make ?",
        "equation": "12.50*12=x",
        "gold_answer": 150.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were a total of 12 basketball games in the season. The season is played for 2 months. How many basketball games were played each month, if each month has the same number of games?",
        "conditions": [
            "There were a total of 12 basketball games in the season.",
            "The season is played for 2 months."
        ],
        "question": "How many basketball games were played each month, if each month has the same number of games?",
        "equation": "12=2*x",
        "gold_answer": 6.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan bought 6 dozen eggs from the grocery store to bake some cakes.  How many eggs did Joan buy ?",
        "conditions": [
            "Joan bought 6 dozen eggs from the grocery store to bake some cakes."
        ],
        "question": "How many eggs did Joan buy ?",
        "equation": "6*12=x",
        "gold_answer": 72.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mary, Sam, Keith, and Alyssa each have 6 baseball cards.  How many baseball cards do they have in all ?",
        "conditions": [
            "Mary, Sam, Keith, and Alyssa each have 6 baseball cards."
        ],
        "question": "How many baseball cards do they have in all ?",
        "equation": "4*6=x",
        "gold_answer": 24.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sally bought 4 dozen eggs from the grocery store to bake some cakes.  How many eggs did Sally buy ?",
        "conditions": [
            "Sally bought 4 dozen eggs from the grocery store to bake some cakes."
        ],
        "question": "How many eggs did Sally buy ?",
        "equation": "4*12=x",
        "gold_answer": 48.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 1110 students at a school. If each classroom holds 30 students, how many classrooms are needed at the school?",
        "conditions": [
            "There are 1110 students at a school."
        ],
        "question": "If each classroom holds 30 students, how many classrooms are needed at the school?",
        "equation": "1110=30*x",
        "gold_answer": 37.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sally grew 6 carrots. Fred grew 4 carrots. How many carrots did they grow in all ?",
        "conditions": [
            "Sally grew 6 carrots.",
            "Fred grew 4 carrots."
        ],
        "question": "How many carrots did they grow in all ?",
        "equation": "6+4=x",
        "gold_answer": 10.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Benny has 6 blue marbles. Keith has 5 times more blue marbles than Benny. How many blue marbles does Keith have ?",
        "conditions": [
            "Benny has 6 blue marbles.",
            "Keith has 5 times more blue marbles than Benny."
        ],
        "question": "How many blue marbles does Keith have ?",
        "equation": "6*5=x",
        "gold_answer": 30.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Fred earns $12.50 an hour cleaning houses. If he works for 8 hours, how much money will he make ?",
        "conditions": [
            "Fred earns $12.50 an hour cleaning houses."
        ],
        "question": "If he works for 8 hours, how much money will he make ?",
        "equation": "12.50*8=x",
        "gold_answer": 100.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Tom found 5 seashells on the beach. he gave Jessica 2 of the seashells. How many seashells does he now have ?",
        "conditions": [
            "Tom found 5 seashells on the beach.",
            "he gave Jessica 2 of the seashells."
        ],
        "question": "How many seashells does he now have ?",
        "equation": "5-2=x",
        "gold_answer": 3.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred has 5 baseball cards. Melanie bought 3 of Fred's  baseball cards. How many baseball cards does Fred have now ?",
        "conditions": [
            "Fred has 5 baseball cards.",
            "Melanie bought 3 of Fred's  baseball cards."
        ],
        "question": "How many baseball cards does Fred have now ?",
        "equation": "5-3=x",
        "gold_answer": 2.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Nancy has saved 4900 cents from selling lemonade.  How many dollars does Nancy have?",
        "conditions": [
            "Nancy has saved 4900 cents from selling lemonade."
        ],
        "question": "How many dollars does Nancy have?",
        "equation": "4900/100=x",
        "gold_answer": 49.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were a total of 10 soccer games in the season. The season is played for 5 months. How many soccer games were played each month, if each month has the same number of games?",
        "conditions": [
            "There were a total of 10 soccer games in the season.",
            "The season is played for 5 months."
        ],
        "question": "How many soccer games were played each month, if each month has the same number of games?",
        "equation": "10=5*x",
        "gold_answer": 2.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Benny goes out to lunch with Sara and Tom. Each person orders the $8 lunch special. Benny agrees to pay the bill. How much will he have to pay ?",
        "conditions": [
            "Benny goes out to lunch with Sara and Tom.",
            "Each person orders the $8 lunch special.",
            "Benny agrees to pay the bill."
        ],
        "question": "How much will he have to pay ?",
        "equation": "3*8=x",
        "gold_answer": 24.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Melanie goes fishing with Tom. Melanie catches 8 trout. Tom catches 2 times as many trout as Melanie. How many trout did Tom catch ?",
        "conditions": [
            "Melanie goes fishing with Tom.",
            "Melanie catches 8 trout.",
            "Tom catches 2 times as many trout as Melanie."
        ],
        "question": "How many trout did Tom catch ?",
        "equation": "8*2=x",
        "gold_answer": 16.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Tom was at the beach for 5 days and found 7 seashells every day. How many seashells did Tom find during the beach trip ?",
        "conditions": [
            "Tom was at the beach for 5 days,",
            "and found 7 seashells every day."
        ],
        "question": "How many seashells did Tom find during the beach trip ?",
        "equation": "5*7=x",
        "gold_answer": 35.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Benny worked 3 hours for 6 days. How many hours did he work in total ?",
        "conditions": [
            "Benny worked 3 hours for 6 days."
        ],
        "question": "How many hours did he work in total ?",
        "equation": "3*6=x",
        "gold_answer": 18.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A restaurant sold 8 pies every day for a week. How many pies were sold during the week ?",
        "conditions": [
            "A restaurant sold 8 pies every day for a week."
        ],
        "question": "How many pies were sold during the week ?",
        "equation": "8*7=x",
        "gold_answer": 56.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Nancy has 9 five dollars bills.  How much money does she have ?",
        "conditions": [
            "Nancy has 9 five dollars bills."
        ],
        "question": "How much money does she have ?",
        "equation": "9*5=x",
        "gold_answer": 45.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Nancy has 7 black balloons. Mary has 4 times more  black balloons than Nancy. How many black balloons does Mary have now ?",
        "conditions": [
            "Nancy has 7 black balloons.",
            "Mary has 4 times more  black balloons than Nancy."
        ],
        "question": "How many black balloons does Mary have now ?",
        "equation": "7*4=x",
        "gold_answer": 28.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Jessica, Sandy, and Jason each have 8 pencils. How many pencils do they have have in all ?",
        "conditions": [
            "Jessica, Sandy, and Jason each have 8 pencils."
        ],
        "question": "How many pencils do they have have in all ?",
        "equation": "3*8=x",
        "gold_answer": 24.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sam, Dan, Tom, and Keith each have 14 Pokemon cards.  How many Pokemon cards do they have in all ?",
        "conditions": [
            "Sam, Dan, Tom, and Keith each have 14 Pokemon cards."
        ],
        "question": "How many Pokemon cards do they have in all ?",
        "equation": "4*14=x",
        "gold_answer": 56.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Alyssa has 36 books. Nancy has 7 times more books than  Alyssa. How many books does Nancy have ?",
        "conditions": [
            "Alyssa has 36 books.",
            "Nancy has 7 times more books than  Alyssa."
        ],
        "question": "How many books does Nancy have ?",
        "equation": "36*7=x",
        "gold_answer": 252.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Tim has 13 dozen golf balls. How many golf balls does he have ?",
        "conditions": [
            "Tim has 13 dozen golf balls."
        ],
        "question": "How many golf balls does he have ?",
        "equation": "13*12=x",
        "gold_answer": 156.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were a total of 13 hockey games a month. The season is played for  14 months. How many hockey games are in the seasons ?",
        "conditions": [
            "There were a total of 13 hockey games a month.",
            "The season is played for  14 months."
        ],
        "question": "How many hockey games are in the seasons ?",
        "equation": "13*14=x",
        "gold_answer": 182.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Benny bought 7 dozen eggs from the grocery store to bake some cakes.  How many eggs did Benny buy ?",
        "conditions": [
            "Benny bought 7 dozen eggs from the grocery store to bake some cakes."
        ],
        "question": "How many eggs did Benny buy ?",
        "equation": "7*12=x",
        "gold_answer": 84.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Dan has 29 violet balloons. Tim has 7 times more violet balloons than Dan. How many violet balloons does Tim have ?",
        "conditions": [
            "Dan has 29 violet balloons.",
            "Tim has 7 times more violet balloons than Dan."
        ],
        "question": "How many violet balloons does Tim have ?",
        "equation": "29*7=x",
        "gold_answer": 203.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 31 calories in a candy bar. How many calories are there in 11 candy bars ?",
        "conditions": [
            "There are 31 calories in a candy bar."
        ],
        "question": "How many calories are there in 11 candy bars ?",
        "equation": "31*11=x",
        "gold_answer": 341.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sara has saved 11 quarters from washing cars.  How many cents does Sara have ?",
        "conditions": [
            "Sara has saved 11 quarters from washing cars."
        ],
        "question": "How many cents does Sara have ?",
        "equation": "11*25=x",
        "gold_answer": 275.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 46 children in the classroom, each student will get 4 dozen pencils. How many pencils will the teacher have to give out ?",
        "conditions": [
            "There are 46 children in the classroom, each student will get 4 dozen pencils."
        ],
        "question": "How many pencils will the teacher have to give out ?",
        "equation": "46*(4*12)=x",
        "gold_answer": 2208.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Nancy has saved 1 dozen quarters from washing cars.  How much money does Nancy have ?",
        "conditions": [
            "Nancy has saved 1 dozen quarters from washing cars."
        ],
        "question": "How much money does Nancy have ?",
        "equation": "(12*0.25)=x",
        "gold_answer": 3.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Dan bought 9 dozen eggs from the grocery store to bake some cakes.  How many eggs did Dan buy ?",
        "conditions": [
            "Dan bought 9 dozen eggs from the grocery store to bake some cakes."
        ],
        "question": "How many eggs did Dan buy ?",
        "equation": "9*12=x",
        "gold_answer": 108.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 4 dozen calories in a candy bar. How many calories are there in 42 candy bars ?",
        "conditions": [
            "There are 4 dozen calories in a candy bar."
        ],
        "question": "How many calories are there in 42 candy bars ?",
        "equation": "(4*12)*42=x",
        "gold_answer": 2016.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sandy has 8 dozen books. Fred has 5 times more books than  Sandy. How many books does Fred have ?",
        "conditions": [
            "Sandy has 8 dozen books.",
            "Fred has 5 times more books than  Sandy."
        ],
        "question": "How many books does Fred have ?",
        "equation": "(8*12)*5=x",
        "gold_answer": 480.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Jessica has 3 dozen red marbles. Sandy has 4 times more red marbles than Jessica. How many red marbles does Sandy have ?",
        "conditions": [
            "Jessica has 3 dozen red marbles.",
            "Sandy has 4 times more red marbles than Jessica."
        ],
        "question": "How many red marbles does Sandy have ?",
        "equation": "(3*12)*4=x",
        "gold_answer": 144.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Melanie, Benny, Sandy, and Jessica each have 9 dozen Pokemon cards.  How many Pokemon cards do they have in all ?",
        "conditions": [
            "Melanie, Benny, Sandy, and Jessica each have 9 dozen Pokemon cards."
        ],
        "question": "How many Pokemon cards do they have in all ?",
        "equation": "4*(9*12)=x",
        "gold_answer": 432.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sally saw 1 dozen birds in a tree. How many birds did Sally see ?",
        "conditions": [
            "Sally saw 1 dozen birds in a tree."
        ],
        "question": "How many birds did Sally see ?",
        "equation": "1*12=x",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred, Benny, and Jason have 24 crayons all together. If the crayons are equally divided, how many will each person get ?",
        "conditions": [
            "Fred, Benny, and Jason have 24 crayons all together."
        ],
        "question": "If the crayons are equally divided, how many will each person get ?",
        "equation": "24/3=x",
        "gold_answer": 8.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sara goes fishing with Melanie. Sara catches 5 trout. Melanie catches 2 times as many trout as Sara. How many trout did Melanie catch ?",
        "conditions": [
            "Sara goes fishing with Melanie.",
            "Sara catches 5 trout.",
            "Melanie catches 2 times as many trout as Sara."
        ],
        "question": "How many trout did Melanie catch ?",
        "equation": "5*2=x",
        "gold_answer": 10.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Benny goes to lunch with Sally and Sandy. The total bill came to 15 dollars. They decided to equally split up the bill, how much will each person have to pay ?",
        "conditions": [
            "Benny goes to lunch with Sally and Sandy.",
            "The total bill came to 15 dollars."
        ],
        "question": "They decided to equally split up the bill, how much will each person have to pay ?",
        "equation": "15/3=x",
        "gold_answer": 5.0,
        "verify_condition_index": 1
    },
    {
        "problem": "A restaurant sold 49 hamburgers last week. How many hamburgers on average were sold each day ?",
        "conditions": [
            "A restaurant sold 49 hamburgers last week."
        ],
        "question": "How many hamburgers on average were sold each day ?",
        "equation": "49/7=x",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sally has 6 blue balloons. Fred has 3 times more  blue balloons than Sally. How many blue balloons does Fred have now ?",
        "conditions": [
            "Sally has 6 blue balloons.",
            "Fred has 3 times more  blue balloons than Sally."
        ],
        "question": "How many blue balloons does Fred have now ?",
        "equation": "6*3=x",
        "gold_answer": 18.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mike worked 3 hours, each day, for 5 days. How many hours did he work in total ?",
        "conditions": [
            "Mike worked 3 hours, each day, for 5 days."
        ],
        "question": "How many hours did he work in total ?",
        "equation": "3*5=x",
        "gold_answer": 15.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were a total of 7 baseball games a month.  The season is played for 2 months. How many baseball games are in a season ?",
        "conditions": [
            "There were a total of 7 baseball games a month.",
            "The season is played for 2 months."
        ],
        "question": "How many baseball games are in a season ?",
        "equation": "7*2=x",
        "gold_answer": 14.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Melanie is selling 4 gumballs for eight cents each. How much money can Melanie get from selling the gumballs?",
        "conditions": [
            "Melanie is selling 4 gumballs for eight cents each."
        ],
        "question": "How much money can Melanie get from selling the gumballs?",
        "equation": "4*8=x",
        "gold_answer": 32.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mary had 8 potatoes in the garden. The rabbits ate 3 of the potatoes. How many potatoes does Mary now have ?",
        "conditions": [
            "Mary had 8 potatoes in the garden.",
            "The rabbits ate 3 of the potatoes."
        ],
        "question": "How many potatoes does Mary now have ?",
        "equation": "8-3=x",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were a total of 6 soccer games this year. Jessica missed 4 of the games. How many soccer games did Jessica go to in all ?",
        "conditions": [
            "There were a total of 6 soccer games this year.",
            "Jessica missed 4 of the games."
        ],
        "question": "How many soccer games did Jessica go to in all ?",
        "equation": "6=4+x",
        "gold_answer": 2.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 9 oak trees currently in the park. Park workers had to cut down 2  oak trees that were damaged. How many oak trees will the park have when the workers are finished ?",
        "conditions": [
            "There are 9 oak trees currently in the park.",
            "Park workers had to cut down 2  oak trees that were damaged."
        ],
        "question": "How many oak trees will the park have when the workers are finished ?",
        "equation": "9-2=x",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jessica had 8 quarters in her bank. Her sister borrowed 3 of her quarters. How many quarters does Jessica have now ?",
        "conditions": [
            "Jessica had 8 quarters in her bank.",
            "Her sister borrowed 3 of her quarters."
        ],
        "question": "How many quarters does Jessica have now ?",
        "equation": "8-3=x",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A restaurant made 9 hamburgers to serve during lunch. Only 3 were  actually served. How many hamburgers were left over from lunch ?",
        "conditions": [
            "A restaurant made 9 hamburgers to serve during lunch.",
            "Only 3 were  actually served."
        ],
        "question": "How many hamburgers were left over from lunch ?",
        "equation": "9=3+6",
        "gold_answer": 6.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 7 crayons in the drawer. Mary took 3 crayons out of the drawer. How many crayons are there now ?",
        "conditions": [
            "There are 7 crayons in the drawer.",
            "Mary took 3 crayons out of the drawer."
        ],
        "question": "How many crayons are there now ?",
        "equation": "7-3=x",
        "gold_answer": 4.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Dan picked 9 limes and gave Sara 4 of the limes.  How many limes does Dan have now ?",
        "conditions": [
            "Dan picked 9 limes,",
            "and gave Sara 4 of the limes."
        ],
        "question": "How many limes does Dan have now ?",
        "equation": "9-4=x",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Dan found 7 seashells but 3 were broken.  How many unbroken seashells did Dan find ?",
        "conditions": [
            "Dan found 7 seashells but 3 were broken."
        ],
        "question": "How many unbroken seashells did Dan find ?",
        "equation": "7=3+x",
        "gold_answer": 4.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan has 9 blue balloons  but lost 2 of them. How many blue balloons does Joan have now ?",
        "conditions": [
            "Joan has 9 blue balloons  but lost 2 of them."
        ],
        "question": "How many blue balloons does Joan have now ?",
        "equation": "9-2=x",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan picked 43 apples from the orchard, and gave 27 apples  to  Melanie. How many apples does Joan have now ?",
        "conditions": [
            "Joan picked 43 apples from the orchard,",
            "and gave 27 apples  to  Melanie."
        ],
        "question": "How many apples does Joan have now ?",
        "equation": "43-27=x",
        "gold_answer": 16.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Alyssa's high school played 31 hockey games this year. She attended  13 games. How many hockey games did Alyssa miss ?",
        "conditions": [
            "Alyssa's high school played 31 hockey games this year.",
            "She attended  13 games."
        ],
        "question": "How many hockey games did Alyssa miss ?",
        "equation": "31=13+x",
        "gold_answer": 18.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Tom has 30 violet balloons, he gave Fred 16 of the balloons. How many violet balloons does he now have ?",
        "conditions": [
            "Tom has 30 violet balloons, he gave Fred 16 of the balloons."
        ],
        "question": "How many violet balloons does he now have ?",
        "equation": "30-16=x",
        "gold_answer": 14.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred has 40 baseball cards. Keith bought 22 of Fred's  baseball cards. How many baseball cards does Fred have now ?",
        "conditions": [
            "Fred has 40 baseball cards.",
            "Keith bought 22 of Fred's  baseball cards."
        ],
        "question": "How many baseball cards does Fred have now ?",
        "equation": "40-22=x",
        "gold_answer": 18.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred found 47 seashells on the beach, he gave Jessica 25 of the seashells. How many seashells does he now have ?",
        "conditions": [
            "Fred found 47 seashells on the beach, he gave Jessica 25 of the seashells."
        ],
        "question": "How many seashells does he now have ?",
        "equation": "47-25=x",
        "gold_answer": 22.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sara grew 43 pumpkins, but the rabbits ate 23 pumpkins. How many pumpkins does Sara have left ?",
        "conditions": [
            "Sara grew 43 pumpkins,",
            "but the rabbits ate 23 pumpkins."
        ],
        "question": "How many pumpkins does Sara have left ?",
        "equation": "43-23=x",
        "gold_answer": 20.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Joan decided to sell all of her old books. She gathered up 33 books to sell. She sold 26 books in a yard sale. How many books does Joan now have ?",
        "conditions": [
            "Joan decided to sell all of her old books.",
            "She gathered up 33 books to sell.",
            "She sold 26 books in a yard sale."
        ],
        "question": "How many books does Joan now have ?",
        "equation": "33-26=x",
        "gold_answer": 7.0,
        "verify_condition_index": 2
    },
    {
        "problem": "There are 46 rulers in the drawer. Tim took 25  rulers from the drawer. How many rulers are now in the drawer ?",
        "conditions": [
            "There are 46 rulers in the drawer.",
            "Tim took 25  rulers from the drawer."
        ],
        "question": "How many rulers are now in the drawer ?",
        "equation": "46-25=x",
        "gold_answer": 21.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 33 oak trees currently in the park. Park workers had to cut down  18 oak trees that were damaged. How many oak trees will be in the park when the workers are finished ?",
        "conditions": [
            "There are 33 oak trees currently in the park.",
            "Park workers had to cut down  18 oak trees that were damaged."
        ],
        "question": "How many oak trees will be in the park when the workers are finished ?",
        "equation": "33-18=x",
        "gold_answer": 15.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sandy sold lemonade in her neighborhood. She got 17 half-dollars on Saturday and 6 half-dollars on Sunday. What amount of money did Sandy receive?",
        "conditions": [
            "Sandy sold lemonade in her neighborhood.",
            "She got 17 half-dollars on Saturday,",
            "and 6 half-dollars on Sunday."
        ],
        "question": "What amount of money did Sandy receive?",
        "equation": "(17*0.5)+(6*0.5)=x",
        "gold_answer": 11.5,
        "verify_condition_index": 1
    },
    {
        "problem": "Sam got 9 pennies for washing clothes, and 7 quarters for mowing lawns. How much money does Sam have?",
        "conditions": [
            "Sam got 9 pennies for washing clothes,",
            "and 7 quarters for mowing lawns."
        ],
        "question": "How much money does Sam have?",
        "equation": "(9*0.01)+(7*0.25)=x",
        "gold_answer": 1.84,
        "verify_condition_index": 0
    },
    {
        "problem": "When Joan was visited by the toothfairy, she received 14 each of quarters, half-dollars, and dimes. How much money did the toothfairy leave Joan?",
        "conditions": [
            "When Joan was visited by the toothfairy, she received 14 each of quarters, half-dollars, and dimes."
        ],
        "question": "How much money did the toothfairy leave Joan?",
        "equation": "14*(0.25+0.5+0.1)=x",
        "gold_answer": 11.9,
        "verify_condition_index": 0
    },
    {
        "problem": "As Alyssa was searching through her couch cushions, she found 12 quarters, and 7 pennies in the couch. How much money in total does Alyssa have?",
        "conditions": [
            "As Alyssa was searching through her couch cushions, she found 12 quarters,",
            "and 7 pennies in the couch."
        ],
        "question": "How much money in total does Alyssa have?",
        "equation": "(12*0.25)+(7*0.01)=x",
        "gold_answer": 3.07,
        "verify_condition_index": 0
    },
    {
        "problem": "On Wednesday, Joan spent 4 half-dollars playing pinball. The next day, she spent 14 half-dollars on pinball. What was the total amount Joan spent playing pinball?",
        "conditions": [
            "On Wednesday, Joan spent 4 half-dollars playing pinball.",
            "The next day, she spent 14 half-dollars on pinball."
        ],
        "question": "What was the total amount Joan spent playing pinball?",
        "equation": "(4*0.5)+(14*0.5)=x",
        "gold_answer": 9.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Tim got 3 nickels and 13 dimes for shining shoes, and in his tip jar found 7 dimes and 9 half-dollars. How much money did Tim get?",
        "conditions": [
            "Tim got 3 nickels and 13 dimes for shining shoes,",
            "and in his tip jar found 7 dimes and 9 half-dollars."
        ],
        "question": "How much money did Tim get?",
        "equation": "(3*0.05)+(13*0.1)+(7*0.1)+(9*0.5)=x",
        "gold_answer": 6.65,
        "verify_condition_index": 1
    },
    {
        "problem": "While digging through her clothes for ice cream money, Joan found 15 dimes in her jacket, and 4 dimes in her shorts. How much money did Joan find?",
        "conditions": [
            "While digging through her clothes for ice cream money, Joan found 15 dimes in her jacket,",
            "and 4 dimes in her shorts."
        ],
        "question": "How much money did Joan find?",
        "equation": "(15*0.1)+(4*0.1)=x",
        "gold_answer": 1.9,
        "verify_condition_index": 0
    },
    {
        "problem": "On Friday, Sam spent 2 pennies on ice cream. The next day, Sam spent 12 dimes on baseball cards. All in all, how much money did Sam spend?",
        "conditions": [
            "On Friday, Sam spent 2 pennies on ice cream.",
            "The next day, Sam spent 12 dimes on baseball cards."
        ],
        "question": "All in all, how much money did Sam spend?",
        "equation": "(2*0.01)+(12*0.1)=x",
        "gold_answer": 1.22,
        "verify_condition_index": 1
    },
    {
        "problem": "Joan purchased a basketball game for $5.20, and a racing game for $4.23. How much did Joan spend on video games?",
        "conditions": [
            "Joan purchased a basketball game for $5.20,",
            "and a racing game for $4.23."
        ],
        "question": "How much did Joan spend on video games?",
        "equation": "5.20+4.23=x",
        "gold_answer": 9.43,
        "verify_condition_index": 0
    },
    {
        "problem": "Mike joined his school's band. He bought a trumpet for $145.16, and a song book which was $5.84. How much did Mike spend at the music store?",
        "conditions": [
            "Mike joined his school's band.",
            "He bought a trumpet for $145.16,",
            "and a song book which was $5.84."
        ],
        "question": "How much did Mike spend at the music store?",
        "equation": "145.16+5.84=x",
        "gold_answer": 151.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Alyssa bought some toys. She bought a football for $5.71, and spent $6.59 on marbles. In total, how much did Alyssa spend on toys?",
        "conditions": [
            "Alyssa bought some toys.",
            "She bought a football for $5.71,",
            "and spent $6.59 on marbles."
        ],
        "question": "In total, how much did Alyssa spend on toys?",
        "equation": "5.71+6.59=x",
        "gold_answer": 12.3,
        "verify_condition_index": 1
    },
    {
        "problem": "Keith loves trading cards. She bought 4 packs of Digimon cards for $4.45 each, and a deck of baseball cards for $6.06. How much did Keith spend on cards?",
        "conditions": [
            "Keith loves trading cards.",
            "She bought 4 packs of Digimon cards for $4.45 each,",
            "and a deck of baseball cards for $6.06."
        ],
        "question": "How much did Keith spend on cards?",
        "equation": "(4*4.45)+6.06=x",
        "gold_answer": 23.86,
        "verify_condition_index": 1
    },
    {
        "problem": "Jessica spent $10.22 on a cat toy, and a cage cost her $11.73. What was the total cost of Jessica's purchases?",
        "conditions": [
            "Jessica spent $10.22 on a cat toy,",
            "and a cage cost her $11.73."
        ],
        "question": "What was the total cost of Jessica's purchases?",
        "equation": "10.22+11.73=x",
        "gold_answer": 21.95,
        "verify_condition_index": 0
    },
    {
        "problem": "Sara got fast food for lunch. Sara spent $5.36 on a hotdog and $5.10 on a salad. What was the total of the lunch bill?",
        "conditions": [
            "Sara got fast food for lunch.",
            "Sara spent $5.36 on a hotdog,",
            "and $5.10 on a salad."
        ],
        "question": "What was the total of the lunch bill?",
        "equation": "5.36+5.10=x",
        "gold_answer": 10.46,
        "verify_condition_index": 1
    },
    {
        "problem": "Jason went to the mall on Saturday to buy clothes. He spent $14.28 on shorts and $4.74 on a jacket. In total, how much money did Jason spend on clothing?",
        "conditions": [
            "Jason went to the mall on Saturday to buy clothes.",
            "He spent $14.28 on shorts,",
            "and $4.74 on a jacket."
        ],
        "question": "In total, how much money did Jason spend on clothing?",
        "equation": "14.28+4.74=x",
        "gold_answer": 19.02,
        "verify_condition_index": 1
    },
    {
        "problem": "Alyssa loves eating fruits. Alyssa paid $12.08 for grapes, and $9.85 for cherries. In total, how much money did Alyssa spend?",
        "conditions": [
            "Alyssa loves eating fruits.",
            "Alyssa paid $12.08 for grapes,",
            "and $9.85 for cherries."
        ],
        "question": "In total, how much money did Alyssa spend?",
        "equation": "12.08+9.85=x",
        "gold_answer": 21.93,
        "verify_condition_index": 1
    },
    {
        "problem": "Mary loves eating fruits. Mary paid $11.08 for berries, $14.33 for apples, and $9.31 for peaches. In total, how much money did she spend?",
        "conditions": [
            "Mary loves eating fruits.",
            "Mary paid $11.08 for berries,",
            "$14.33 for apples,",
            "and $9.31 for peaches."
        ],
        "question": "In total, how much money did she spend?",
        "equation": "11.08+14.33+9.31=x",
        "gold_answer": 34.72,
        "verify_condition_index": 1
    },
    {
        "problem": "Sandy went to the mall to buy clothes. She spent $13.99 on shorts, $12.14 on a shirt, and $7.43 on a jacket. How much money did Sandy spend on clothes?",
        "conditions": [
            "Sandy went to the mall to buy clothes.",
            "She spent $13.99 on shorts,",
            "$12.14 on a shirt,",
            "and $7.43 on a jacket."
        ],
        "question": "How much money did Sandy spend on clothes?",
        "equation": "13.99+12.14+7.43=x",
        "gold_answer": 33.56,
        "verify_condition_index": 1
    },
    {
        "problem": "Jason joined his school's band. He bought a flute for $142.46, a music stand for $8.89, and a song book for $7. How much did Jason spend at the music store?",
        "conditions": [
            "Jason joined his school's band.",
            "He bought a flute for $142.46,",
            "a music stand for $8.89,",
            "and a song book for $7."
        ],
        "question": "How much did Jason spend at the music store?",
        "equation": "142.46+8.89+7=x",
        "gold_answer": 158.35,
        "verify_condition_index": 2
    },
    {
        "problem": "Tom purchased a football game for $14.02, a strategy game for $9.46, and a Batman game for $12.04. How much did Tom spend on video games?",
        "conditions": [
            "Tom purchased a football game for $14.02,",
            "a strategy game for $9.46,",
            "and a Batman game for $12.04."
        ],
        "question": "How much did Tom spend on video games?",
        "equation": "14.02+9.46+12.04=x",
        "gold_answer": 35.52,
        "verify_condition_index": 0
    },
    {
        "problem": "Fred loves trading cards. He bought 2 packs of football cards for $2.73 each, a pack of Pokemon cards for $4.01, and a deck of baseball cards for $8.95. How much did Fred spend on cards?",
        "conditions": [
            "Fred loves trading cards.",
            "He bought 2 packs of football cards for $2.73 each,",
            "a pack of Pokemon cards for $4.01,",
            "and a deck of baseball cards for $8.95."
        ],
        "question": "How much did Fred spend on cards?",
        "equation": "(2*2.73)+4.01+8.95=x",
        "gold_answer": 18.42,
        "verify_condition_index": 1
    },
    {
        "problem": "On Saturday, Sara spent $10.62 each on 2 tickets to a movie theater. She also rented a movie for $1.59, and bought a movie for $13.95. How much money in total did Sara spend on movies?",
        "conditions": [
            "On Saturday, Sara spent $10.62 each on 2 tickets to a movie theater.",
            "She also rented a movie for $1.59,",
            "and bought a movie for $13.95."
        ],
        "question": "How much money in total did Sara spend on movies?",
        "equation": "(2*10.62)+1.59=x",
        "gold_answer": 36.78,
        "verify_condition_index": 1
    },
    {
        "problem": "Mike bought some toys. He bought marbles for $9.05, a football for $4.95, and spent $6.52 on a baseball. In total, how much did Mike spend on toys?",
        "conditions": [
            "Mike bought some toys.",
            "He bought marbles for $9.05,",
            "a football for $4.95,",
            "and spent $6.52 on a baseball."
        ],
        "question": "In total, how much did Mike spend on toys?",
        "equation": "9.05+4.95+6.52=x",
        "gold_answer": 20.52,
        "verify_condition_index": 1
    },
    {
        "problem": "Mary loves eating fruits. Mary paid $7.19 for berries, and $6.83 for peaches with a $20 bill. How much change did Mary receive?",
        "conditions": [
            "Mary loves eating fruits.",
            "Mary paid $7.19 for berries,",
            "and $6.83 for peaches with a $20 bill."
        ],
        "question": "How much change did Mary receive?",
        "equation": "(7.19+6.83)+x=20",
        "gold_answer": 5.98,
        "verify_condition_index": 1
    },
    {
        "problem": "Sandy went to the mall on Saturday to buy clothes. She paid $9.24 on pants and $8.25 on a shirt with a $20 bill. How much money did Sandy get in change?",
        "conditions": [
            "Sandy went to the mall on Saturday to buy clothes.",
            "She paid $9.24 on pants,",
            "and $8.25 on a shirt with a $20 bill."
        ],
        "question": "How much money did Sandy get in change?",
        "equation": "9.24+8.25+x=20",
        "gold_answer": 2.51,
        "verify_condition_index": 1
    },
    {
        "problem": "Joan paid $8.77 on a cat toy, and a cage cost her $10.97 with a $20 bill. How much change did Joan receive?",
        "conditions": [
            "Joan paid $8.77 on a cat toy,",
            "and a cage cost her $10.97 with a $20 bill."
        ],
        "question": "How much change did Joan receive?",
        "equation": "8.77+10.97+x=20",
        "gold_answer": 0.26,
        "verify_condition_index": 0
    },
    {
        "problem": "On Friday, Fred paid $5.92 each on 2 tickets to a movie theater. He also borrowed a movie for $6.79. Fred paid with a $20 bill. How much change did Fred receive?",
        "conditions": [
            "On Friday, Fred paid $5.92 each on 2 tickets to a movie theater.",
            "He also borrowed a movie for $6.79.",
            "Fred paid with a $20 bill."
        ],
        "question": "How much change did Fred receive?",
        "equation": "(2*5.92)+6.79+x=20",
        "gold_answer": 1.37,
        "verify_condition_index": 0
    },
    {
        "problem": "Sandy bought some toys. She bought a football for $9.14, and paid $6.81 on a baseball with a $20 bill. How much change did he receive from the purchase?",
        "conditions": [
            "Sandy bought some toys.",
            "She bought a football for $9.14,",
            "and paid $6.81 on a baseball with a $20 bill."
        ],
        "question": "How much change did he receive from the purchase?",
        "equation": "9.14+6.81+x=20",
        "gold_answer": 4.05,
        "verify_condition_index": 1
    },
    {
        "problem": "A ship is filled with 5,973 tons of cargo. It stops in the Bahamas, where sailors load 8,723 more tons of cargo onboard. How many tons of cargo does the ship hold now?",
        "conditions": [
            "A ship is filled with 5,973 tons of cargo.",
            "It stops in the Bahamas, where sailors load 8,723 more tons of cargo onboard."
        ],
        "question": "How many tons of cargo does the ship hold now?",
        "equation": "5973+8723=x",
        "gold_answer": 14696.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Before December, customers buy 1,346 ear muffs from the mall. During December, they buy 6,444 more, and there are none left. In all, how many ear muffs do the customers buy?",
        "conditions": [
            "Before December, customers buy 1,346 ear muffs from the mall.",
            "During December, they buy 6,444 more,",
            "and there are none left."
        ],
        "question": "In all, how many ear muffs do the customers buy?",
        "equation": "1346+6444=x",
        "gold_answer": 7790.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Diane is a beekeeper. Last year, she harvested 2,479 pounds of honey. This year, she bought some new hives and increased her honey harvest by 6,085 pounds. How many pounds of honey did Diane harvest this year?",
        "conditions": [
            "Diane is a beekeeper.",
            "Last year, she harvested 2,479 pounds of honey.",
            "This year, she bought some new hives",
            "and increased her honey harvest by 6,085 pounds."
        ],
        "question": "How many pounds of honey did Diane harvest this year?",
        "equation": "2479+6085=x",
        "gold_answer": 8564.0,
        "verify_condition_index": 1
    },
    {
        "problem": "An oil pipe in the sea broke. Before engineers started to fix the pipe, 6,522 liters of oil leaked into the water. While the engineers worked, the pipe leaked 5,165 more liters of oil. In all, how many liters of oil leaked into the water?",
        "conditions": [
            "An oil pipe in the sea broke.",
            "Before engineers started to fix the pipe, 6,522 liters of oil leaked into the water.",
            "While the engineers worked, the pipe leaked 5,165 more liters of oil."
        ],
        "question": "In all, how many liters of oil leaked into the water?",
        "equation": "6522+5165=x",
        "gold_answer": 11687.0,
        "verify_condition_index": 1
    },
    {
        "problem": "A car company produced 3,884 cars in North America and 2,871 cars in Europe. How many cars is that in all?",
        "conditions": [
            "A car company produced 3,",
            "884 cars in North America and 2,",
            "871 cars in Europe."
        ],
        "question": "How many cars is that in all?",
        "equation": "3884+2871=x",
        "gold_answer": 6755.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Abe's family moved from the Bahamas to Japan, so they had convert their money into Japanese yen. Their checking account now has 6,359 yen and their savings account now has 3,485 yen. How many yen do they have?",
        "conditions": [
            "Abe's family moved from the Bahamas to Japan, so they had convert their money into Japanese yen.",
            "Their checking account now has 6,359 yen",
            "and their savings account now has 3,485 yen."
        ],
        "question": "How many yen do they have?",
        "equation": "6359+3485=x",
        "gold_answer": 9844.0,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 1,986 books in Oak Grove's public library. In addition, there are 5,106 books in its school libraries. How many books do the libraries in Oak Grove have overall?",
        "conditions": [
            "There are 1,986 books in Oak Grove's public library.",
            "In addition, there are 5,106 books in its school libraries."
        ],
        "question": "How many books do the libraries in Oak Grove have overall?",
        "equation": "1986+5106=x",
        "gold_answer": 7092.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There were originally 20,817 houses in Lincoln County. During a housing boom, developers built 97,741 more. How many houses are there now in Lincoln County?",
        "conditions": [
            "There were originally 20,817 houses in Lincoln County.",
            "During a housing boom, developers built 97,741 more."
        ],
        "question": "How many houses are there now in Lincoln County?",
        "equation": "20817+97741=x",
        "gold_answer": 118558.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A farmer estimates that he will harvest 48,097 bushels of wheat. The weather is perfect during the growing season, so he harvests 684 more bushels of wheat than expected. How many bushels of wheat does the farmer harvest?",
        "conditions": [
            "A farmer estimates that he will harvest 48,097 bushels of wheat.",
            "The weather is perfect during the growing season, so he harvests 684 more bushels of wheat than expected."
        ],
        "question": "How many bushels of wheat does the farmer harvest?",
        "equation": "48097+684=x",
        "gold_answer": 48781.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Christina just transferred $69 out of her bank account. As a result, the account now has $26,935 left in it. How much money was in the account before the transfer?",
        "conditions": [
            "Christina just transferred $69 out of her bank account.",
            "As a result, the account now has $26,935 left in it."
        ],
        "question": "How much money was in the account before the transfer?",
        "equation": "x-69=26935",
        "gold_answer": 27004.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Last year at Newberg's airport, 14,507 passengers landed on time. Unfortunately, 213 passengers landed late. In all, how many passengers landed in Newberg last year?",
        "conditions": [
            "Last year at Newberg's airport, 14,507 passengers landed on time.",
            "Unfortunately, 213 passengers landed late."
        ],
        "question": "In all, how many passengers landed in Newberg last year?",
        "equation": "14507+213=x",
        "gold_answer": 14720.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A dust storm sweeps across the prairie. It covers 64,535 acres of the prairie in dust, but leaves 522 acres untouched. How many acres does the prairie cover?",
        "conditions": [
            "A dust storm sweeps across the prairie.",
            "It covers 64,535 acres of the prairie in dust,",
            "but leaves 522 acres untouched."
        ],
        "question": "How many acres does the prairie cover?",
        "equation": "64535+522=x",
        "gold_answer": 65057.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Some insects called aphids attack a large farm. In response, the farmer releases ladybugs onto the fields. There are 12,170 ladybugs with spots and 54,912 ladybugs without spots. How many ladybugs are there in all?",
        "conditions": [
            "Some insects called aphids attack a large farm.",
            "In response, the farmer releases ladybugs onto the fields.",
            "There are 12,170 ladybugs with spots",
            "and 54,912 ladybugs without spots."
        ],
        "question": "How many ladybugs are there in all?",
        "equation": "12170+54912=x",
        "gold_answer": 67082.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Last year, 90,171 people were born in a country, and 16,320 people immigrated to it. How many new people began living in the country last year?",
        "conditions": [
            "Last year, 90,171 people were born in a country,",
            "and 16,320 people immigrated to it."
        ],
        "question": "How many new people began living in the country last year?",
        "equation": "90171+16320=x",
        "gold_answer": 106491.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A ship full of grain crashes into a coral reef. By the time the ship is fixed, 49,952 tons of grain have spilled into the water. Only 918 tons of grain remain onboard. How many tons of grain did the ship originally contain?",
        "conditions": [
            "A ship full of grain crashes into a coral reef.",
            "By the time the ship is fixed, 49,952 tons of grain have spilled into the water.",
            "Only 918 tons of grain remain onboard."
        ],
        "question": "How many tons of grain did the ship originally contain?",
        "equation": "49952+918=x",
        "gold_answer": 50870.0,
        "verify_condition_index": 1
    },
    {
        "problem": "To fill an order, the factory dyed 61,921 yards of silk green and 49,500 yards pink. How many yards of silk did it dye for that order?",
        "conditions": [
            "To fill an order, the factory dyed 61,921 yards of silk green",
            "and 49,500 yards pink."
        ],
        "question": "How many yards of silk did it dye for that order?",
        "equation": "61921+49500=x",
        "gold_answer": 111421.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A multi-national corporation has 2,041 part-time employees and 63,093 full-time employees. How many employees work for the corporation?",
        "conditions": [
            "A multi-national corporation has 2,041 part-time employees",
            "and 63,093 full-time employees."
        ],
        "question": "How many employees work for the corporation?",
        "equation": "2041+63093=x",
        "gold_answer": 65134.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Each year, salmon travel upstream, going from the ocean to the rivers where they were born. This year, 712,261 male and 259,378 female salmon returned to their rivers. How many salmon made the trip?",
        "conditions": [
            "Each year, salmon travel upstream, going from the ocean to the rivers where they were born.",
            "This year, 712,261 male and 259,378 female salmon returned to their rivers."
        ],
        "question": "How many salmon made the trip?",
        "equation": "712261+259378=x",
        "gold_answer": 971639.0,
        "verify_condition_index": 1
    },
    {
        "problem": "A bathing suit manufacturer has a supply of 14,797 bathing suits for men. In addition, it has 4,969 bathing suits for women. How many bathing suits are available overall?",
        "conditions": [
            "A bathing suit manufacturer has a supply of 14,797 bathing suits for men.",
            "In addition, it has 4,969 bathing suits for women."
        ],
        "question": "How many bathing suits are available overall?",
        "equation": "14797+4969=x",
        "gold_answer": 19766.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Before the recent housing boom, there were 1,426 houses in Lawrence County. Now, there are 2,000 houses. How many houses did developers build during the housing boom?",
        "conditions": [
            "Before the recent housing boom, there were 1,426 houses in Lawrence County.",
            "Now, there are 2,000 houses."
        ],
        "question": "How many houses did developers build during the housing boom?",
        "equation": "1426+x=2000",
        "gold_answer": 574.0,
        "verify_condition_index": 1
    },
    {
        "problem": "A worker at a medical lab is studying blood samples. Two samples contained a total of 7,341 blood cells. The first sample contained 4,221 blood cells. How many blood cells were in the second sample?",
        "conditions": [
            "A worker at a medical lab is studying blood samples.",
            "Two samples contained a total of 7,341 blood cells.",
            "The first sample contained 4,221 blood cells."
        ],
        "question": "How many blood cells were in the second sample?",
        "equation": "7341=4221+x",
        "gold_answer": 3120.0,
        "verify_condition_index": 1
    },
    {
        "problem": "So far, an orchard has sold a combined total of 9,792 pounds of fresh and frozen fruit this season. If they have sold 3,513 pounds of frozen fruit, how many pounds of fresh fruit have been sold so far?",
        "conditions": [
            "So far, an orchard has sold a combined total of 9,792 pounds of fresh and frozen fruit this season."
        ],
        "question": "If they have sold 3,513 pounds of frozen fruit, how many pounds of fresh fruit have been sold so far?",
        "equation": "9792=3513+x",
        "gold_answer": 6279.0,
        "verify_condition_index": 0
    },
    {
        "problem": "On Saturday, Sara spent $10.62 each on 2 tickets to a movie theater. Sara also rented a movie for $1.59, and bought a movie for $13.95. How much money in total did Sara spend on movies?",
        "conditions": [
            "On Saturday, Sara spent $10.62 each on 2 tickets to a movie theater.",
            "Sara also rented a movie for $1.59,",
            "and bought a movie for $13.95."
        ],
        "question": "How much money in total did Sara spend on movies?",
        "equation": "(2*10.62)+1.59+13.59=x",
        "gold_answer": 36.78,
        "verify_condition_index": 1
    },
    {
        "problem": "Jonathan wants to buy a dictionary that costs $11, a dinosaur book that costs $19, and a children's cookbook that costs $7. He has saved $8 from his allowance. How much more money does Jonathan need to buy all three books?",
        "conditions": [
            "Jonathan wants to buy a dictionary that costs $11,",
            "a dinosaur book that costs $19,",
            "and a children's cookbook that costs $7.",
            "He has saved $8 from his allowance."
        ],
        "question": "How much more money does Jonathan need to buy all three books?",
        "equation": "((11+19)+7)-8=x",
        "gold_answer": 29.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Dana earns $13 per hour. She worked 9 hours on Friday, 10 hours on Saturday, and 3 hours on Sunday. How much money did Dana earn in all?",
        "conditions": [
            "Dana earns $13 per hour.",
            "She worked 9 hours on Friday,",
            "10 hours on Saturday,",
            "and 3 hours on Sunday."
        ],
        "question": "How much money did Dana earn in all?",
        "equation": "13*((9+10)+3)=x",
        "gold_answer": 286.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Tanner saved $17 in September. He saved $48 in October and $25 in November. Then Tanner spent $49 on a video game. How much money does Tanner have left?",
        "conditions": [
            "Tanner saved $17 in September.",
            "He saved $48 in October,",
            "and $25 in November.",
            "Then Tanner spent $49 on a video game."
        ],
        "question": "How much money does Tanner have left?",
        "equation": "((17+48)+25)-49=x",
        "gold_answer": 41.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mika had 20 stickers. She bought 26 stickers from a store in the mall and got 20 stickers for her birthday. Then Mika gave 6 of the stickers to her sister and used 58 to decorate a greeting card. How many stickers does Mika have left?",
        "conditions": [
            "Mika had 20 stickers.",
            "She bought 26 stickers from a store in the mall,",
            "and got 20 stickers for her birthday.",
            "Then Mika gave 6 of the stickers to her sister,",
            "and used 58 to decorate a greeting card."
        ],
        "question": "How many stickers does Mika have left?",
        "equation": "((20+26)+20)-(6+58)=x",
        "gold_answer": 2.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A group of science students went on a field trip. They took 6 vans and 8 buses. There were 6 people in each van and 18 people in each bus. How many people went on the field trip?",
        "conditions": [
            "A group of science students went on a field trip.",
            "They took 6 vans,",
            "and 8 buses.",
            "There were 6 people in each van,",
            "and 18 people in each bus."
        ],
        "question": "How many people went on the field trip?",
        "equation": "(6*6)+(8*18)=x",
        "gold_answer": 180.0,
        "verify_condition_index": 3
    },
    {
        "problem": "Carrie's mom gave her $91 to go shopping. She bought a sweater for $24, a T-shirt for $6, and a pair of shoes for $11. How much money does Carrie have left?",
        "conditions": [
            "Carrie's mom gave her $91 to go shopping.",
            "She bought a sweater for $24,",
            "a T-shirt for $6,",
            "and a pair of shoes for $11."
        ],
        "question": "How much money does Carrie have left?",
        "equation": "91-((24+6)+11)=x",
        "gold_answer": 50.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Kylie was collecting coins. She got 15 coins from her piggy bank and 13 coins from her brother. Her father gave Kylie 8 coins. Kylie gave 21 of the coins to her friend Laura. How many coins did Kylie have left?",
        "conditions": [
            "Kylie was collecting coins.",
            "She got 15 coins from her piggy bank,",
            "and 13 coins from her brother.",
            "Her father gave Kylie 8 coins.",
            "Kylie gave 21 of the coins to her friend Laura."
        ],
        "question": "How many coins did Kylie have left?",
        "equation": "((15+13)+8)-21=x",
        "gold_answer": 15.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Justin needs 61 paper plates for a birthday party. He already has 26 blue plates and 7 red plates. How many more plates should Justin buy?",
        "conditions": [
            "Justin needs 61 paper plates for a birthday party.",
            "He already has 26 blue plates,",
            "and 7 red plates."
        ],
        "question": "How many more plates should Justin buy?",
        "equation": "61-(26+7)=x",
        "gold_answer": 28.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mark's father gave him $85. Mark bought 10 books, each of which cost $5. How much money does Mark have left?",
        "conditions": [
            "Mark's father gave him $85.",
            "Mark bought 10 books, each of which cost $5."
        ],
        "question": "How much money does Mark have left?",
        "equation": "85-(10*5)=x",
        "gold_answer": 35.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Elise had $8. Then she saved $13 from her allowance and spent $2 on a comic book and $18 on a puzzle. How much money does Elise have left?",
        "conditions": [
            "Elise had $8.",
            "Then she saved $13 from her allowance and spent $2 on a comic book,",
            "and $18 on a puzzle."
        ],
        "question": "How much money does Elise have left?",
        "equation": "(8+13)-(2+18)=x",
        "gold_answer": 1.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Luke had 20 stickers. He bought 12 stickers from a store in the mall and got 20 stickers for his birthday. Then Luke gave 5 of the stickers to his sister and used 8 to decorate a greeting card. How many stickers does Luke have left?",
        "conditions": [
            "Luke had 20 stickers.",
            "He bought 12 stickers from a store in the mall,",
            "and got 20 stickers for his birthday.",
            "Then Luke gave 5 of the stickers to his sister,",
            "and used 8 to decorate a greeting card."
        ],
        "question": "How many stickers does Luke have left?",
        "equation": "(((20+12)+20)-5)-8=x",
        "gold_answer": 39.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Johnny saved $30 in September. He saved $49 in October and $46 in November. Then Johnny spent $58 on a video game. How much money does Johnny have left?",
        "conditions": [
            "Johnny saved $30 in September.",
            "He saved $49 in October,",
            "and $46 in November.",
            "Then Johnny spent $58 on a video game."
        ],
        "question": "How much money does Johnny have left?",
        "equation": "(30+(49+46))-58=x",
        "gold_answer": 67.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Seth bought 20 cartons of ice cream and 2 cartons of yogurt. Each carton of ice cream cost $6 and each carton of yogurt cost $1. How much more did Seth spend on ice cream than on yogurt?",
        "conditions": [
            "Seth bought 20 cartons of ice cream,",
            "and 2 cartons of yogurt.",
            "Each carton of ice cream cost $6,",
            "and each carton of yogurt cost $1."
        ],
        "question": "How much more did Seth spend on ice cream than on yogurt?",
        "equation": "(20*6)-(2*1)=x",
        "gold_answer": 118.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Dalton wants to buy a jump rope that costs $7, a board game that costs $12, and a playground ball that costs $4. He has saved $6 from his allowance, and his uncle gave him $13. How much more money does Dalton need to buy the jump rope, the game, and the ball?",
        "conditions": [
            "Dalton wants to buy a jump rope that costs $7,",
            "a board game that costs $12,",
            "and a playground ball that costs $4.",
            "He has saved $6 from his allowance,",
            "and his uncle gave him $13."
        ],
        "question": "How much more money does Dalton need to buy the jump rope, the game, and the ball?",
        "equation": "((7+12)+4)-(6+13)=x",
        "gold_answer": 4.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Vincent bought 10 books about animals, 1 book about outer space, and 3 books about trains. Each book cost $16. How much did Vincent spend on the books?",
        "conditions": [
            "Vincent bought 10 books about animals,",
            "1 book about outer space,",
            "and 3 books about trains.",
            "Each book cost $16."
        ],
        "question": "How much did Vincent spend on the books?",
        "equation": "((10+1)+3)*16=x",
        "gold_answer": 224.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Priya needs 54 cupcakes for a birthday party. She already has 15 chocolate cupcakes and 25 vanilla cupcakes. How many more cupcakes should Priya buy?",
        "conditions": [
            "Priya needs 54 cupcakes for a birthday party.",
            "She already has 15 chocolate cupcakes,",
            "and 25 vanilla cupcakes."
        ],
        "question": "How many more cupcakes should Priya buy?",
        "equation": "54-(15+25)=x",
        "gold_answer": 14.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Maria needs 21 cartons of berries to make a berry cobbler. She already has 4 cartons of strawberries and 8 cartons of blueberries. How many more cartons of berries should Maria buy?",
        "conditions": [
            "Maria needs 21 cartons of berries to make a berry cobbler.",
            "She already has 4 cartons of strawberries,",
            "and 8 cartons of blueberries."
        ],
        "question": "How many more cartons of berries should Maria buy?",
        "equation": "21-(4+8)=x",
        "gold_answer": 9.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 24 bicycles and 14 tricycles in the storage area at Danny's apartment building. Each bicycle has 2 wheels and each tricycle has 3 wheels. How many wheels are there in all?",
        "conditions": [
            "There are 24 bicycles,",
            "and 14 tricycles in the storage area at Danny's apartment building.",
            "Each bicycle has 2 wheels,",
            "and each tricycle has 3 wheels."
        ],
        "question": "How many wheels are there in all?",
        "equation": "(24*2)+(14*3)=x",
        "gold_answer": 90.0,
        "verify_condition_index": 3
    },
    {
        "problem": "Paula's aunt gave her $109 to spend on clothes at the mall. She bought 2 shirts that cost $11 each and a pair of pants that cost $13. How much money does Paula have left to buy more clothes?",
        "conditions": [
            "Paula's aunt gave her $109 to spend on clothes at the mall.",
            "She bought 2 shirts that cost $11 each,",
            "and a pair of pants that cost $13."
        ],
        "question": "How much money does Paula have left to buy more clothes?",
        "equation": "109-((2*11)+13)=x",
        "gold_answer": 74.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mary has 9 yellow marbles. Joan has 3 yellow marbles. How many yellow marbles do they have in all ?",
        "conditions": [
            "Mary has 9 yellow marbles.",
            "Joan has 3 yellow marbles."
        ],
        "question": "How many yellow marbles do they have in all ?",
        "equation": "9+3=x",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jason had Pokemon cards. Jason gave 9 to his friends. Jason now has 4 Pokemon cards left. How many Pokemon cards did Jason have to start with ?",
        "conditions": [
            "Jason had Pokemon cards.",
            "Jason gave 9 to his friends.",
            "Jason now has 4 Pokemon cards left."
        ],
        "question": "How many Pokemon cards did Jason have to start with ?",
        "equation": "x-9=4",
        "gold_answer": 13.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Adam bought 9 packages of cat food and 7 packages of dog food. Each package of cat food contained 10 cans, and each package of dog food contained 5 cans. How many more cans of cat food than dog food did Adam buy?",
        "conditions": [
            "Adam bought 9 packages of cat food,",
            "and 7 packages of dog food.",
            "Each package of cat food contained 10 cans,",
            "and each package of dog food contained 5 cans."
        ],
        "question": "How many more cans of cat food than dog food did Adam buy?",
        "equation": "(9*10)-(7*5)=x",
        "gold_answer": 55.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Zach wants to ride the Ferris wheel, the roller coaster, and the log ride. The Ferris wheel costs 2 tickets, the roller coaster costs 7 tickets and the log ride costs 1 ticket. Zach has 1 ticket. How many more tickets should Zach buy?",
        "conditions": [
            "Zach wants to ride the Ferris wheel, the roller coaster, and the log ride.",
            "The Ferris wheel costs 2 tickets,",
            "the roller coaster costs 7 tickets and the log ride costs 1 ticket.",
            "Zach has 1 ticket."
        ],
        "question": "How many more tickets should Zach buy?",
        "equation": "2+7+1=1+x",
        "gold_answer": 9.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Randy needs 53 cupcakes for a birthday party. He already has 7 chocolate cupcakes and 19 vanilla cupcakes. How many more cupcakes should Randy buy?",
        "conditions": [
            "Randy needs 53 cupcakes for a birthday party.",
            "He already has 7 chocolate cupcakes,",
            "and 19 vanilla cupcakes."
        ],
        "question": "How many more cupcakes should Randy buy?",
        "equation": "53=7+14+x",
        "gold_answer": 32.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Maggie bought 4 packs of red bouncy balls, 8 packs of yellow bouncy balls, and 4 packs of green bouncy balls. There were 10 bouncy balls in each package. How many bouncy balls did Maggie buy in all?",
        "conditions": [
            "Maggie bought 4 packs of red bouncy balls,",
            "8 packs of yellow bouncy balls,",
            "and 4 packs of green bouncy balls.",
            "There were 10 bouncy balls in each package."
        ],
        "question": "How many bouncy balls did Maggie buy in all?",
        "equation": "(4+8+4)*10=x",
        "gold_answer": 160.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Your class is having a pizza party. You buy 5 pizzas. Each pizza has 4 slices. How many slices is that altogether?",
        "conditions": [
            "Your class is having a pizza party.",
            "You buy 5 pizzas.",
            "Each pizza has 4 slices."
        ],
        "question": "How many slices is that altogether?",
        "equation": "5*4=x",
        "gold_answer": 20.0,
        "verify_condition_index": 2
    },
    {
        "problem": "My car gets 20 miles per gallon of gas. How many miles can I drive on 5 gallons of gas?",
        "conditions": [
            "My car gets 20 miles per gallon of gas."
        ],
        "question": "How many miles can I drive on 5 gallons of gas?",
        "equation": "20*5=x",
        "gold_answer": 100.0,
        "verify_condition_index": 0
    },
    {
        "problem": "58 children are taking a bus to the zoo. They sit 2 children in every seat. How many seats will the children need in all?",
        "conditions": [
            "58 children are taking a bus to the zoo.",
            "They sit 2 children in every seat."
        ],
        "question": "How many seats will the children need in all?",
        "equation": "58/2=x",
        "gold_answer": 29.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Marlee has 12 guests coming to her Halloween party. Each table will hold 3 guests. How many tables will Marlee need?",
        "conditions": [
            "Marlee has 12 guests coming to her Halloween party.",
            "Each table will hold 3 guests."
        ],
        "question": "How many tables will Marlee need?",
        "equation": "12/3=x",
        "gold_answer": 4.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Ellen went to a garage sale to buy chairs. Each chair is 15 dollars. How much did Ellen spend for the 12 chairs she bought?",
        "conditions": [
            "Ellen went to a garage sale to buy chairs.",
            "Each chair is 15 dollars."
        ],
        "question": "How much did Ellen spend for the 12 chairs she bought?",
        "equation": "15*12=x",
        "gold_answer": 180.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Oscar's bus ride to school is 0.75 of a mile and Charlie's bus ride is 0.25 of a mile. How much longer is Oscar's bus ride than Charlie's?",
        "conditions": [
            "Oscar's bus ride to school is 0.75 of a mile,",
            "and Charlie's bus ride is 0.25 of a mile."
        ],
        "question": "How much longer is Oscar's bus ride than Charlie's?",
        "equation": "0.75 - 0.25 = x",
        "gold_answer": 0.5,
        "verify_condition_index": 0
    },
    {
        "problem": "Karen added 0.25 of a cup of walnuts to a batch of trail mix. Later, she added 0.25 of a cup of almonds. How many cups of nuts did Karen put in the trail mix in all?",
        "conditions": [
            "Karen added 0.25 of a cup of walnuts to a batch of trail mix.",
            "Later, she added 0.25 of a cup of almonds."
        ],
        "question": "How many cups of nuts did Karen put in the trail mix in all?",
        "equation": "0.25 + 0.25 = x",
        "gold_answer": 0.5,
        "verify_condition_index": 0
    },
    {
        "problem": "Kendall is learning to drive, so this weekend she practiced driving 0.16666666666666666 of a mile with her mother and another 0.5 of a mile with her father. How far did Kendall drive in all?",
        "conditions": [
            "Kendall is learning to drive, so this weekend she practiced driving 0.16666666666666666 of a mile with her mother",
            "and another 0.5 of a mile with her father."
        ],
        "question": "How far did Kendall drive in all?",
        "equation": "0.16666666666666666 + 0.5 = x",
        "gold_answer": 0.6666666666666666,
        "verify_condition_index": 0
    },
    {
        "problem": "At a pie-eating contest, Erik got through 0.6666666666666666 of a pie before time was called; Frank finished just 0.3333333333333333 of a pie. How much more pie did Erik eat than Frank?",
        "conditions": [
            "At a pie-eating contest, Erik got through 0.6666666666666666 of a pie before time was called; Frank finished just 0.3333333333333333 of a pie."
        ],
        "question": "How much more pie did Erik eat than Frank?",
        "equation": "0.6666666666666666 - 0.3333333333333333 = x",
        "gold_answer": 0.3333333333333333,
        "verify_condition_index": 0
    },
    {
        "problem": "A tailor cut 0.75 of an inch off a skirt and 0.5 of an inch off a pair of pants. How much more did the tailor cut off the skirt than the pants?",
        "conditions": [
            "A tailor cut 0.75 of an inch off a skirt,",
            "and 0.5 of an inch off a pair of pants."
        ],
        "question": "How much more did the tailor cut off the skirt than the pants?",
        "equation": "0.75 - 0.5 = x",
        "gold_answer": 0.25,
        "verify_condition_index": 0
    },
    {
        "problem": "At Lindsey's Vacation Wear, 0.375 of the garments are bikinis and 0.25 are trunks. What fraction of the garments are either bikinis or trunks?",
        "conditions": [
            "At Lindsey's Vacation Wear, 0.375 of the garments are bikinis",
            "and 0.25 are trunks."
        ],
        "question": "What fraction of the garments are either bikinis or trunks?",
        "equation": "0.375 + 0.25 = x",
        "gold_answer": 0.625,
        "verify_condition_index": 0
    },
    {
        "problem": "Darnel sprinted 0.875 of a lap and then took a break by jogging 0.75 of a lap. How much farther did Darnel sprint than jog?",
        "conditions": [
            "Darnel sprinted 0.875 of a lap,",
            "and then took a break by jogging 0.75 of a lap."
        ],
        "question": "How much farther did Darnel sprint than jog?",
        "equation": "0.875 - 0.75 = x",
        "gold_answer": 0.125,
        "verify_condition_index": 0
    },
    {
        "problem": "A marine biologist measured one fish that was 0.3 of a foot long and a second fish that was 0.2 of a foot long. How much longer was the first fish?",
        "conditions": [
            "A marine biologist measured one fish that was 0.3 of a foot long,",
            "and a second fish that was 0.2 of a foot long."
        ],
        "question": "How much longer was the first fish?",
        "equation": "0.3 - 0.2 = x",
        "gold_answer": 0.1,
        "verify_condition_index": 1
    },
    {
        "problem": "Hannah's Vegetarian Restaurant bought 0.3333333333333333 of a pound of green peppers and 0.3333333333333333 of a pound of red peppers. How many pounds of peppers did Hannah's Vegetarian Restaurant buy in all?",
        "conditions": [
            "Hannah's Vegetarian Restaurant bought 0.3333333333333333 of a pound of green peppers,",
            "and 0.3333333333333333 of a pound of red peppers."
        ],
        "question": "How many pounds of peppers did Hannah's Vegetarian Restaurant buy in all?",
        "equation": "0.3333333333333333 + 0.3333333333333333 = x",
        "gold_answer": 0.6666666666666666,
        "verify_condition_index": 0
    },
    {
        "problem": "Ella owns two dogs. Each day, one dog eats 0.125 of a scoop of dog food and the other dog eats 0.125 of a scoop. Together, how much dog food do the two dogs eat each day?",
        "conditions": [
            "Ella owns two dogs.",
            "Each day, one dog eats 0.125 of a scoop of dog food",
            "and the other dog eats 0.125 of a scoop."
        ],
        "question": "Together, how much dog food do the two dogs eat each day?",
        "equation": "0.125 + 0.125 = x",
        "gold_answer": 0.25,
        "verify_condition_index": 1
    },
    {
        "problem": "Blake filled a bucket with 0.8 of a gallon of water. Later, he poured out 0.2 of a gallon of the water. How much water is left in the bucket?",
        "conditions": [
            "Blake filled a bucket with 0.8 of a gallon of water.",
            "Later, he poured out 0.2 of a gallon of the water."
        ],
        "question": "How much water is left in the bucket?",
        "equation": "0.8 - 0.2 = x",
        "gold_answer": 0.6,
        "verify_condition_index": 0
    },
    {
        "problem": "Mandy made an apple pie. She used 0.6666666666666666 of a tablespoon of cinnamon and 0.5 of a tablespoon of nutmeg. How much more cinnamon than nutmeg did Mandy use?",
        "conditions": [
            "Mandy made an apple pie.",
            "She used 0.6666666666666666 of a tablespoon of cinnamon,",
            "and 0.5 of a tablespoon of nutmeg."
        ],
        "question": "How much more cinnamon than nutmeg did Mandy use?",
        "equation": "0.6666666666666666 - 0.5 = x",
        "gold_answer": 0.16666666666666666,
        "verify_condition_index": 1
    },
    {
        "problem": "The Montoya family spends 0.6 of their budget on groceries and another 0.2 going out to eat. Altogether, what fraction of their budget does the Montoya family spend on food?",
        "conditions": [
            "The Montoya family spends 0.6 of their budget on groceries,",
            "and another 0.2 going out to eat."
        ],
        "question": "Altogether, what fraction of their budget does the Montoya family spend on food?",
        "equation": "0.6 + 0.2 = x",
        "gold_answer": 0.8,
        "verify_condition_index": 0
    },
    {
        "problem": "In Mr.Olsen's mathematics class, 0.7 of the students received A's and 0.2 received B's. What fraction of the students received either A's or B's?",
        "conditions": [
            "In Mr.Olsen's mathematics class, 0.7 of the students received A's",
            "and 0.2 received B's."
        ],
        "question": "What fraction of the students received either A's or B's?",
        "equation": "0.7 + 0.2 = x",
        "gold_answer": 0.9,
        "verify_condition_index": 1
    },
    {
        "problem": "There is 0.16666666666666666 of a cup of oil in Scarlett's measuring cup. If Scarlett adds 0.6666666666666666 of a cup more, how much oil will be in the measuring cup?",
        "conditions": [
            "There is 0.16666666666666666 of a cup of oil in Scarlett's measuring cup."
        ],
        "question": "If Scarlett adds 0.6666666666666666 of a cup more, how much oil will be in the measuring cup?",
        "equation": "0.16666666666666666 + 0.6666666666666666 = x",
        "gold_answer": 0.8333333333333334,
        "verify_condition_index": 0
    },
    {
        "problem": "One evening, a restaurant served a total of 0.2 of a loaf of wheat bread and 0.4 of a loaf of white bread. How many loaves were served in all?",
        "conditions": [
            "One evening, a restaurant served a total of 0.2 of a loaf of wheat bread",
            "and 0.4 of a loaf of white bread."
        ],
        "question": "How many loaves were served in all?",
        "equation": "0.2 + 0.4 = x",
        "gold_answer": 0.6,
        "verify_condition_index": 1
    },
    {
        "problem": "Stanley ran 0.4 of a mile and walked 0.2 of a mile. How much farther did Stanley run than walk?",
        "conditions": [
            "Stanley ran 0.4 of a mile,",
            "and walked 0.2 of a mile."
        ],
        "question": "How much farther did Stanley run than walk?",
        "equation": "0.4 - 0.2 = x",
        "gold_answer": 0.2,
        "verify_condition_index": 0
    },
    {
        "problem": "Dina made cookies. She used 0.625 of a cup of flour and 0.25 of a cup of sugar. How much more flour than sugar did Dina use?",
        "conditions": [
            "Dina made cookies.",
            "She used 0.625 of a cup of flour,",
            "and 0.25 of a cup of sugar."
        ],
        "question": "How much more flour than sugar did Dina use?",
        "equation": "0.625 - 0.25 = x",
        "gold_answer": 0.375,
        "verify_condition_index": 1
    },
    {
        "problem": "Each day, the polar bear at Richmond's zoo eats 0.2 of a bucket of trout and 0.4 of a bucket of salmon. How many buckets of fish does the polar bear eat daily?",
        "conditions": [
            "Each day, the polar bear at Richmond's zoo eats 0.2 of a bucket of trout",
            "and 0.4 of a bucket of salmon."
        ],
        "question": "How many buckets of fish does the polar bear eat daily?",
        "equation": "0.2 + 0.4 = x",
        "gold_answer": 0.6,
        "verify_condition_index": 0
    },
    {
        "problem": "Jenny ran 0.6 of a mile and walked 0.4 of a mile. How much farther did Jenny run than walk?",
        "conditions": [
            "Jenny ran 0.6 of a mile,",
            "and walked 0.4 of a mile."
        ],
        "question": "How much farther did Jenny run than walk?",
        "equation": "0.6 - 0.4 = x",
        "gold_answer": 0.2,
        "verify_condition_index": 0
    },
    {
        "problem": "0.5 of the students in the band are in the trumpet section. 0.125 of the students in the band are in the trombone section. What fraction of the students in the band are in either the trumpet section or the trombone section?",
        "conditions": [
            "0.5 of the students in the band are in the trumpet section.",
            "0.125 of the students in the band are in the trombone section."
        ],
        "question": "What fraction of the students in the band are in either the trumpet section or the trombone section?",
        "equation": "0.5 + 0.125 = x",
        "gold_answer": 0.625,
        "verify_condition_index": 0
    },
    {
        "problem": "Suzie found two worms in the yard and measured them with a ruler. One worm was 0.8 of an inch long. The other worm was 0.1 of an inch long. How much longer was the longer worm?",
        "conditions": [
            "Suzie found two worms in the yard and measured them with a ruler.",
            "One worm was 0.8 of an inch long.",
            "The other worm was 0.1 of an inch long."
        ],
        "question": "How much longer was the longer worm?",
        "equation": "0.8 - 0.1 = x",
        "gold_answer": 0.7,
        "verify_condition_index": 1
    },
    {
        "problem": "Scarlett made a fruit salad with 0.25 of a pound of melon and 0.375 of a pound of berries. How many pounds of fruit did Scarlett use in all?",
        "conditions": [
            "Scarlett made a fruit salad with 0.25 of a pound of melon,",
            "and 0.375 of a pound of berries."
        ],
        "question": "How many pounds of fruit did Scarlett use in all?",
        "equation": "0.25 + 0.375 = x",
        "gold_answer": 0.625,
        "verify_condition_index": 0
    },
    {
        "problem": "Vince's bus ride to school is 0.625 of a mile and Zachary's bus ride is 0.5 of a mile. How much longer is Vince's bus ride than Zachary's?",
        "conditions": [
            "Vince's bus ride to school is 0.625 of a mile,",
            "and Zachary's bus ride is 0.5 of a mile."
        ],
        "question": "How much longer is Vince's bus ride than Zachary's?",
        "equation": "0.625 - 0.5 = x",
        "gold_answer": 0.125,
        "verify_condition_index": 1
    },
    {
        "problem": "In one week, Mitch's family drank 0.5 of a carton of regular milk and 0.1 of a carton of soy milk. How much milk did they drink in all?",
        "conditions": [
            "In one week, Mitch's family drank 0.5 of a carton of regular milk",
            "and 0.1 of a carton of soy milk."
        ],
        "question": "How much milk did they drink in all?",
        "equation": "0.5 + 0.1 = x",
        "gold_answer": 0.6,
        "verify_condition_index": 0
    },
    {
        "problem": "Elizabeth went to the salon and had 0.375 of an inch of hair cut off. The next day she went back and asked for another 0.5 of an inch to be cut off. How much hair did she have cut off in all?",
        "conditions": [
            "Elizabeth went to the salon and had 0.375 of an inch of hair cut off.",
            "The next day she went back and asked for another 0.5 of an inch to be cut off."
        ],
        "question": "How much hair did she have cut off in all?",
        "equation": "0.375 + 0.5 = x",
        "gold_answer": 0.875,
        "verify_condition_index": 0
    },
    {
        "problem": "In Shannon's apartment complex, 0.16666666666666666 of the apartments are one-bedroom apartments and 0.3333333333333333 are two-bedroom apartments. What fraction of the apartments are either one- or two-bedroom apartments?",
        "conditions": [
            "In Shannon's apartment complex, 0.16666666666666666 of the apartments are one-bedroom apartments",
            "and 0.3333333333333333 are two-bedroom apartments."
        ],
        "question": "What fraction of the apartments are either one- or two-bedroom apartments?",
        "equation": "0.16666666666666666 + 0.3333333333333333 = x",
        "gold_answer": 0.5,
        "verify_condition_index": 1
    },
    {
        "problem": "At the beach, Miki and her sister both built sandcastles and then measured their heights. Miki's sandcastle was 0.8333333333333334 of a foot tall and her sister's was 0.5 of a foot tall. How much taller was Miki's sandcastle than her sister's?",
        "conditions": [
            "At the beach, Miki and her sister both built sandcastles and then measured their heights.",
            "Miki's sandcastle was 0.8333333333333334 of a foot tall,",
            "and her sister's was 0.5 of a foot tall."
        ],
        "question": "How much taller was Miki's sandcastle than her sister's?",
        "equation": "0.8333333333333334 - 0.5 = x",
        "gold_answer": 0.3333333333333333,
        "verify_condition_index": 1
    },
    {
        "problem": "Michelle began her pizza delivery route with 0.5 of a tank of gas in her car. When she made it back to the pizzeria, 0.16666666666666666 of a tank of gas was left. How much gas did Michelle use?",
        "conditions": [
            "Michelle began her pizza delivery route with 0.5 of a tank of gas in her car.",
            "When she made it back to the pizzeria, 0.16666666666666666 of a tank of gas was left."
        ],
        "question": "How much gas did Michelle use?",
        "equation": "0.5 - 0.16666666666666666 = x",
        "gold_answer": 0.3333333333333333,
        "verify_condition_index": 0
    },
    {
        "problem": "While taking inventory at her pastry shop, Kelly realizes that she had 0.4 of a box of baking powder yesterday, but the supply is now down to 0.3 of a box. How much more baking powder did Kelly have yesterday?",
        "conditions": [
            "While taking inventory at her pastry shop,",
            "Kelly realizes that she had 0.4 of a box of baking powder yesterday,",
            "but the supply is now down to 0.3 of a box."
        ],
        "question": "How much more baking powder did Kelly have yesterday?",
        "equation": "0.4 - 0.3 = x",
        "gold_answer": 0.1,
        "verify_condition_index": 1
    },
    {
        "problem": "Craig walked 0.2 of a mile from school to David's house and 0.7 of a mile from David's house to his own house. How many miles did Craig walk in all?",
        "conditions": [
            "Craig walked 0.2 of a mile from school to David's house,",
            "and 0.7 of a mile from David's house to his own house."
        ],
        "question": "How many miles did Craig walk in all?",
        "equation": "0.2 + 0.7 = x",
        "gold_answer": 0.9,
        "verify_condition_index": 0
    },
    {
        "problem": "Greg and Sharon own neighboring cornfields. Greg harvested 0.4 of an acre of corn on Monday and Sharon harvested 0.1 of an acre. How many more acres did Greg harvest than Sharon?",
        "conditions": [
            "Greg and Sharon own neighboring cornfields.",
            "Greg harvested 0.4 of an acre of corn on Monday,",
            "and Sharon harvested 0.1 of an acre."
        ],
        "question": "How many more acres did Greg harvest than Sharon?",
        "equation": "0.4 + 0.1 = x",
        "gold_answer": 0.3,
        "verify_condition_index": 1
    },
    {
        "problem": "At the hardware store, 0.25 of the nails are size 2d and 0.5 of the nails are size 4d. What fraction of the nails are either size 2d or 4d?",
        "conditions": [
            "At the hardware store,",
            "0.25 of the nails are size 2d and 0.5 of the nails are size 4d."
        ],
        "question": "What fraction of the nails are either size 2d or 4d?",
        "equation": "0.25 + 0.5 = x",
        "gold_answer": 0.75,
        "verify_condition_index": 1
    },
    {
        "problem": "While making desserts for a bake sale, Victor used 0.625 of a scoop of brown sugar as well as 0.25 of a scoop of white sugar. How much more brown sugar did Victor use?",
        "conditions": [
            "While making desserts for a bake sale, Victor used 0.625 of a scoop of brown sugar as well as 0.25 of a scoop of white sugar."
        ],
        "question": "How much more brown sugar did Victor use?",
        "equation": "0.625 - 0.25 = x",
        "gold_answer": 0.375,
        "verify_condition_index": 0
    },
    {
        "problem": "Eve ran 0.7 of a mile and walked 0.6 of a mile. How much farther did Eve run than walk?",
        "conditions": [
            "Eve ran 0.7 of a mile,",
            "and walked 0.6 of a mile."
        ],
        "question": "How much farther did Eve run than walk?",
        "equation": "0.7 + 0.6 = x",
        "gold_answer": 0.1,
        "verify_condition_index": 0
    },
    {
        "problem": "Jonah added 0.3 of a cup of yellow raisins and 0.4 of a cup of black raisins to a batch of trail mix. How many cups of raisins did Jonah add in all?",
        "conditions": [
            "Jonah added 0.3 of a cup of yellow raisins,",
            "and 0.4 of a cup of black raisins to a batch of trail mix."
        ],
        "question": "How many cups of raisins did Jonah add in all?",
        "equation": "0.3 + 0.4 = x",
        "gold_answer": 0.7,
        "verify_condition_index": 0
    },
    {
        "problem": "When Jake had one cat, he needed to serve 0.5 of a can of cat food each day. Now that Jake has adopted a second cat, he needs to serve a total of 0.9 of a can each day. How much extra food is needed to feed the second cat?",
        "conditions": [
            "When Jake had one cat, he needed to serve 0.5 of a can of cat food each day.",
            "Now that Jake has adopted a second cat, he needs to serve a total of 0.9 of a can each day."
        ],
        "question": "How much extra food is needed to feed the second cat?",
        "equation": "0.9 - 0.5 = x",
        "gold_answer": 0.4,
        "verify_condition_index": 1
    },
    {
        "problem": "In Yardley it snowed 0.125 of an inch in the morning and 0.5 of an inch in the afternoon. What was the total amount of snowfall?",
        "conditions": [
            "In Yardley it snowed 0.125 of an inch in the morning,",
            "and 0.5 of an inch in the afternoon."
        ],
        "question": "What was the total amount of snowfall?",
        "equation": "0.125 + 0.5 = x",
        "gold_answer": 0.625,
        "verify_condition_index": 0
    },
    {
        "problem": "While making pastries, a bakery used 0.2 of a bag of wheat flour and 0.1 of a bag of white flour. How many bags of flour did the bakery use in all?",
        "conditions": [
            "While making pastries, a bakery used 0.2 of a bag of wheat flour",
            "and 0.1 of a bag of white flour."
        ],
        "question": "How many bags of flour did the bakery use in all?",
        "equation": "0.2 + 0.1 = x",
        "gold_answer": 0.3,
        "verify_condition_index": 0
    },
    {
        "problem": "Kaleen filled a bucket with 0.75 of a gallon of water. A few minutes later, she realized only 0.5 of a gallon of water remained. How much water had leaked out of the bucket?",
        "conditions": [
            "Kaleen filled a bucket with 0.75 of a gallon of water.",
            "A few minutes later, she realized only 0.5 of a gallon of water remained."
        ],
        "question": "How much water had leaked out of the bucket?",
        "equation": "0.75 - 0.5 = x",
        "gold_answer": 0.25,
        "verify_condition_index": 1
    },
    {
        "problem": "Irwin's family went on a camping trip in the mountains. On the first day, they hiked from their car to the campsite. First, they hiked 0.2 of a mile from the car to a stream, and 0.4 of a mile from the stream to a meadow. Then they hiked 0.1 of a mile from the meadow to the campsite. How many miles did Irwin's family hike in all?",
        "conditions": [
            "Irwin's family went on a camping trip in the mountains.",
            "On the first day, they hiked from their car to the campsite.",
            "First, they hiked 0.2 of a mile from the car to a stream,",
            "and 0.4 of a mile from the stream to a meadow.",
            "Then they hiked 0.1 of a mile from the meadow to the campsite."
        ],
        "question": "How many miles did Irwin's family hike in all?",
        "equation": "0.2 + 0.4 + 0.1 = x",
        "gold_answer": 0.7,
        "verify_condition_index": 4
    },
    {
        "problem": "During a visit to an orchard, Charlie picked 0.16666666666666666 of a bag of Golden Delicious apples, 0.16666666666666666 of a bag of Macintosh apples, and 0.3333333333333333 of a bag of Cortland apples. How many bags of fruit did Charlie pick in total?",
        "conditions": [
            "During a visit to an orchard,",
            "Charlie picked 0.16666666666666666 of a bag of Golden Delicious apples,",
            "0.16666666666666666 of a bag of Macintosh apples,",
            "and 0.3333333333333333 of a bag of Cortland apples."
        ],
        "question": "How many bags of fruit did Charlie pick in total?",
        "equation": "0.16666666666666666 + 0.16666666666666666 + 0.3333333333333333 = x",
        "gold_answer": 0.6666666666666666,
        "verify_condition_index": 1
    },
    {
        "problem": "Before starting her shift, a waitress checks to make sure there is enough mustard for her customers. She finds 0.25 of a bottle at the first table, 0.25 of a bottle at the second table, and 0.375 of a bottle at the third table. Altogether, how many bottles of mustard does the waitress find?",
        "conditions": [
            "Before starting her shift, a waitress checks to make sure there is enough mustard for her customers.",
            "She finds 0.25 of a bottle at the first table,",
            "0.25 of a bottle at the second table,",
            "and 0.375 of a bottle at the third table."
        ],
        "question": "Altogether, how many bottles of mustard does the waitress find?",
        "equation": "0.25 + 0.25 + 0.375 = x",
        "gold_answer": 0.875,
        "verify_condition_index": 2
    },
    {
        "problem": "A waitress put leftover tarts into the fridge on Thursday night. She noticed that the restaurant had 0.08333333333333333 of a tart filled with cherries, 0.75 of a tart filled with blueberries, and 0.08333333333333333 of a tart filled with peaches. How many leftover tarts did the restaurant have in all?",
        "conditions": [
            "A waitress put leftover tarts into the fridge on Thursday night.",
            "She noticed that the restaurant had 0.08333333333333333 of a tart filled with cherries,",
            "0.75 of a tart filled with blueberries,",
            "and 0.08333333333333333 of a tart filled with peaches."
        ],
        "question": "How many leftover tarts did the restaurant have in all?",
        "equation": "0.08333333333333333 + 0.75 + 0.08333333333333333 = x",
        "gold_answer": 0.9166666666666666,
        "verify_condition_index": 1
    },
    {
        "problem": "On her vacation last summer, Trisha walked all over New York City to buy souvenirs. First, she walked 0.1111111111111111 of a mile from her hotel to a postcard shop. Then she walked 0.1111111111111111 of a mile from the postcard shop to a T-shirt shop and 0.6666666666666666 of a mile from the T-shirt shop back to the hotel. How many miles did Trisha walk in all?",
        "conditions": [
            "On her vacation last summer, Trisha walked all over New York City to buy souvenirs.",
            "First, she walked 0.1111111111111111 of a mile from her hotel to a postcard shop.",
            "Then she walked 0.1111111111111111 of a mile from the postcard shop to a T-shirt shop,",
            "and 0.6666666666666666 of a mile from the T-shirt shop back to the hotel."
        ],
        "question": "How many miles did Trisha walk in all?",
        "equation": "0.1111111111111111 + 0.1111111111111111 + 0.6666666666666666 = x",
        "gold_answer": 0.8888888888888888,
        "verify_condition_index": 2
    },
    {
        "problem": "Brandy made trail mix for a backpacking trip. She used 0.16666666666666666 of a pound of peanuts, 0.16666666666666666 of a pound of chocolate chips, and 0.08333333333333333 of a pound of raisins. How many pounds of trail mix did Brandy make?",
        "conditions": [
            "Brandy made trail mix for a backpacking trip.",
            "She used 0.16666666666666666 of a pound of peanuts,",
            "0.16666666666666666 of a pound of chocolate chips,",
            "and 0.08333333333333333 of a pound of raisins."
        ],
        "question": "How many pounds of trail mix did Brandy make?",
        "equation": "0.16666666666666666 + 0.16666666666666666 + 0.08333333333333333 = x",
        "gold_answer": 0.4166666666666667,
        "verify_condition_index": 1
    },
    {
        "problem": "Allie counted the leftover ice cream after a sundae party. She had 0.3333333333333333 of a carton of rocky road ice cream, 0.3333333333333333 of a carton of cookie dough ice cream, and 0.16666666666666666 of a carton of strawberry cheesecake ice cream. How many cartons of ice cream did Allie have in all?",
        "conditions": [
            "Allie counted the leftover ice cream after a sundae party.",
            "She had 0.3333333333333333 of a carton of rocky road ice cream,",
            "0.3333333333333333 of a carton of cookie dough ice cream,",
            "and 0.16666666666666666 of a carton of strawberry cheesecake ice cream."
        ],
        "question": "How many cartons of ice cream did Allie have in all?",
        "equation": "0.5 + 0.3333333333333333 + 0.16666666666666666 = x",
        "gold_answer": 0.8333333333333334,
        "verify_condition_index": 2
    },
    {
        "problem": "During a canned food drive, items were sorted into bins. The drive resulted in 0.125 of a bin of soup, 0.125 of a bin of vegetables, and 0.5 of a bin of pasta. Altogether, how many bins would the canned food take up?",
        "conditions": [
            "During a canned food drive, items were sorted into bins.",
            "The drive resulted in 0.125 of a bin of soup,",
            "0.125 of a bin of vegetables,",
            "and 0.5 of a bin of pasta."
        ],
        "question": "Altogether, how many bins would the canned food take up?",
        "equation": "0.125 + 0.125 + 0.5 = x",
        "gold_answer": 0.75,
        "verify_condition_index": 2
    },
    {
        "problem": "Paco's Countertop Company purchased pieces of marble from a quarry. The weights of the pieces they purchased were 0.3333333333333333 of a ton, 0.3333333333333333 of a ton, and 0.08333333333333333 of a ton. How many tons of marble did Paco's Countertop Company purchase in all?",
        "conditions": [
            "Paco's Countertop Company purchased pieces of marble from a quarry.",
            "The weights of the pieces they purchased were 0.3333333333333333 of a ton,",
            "0.3333333333333333 of a ton,",
            "and 0.08333333333333333 of a ton."
        ],
        "question": "How many tons of marble did Paco's Countertop Company purchase in all?",
        "equation": "0.3333333333333333 + 0.3333333333333333 + 0.08333333333333333 = x",
        "gold_answer": 0.75,
        "verify_condition_index": 1
    },
    {
        "problem": "Nina did a running drill to get in shape for soccer season. First, Nina ran 0.08333333333333333 of a mile. Then she ran 0.08333333333333333 of a mile and 0.6666666666666666 of a mile more. How many miles did Nina run in total?",
        "conditions": [
            "Nina did a running drill to get in shape for soccer season.",
            "First, Nina ran 0.08333333333333333 of a mile.",
            "Then she ran 0.08333333333333333 of a mile,",
            "and 0.6666666666666666 of a mile more."
        ],
        "question": "How many miles did Nina run in total?",
        "equation": "0.08333333333333333 + 0.08333333333333333 + 0.6666666666666666 = x",
        "gold_answer": 0.8333333333333334,
        "verify_condition_index": 1
    },
    {
        "problem": "Bonnie's science class recorded the rainfall each day. They recorded 0.16666666666666666 of a centimeter of rain on Monday, 0.4166666666666667 of a centimeter of rain on Tuesday, and 0.08333333333333333 of a centimeter of rain on Wednesday. How many centimeters of rain did the class record in all?",
        "conditions": [
            "Bonnie's science class recorded the rainfall each day.",
            "They recorded 0.16666666666666666 of a centimeter of rain on Monday,",
            "0.4166666666666667 of a centimeter of rain on Tuesday,",
            "and 0.08333333333333333 of a centimeter of rain on Wednesday."
        ],
        "question": "How many centimeters of rain did the class record in all?",
        "equation": "0.16666666666666666 + 0.4166666666666667 + 0.08333333333333333 = x",
        "gold_answer": 0.6666666666666666,
        "verify_condition_index": 2
    },
    {
        "problem": "Last Saturday, Spencer walked all over town running errands. First, he walked 0.3 of a mile from his house to the library and 0.1 of a mile from the library to the post office. Then he walked 0.4 of a mile from the post office back home. How many miles did Spencer walk in all?",
        "conditions": [
            "Last Saturday, Spencer walked all over town running errands.",
            "First, he walked 0.3 of a mile from his house to the library",
            "and 0.1 of a mile from the library to the post office.",
            "Then he walked 0.4 of a mile from the post office back home."
        ],
        "question": "How many miles did Spencer walk in all?",
        "equation": "0.3 + 0.1 + 0.4 = x",
        "gold_answer": 0.8,
        "verify_condition_index": 1
    },
    {
        "problem": "A construction company ordered 0.16666666666666666 of a ton of concrete, 0.16666666666666666 of a ton of bricks, and 0.5 of a ton of stone. How many tons of material did the company order in all?",
        "conditions": [
            "A construction company ordered 0.16666666666666666 of a ton of concrete,",
            "0.16666666666666666 of a ton of bricks,",
            "and 0.5 of a ton of stone."
        ],
        "question": "How many tons of material did the company order in all?",
        "equation": "0.16666666666666666 + 0.16666666666666666 + 0.5 = x",
        "gold_answer": 0.8333333333333334,
        "verify_condition_index": 1
    },
    {
        "problem": "Kendra made punch for her friend's birthday party. She used 0.25 of a gallon of grape juice, 0.375 of a gallon of cranberry juice, and 0.125 of a gallon of club soda. How many gallons of punch did Kendra make?",
        "conditions": [
            "Kendra made punch for her friend's birthday party.",
            "She used 0.25 of a gallon of grape juice,",
            "0.375 of a gallon of cranberry juice,",
            "and 0.125 of a gallon of club soda."
        ],
        "question": "How many gallons of punch did Kendra make?",
        "equation": "0.25 + 0.375 + 0.125 = x",
        "gold_answer": 0.75,
        "verify_condition_index": 2
    },
    {
        "problem": "A spaceship traveled 0.5 of a light-year from Earth to Planet X and 0.1 of a light-year from Planet X to Planet Y. Then it traveled 0.1 of a light-year from Planet Y back to Earth. How many light-years did the spaceship travel in all?",
        "conditions": [
            "A spaceship traveled 0.5 of a light-year from Earth to Planet X,",
            "and 0.1 of a light-year from Planet X to Planet Y.",
            "Then it traveled 0.1 of a light-year from Planet Y back to Earth."
        ],
        "question": "How many light-years did the spaceship travel in all?",
        "equation": "0.5 + 0.1 + 0.1 = x",
        "gold_answer": 0.7,
        "verify_condition_index": 0
    },
    {
        "problem": "Logan recorded the snowfall every day during a snowstorm. He recorded 0.3333333333333333 of a centimeter on Wednesday, 0.3333333333333333 of a centimeter on Thursday, and 0.2222222222222222 of a centimeter on Friday. How many total centimeters of snow did Logan record?",
        "conditions": [
            "Logan recorded the snowfall every day during a snowstorm.",
            "He recorded 0.3333333333333333 of a centimeter on Wednesday,",
            "0.3333333333333333 of a centimeter on Thursday,",
            "and 0.2222222222222222 of a centimeter on Friday."
        ],
        "question": "How many total centimeters of snow did Logan record?",
        "equation": "0.3333333333333333 + 0.3333333333333333 + 0.2222222222222222 = x",
        "gold_answer": 0.8888888888888888,
        "verify_condition_index": 1
    },
    {
        "problem": "Ellen made smoothies in the blender. She used 0.2 of a cup of strawberries, 0.1 of a cup of yogurt, and 0.2 of a cup of orange juice. How many cups of ingredients did Ellen use for the smoothies?",
        "conditions": [
            "Ellen made smoothies in the blender.",
            "She used 0.2 of a cup of strawberries,",
            "0.1 of a cup of yogurt,",
            "and 0.2 of a cup of orange juice."
        ],
        "question": "How many cups of ingredients did Ellen use for the smoothies?",
        "equation": "0.2 + 0.1 + 0.2 = x",
        "gold_answer": 0.5,
        "verify_condition_index": 1
    },
    {
        "problem": "During a school play, Jonah staffed the snack bar. He served 0.25 of a pitcher of lemonade during the first intermission, 0.4166666666666667 of a pitcher during the second, and 0.25 of a pitcher during the third. How many pitchers of lemonade did Jonah pour in all?",
        "conditions": [
            "During a school play, Jonah staffed the snack bar.",
            "He served 0.25 of a pitcher of lemonade during the first intermission,",
            "0.4166666666666667 of a pitcher during the second,",
            "and 0.25 of a pitcher during the third."
        ],
        "question": "How many pitchers of lemonade did Jonah pour in all?",
        "equation": "0.25 + 0.4166666666666667 + 0.25 = x",
        "gold_answer": 0.9166666666666666,
        "verify_condition_index": 1
    },
    {
        "problem": "Heather went to the county fair last weekend. When she got there, she had to walk 0.3333333333333333 of a mile from the car to the entrance. Then she walked 0.3333333333333333 of a mile to the carnival rides and 0.08333333333333333 of a mile from the carnival rides back to the car. How many miles did Heather walk in all?",
        "conditions": [
            "Heather went to the county fair last weekend.",
            "When she got there, she had to walk 0.3333333333333333 of a mile from the car to the entrance.",
            "Then she walked 0.3333333333333333 of a mile to the carnival rides,",
            "and 0.08333333333333333 of a mile from the carnival rides back to the car."
        ],
        "question": "How many miles did Heather walk in all?",
        "equation": "0.3333333333333333 + 0.3333333333333333 + 0.08333333333333333 = x",
        "gold_answer": 0.75,
        "verify_condition_index": 2
    },
    {
        "problem": "A renovation project required 0.16666666666666666 of a truck-load of sand, 0.3333333333333333 of a truck-load of dirt, and 0.16666666666666666 of a truck-load of cement. How many truck-loads of material were needed in all?",
        "conditions": [
            "A renovation project required 0.16666666666666666 of a truck-load of sand,",
            "0.3333333333333333 of a truck-load of dirt,",
            "and 0.16666666666666666 of a truck-load of cement."
        ],
        "question": "How many truck-loads of material were needed in all?",
        "equation": "0.16666666666666666 + 0.3333333333333333 + 0.16666666666666666 = x",
        "gold_answer": 0.6666666666666666,
        "verify_condition_index": 2
    },
    {
        "problem": "Karin's science class weighed plastic rings for an experiment. They found that the orange ring weighed 0.08333333333333333 of an ounce, the purple ring weighed 0.3333333333333333 of an ounce, and the white ring weighed 0.4166666666666667 of an ounce. What was the total weight of the plastic rings?",
        "conditions": [
            "Karin's science class weighed plastic rings for an experiment.",
            "They found that the orange ring weighed 0.08333333333333333 of an ounce,",
            "the purple ring weighed 0.3333333333333333 of an ounce,",
            "and the white ring weighed 0.4166666666666667 of an ounce."
        ],
        "question": "What was the total weight of the plastic rings?",
        "equation": "0.08333333333333333 + 0.3333333333333333 + 0.4166666666666667 = x",
        "gold_answer": 0.8333333333333334,
        "verify_condition_index": 1
    },
    {
        "problem": "Carefully following a recipe, Kenny used exactly 0.16666666666666666 of a cup of oil and 1.1666666666666667 cups of water. How many cups of liquid did Kenny use in all?",
        "conditions": [
            "Carefully following a recipe, Kenny used exactly 0.16666666666666666 of a cup of oil",
            "and 1.1666666666666667 cups of water."
        ],
        "question": "How many cups of liquid did Kenny use in all?",
        "equation": "0.16666666666666666 + 1.1666666666666667 = x",
        "gold_answer": 1.3333333333333333,
        "verify_condition_index": 1
    },
    {
        "problem": "Dale's Vegetarian Restaurant bought 2.8333333333333335 pounds of green peppers and 2.8333333333333335 pounds of red peppers. How many pounds of peppers did Dale's Vegetarian Restaurant buy in all?",
        "conditions": [
            "Dale's Vegetarian Restaurant bought 2.8333333333333335 pounds of green peppers,",
            "and 2.8333333333333335 pounds of red peppers."
        ],
        "question": "How many pounds of peppers did Dale's Vegetarian Restaurant buy in all?",
        "equation": "2.8333333333333335 + 2.8333333333333335 = x",
        "gold_answer": 5.666666666666667,
        "verify_condition_index": 0
    },
    {
        "problem": "This afternoon Craig left school, rode the bus 3.8333333333333335 miles, and then walked 0.16666666666666666 of a mile to get home. How much farther did Craig ride than walk?",
        "conditions": [
            "This afternoon Craig left school, rode the bus 3.8333333333333335 miles,",
            "and then walked 0.16666666666666666 of a mile to get home."
        ],
        "question": "How much farther did Craig ride than walk?",
        "equation": "3.8333333333333335 - 0.16666666666666666 = x",
        "gold_answer": 3.6666666666666665,
        "verify_condition_index": 0
    },
    {
        "problem": "Kelly's chemistry textbook weighs 7.125 pounds and her geometry textbook weighs 0.625 of a pound. How much more does the chemistry textbook weigh than the geometry textbook?",
        "conditions": [
            "Kelly's chemistry textbook weighs 7.125 pounds,",
            "and her geometry textbook weighs 0.625 of a pound."
        ],
        "question": "How much more does the chemistry textbook weigh than the geometry textbook?",
        "equation": "7.125 - 0.625 = x",
        "gold_answer": 6.5,
        "verify_condition_index": 0
    },
    {
        "problem": "Roadster's Paving Company used 10 tons of cement to pave Lexi's street and 5.1 tons of cement to pave Tess's street. How much cement did Roadster's Paving Company use in all?",
        "conditions": [
            "Roadster's Paving Company used 10 tons of cement to pave Lexi's street,",
            "and 5.1 tons of cement to pave Tess's street."
        ],
        "question": "How much cement did Roadster's Paving Company use in all?",
        "equation": "10 + 5.1 = x",
        "gold_answer": 15.1,
        "verify_condition_index": 0
    },
    {
        "problem": "On a hot day, Sam poured 1 bucket of water into a plastic wading pool. A few minutes later he added another 8.8 buckets. How much water did Sam pour into the pool?",
        "conditions": [
            "On a hot day, Sam poured 1 bucket of water into a plastic wading pool.",
            "A few minutes later he added another 8.8 buckets."
        ],
        "question": "How much water did Sam pour into the pool?",
        "equation": "1 + 8.8 = x",
        "gold_answer": 9.8,
        "verify_condition_index": 0
    },
    {
        "problem": "Kyle jogged 1.125 laps in P.E. class and 2.125 laps during track practice. How many laps did Kyle jog in all?",
        "conditions": [
            "Kyle jogged 1.125 laps in P.E. class and 2.125 laps during track practice."
        ],
        "question": "How many laps did Kyle jog in all?",
        "equation": "1.125 + 2.125 = x",
        "gold_answer": 3.25,
        "verify_condition_index": 0
    },
    {
        "problem": "A bucket contains 3 gallons of water. If Derek adds 6.8 gallons more, how many gallons will there be in all?",
        "conditions": [
            "A bucket contains 3 gallons of water."
        ],
        "question": "If Derek adds 6.8 gallons more, how many gallons will there be in all?",
        "equation": "3 + 6.8 = x",
        "gold_answer": 9.8,
        "verify_condition_index": 0
    },
    {
        "problem": "At a pizza party, Mason and his friends drank 2.6666666666666665 bottles of lemon-lime soda and 2.6666666666666665 bottles of cola. How much soda did they drink in all?",
        "conditions": [
            "At a pizza party, Mason and his friends drank 2.6666666666666665 bottles of lemon-lime soda",
            "and 2.6666666666666665 bottles of cola."
        ],
        "question": "How much soda did they drink in all?",
        "equation": "2.6666666666666665 + 2.6666666666666665 = x",
        "gold_answer": 5.333333333333333,
        "verify_condition_index": 1
    },
    {
        "problem": "Professor Ellison weighed two pieces of metal for an experiment. The piece of iron weighed 11.166666666666666 pounds and the piece of aluminum weighed 0.8333333333333334 of a pound. How much more did the piece of iron weigh than the piece of aluminum?",
        "conditions": [
            "Professor Ellison weighed two pieces of metal for an experiment.",
            "The piece of iron weighed 11.166666666666666 pounds,",
            "and the piece of aluminum weighed 0.8333333333333334 of a pound."
        ],
        "question": "How much more did the piece of iron weigh than the piece of aluminum?",
        "equation": "11.166666666666666 - 0.8333333333333334 = x",
        "gold_answer": 10.333333333333334,
        "verify_condition_index": 1
    },
    {
        "problem": "As part of a lesson on earthquakes, a science class is researching the movement of a nearby fault line. The fault line moved 1.25 inches during the past year and 5.25 inches the year before. How far did the fault line move in all?",
        "conditions": [
            "As part of a lesson on earthquakes, a science class is researching the movement of a nearby fault line.",
            "The fault line moved 1.25 inches during the past year,",
            "and 5.25 inches the year before."
        ],
        "question": "How far did the fault line move in all?",
        "equation": "1.25 + 5.25 = x",
        "gold_answer": 6.5,
        "verify_condition_index": 1
    },
    {
        "problem": "Hoping to be named Salesperson of the Month, Rosa called the names from 10.2 pages of the phone book last week. This week, she called the people listed on another 8.6 pages of the same phone book. How many pages worth of people did Rosa call in all?",
        "conditions": [
            "Hoping to be named Salesperson of the Month, Rosa called the names from 10.2 pages of the phone book last week.",
            "This week, she called the people listed on another 8.6 pages of the same phone book."
        ],
        "question": "How many pages worth of people did Rosa call in all?",
        "equation": "10.2 + 8.6 = x",
        "gold_answer": 18.8,
        "verify_condition_index": 0
    },
    {
        "problem": "At the beach, Janet and her sister both built sandcastles and then measured their heights. Janet's sandcastle was 3.6666666666666665 feet tall and her sister's was 2.3333333333333335 feet tall. How much taller was Janet's sandcastle than her sister's?",
        "conditions": [
            "At the beach, Janet and her sister both built sandcastles and then measured their heights.",
            "Janet's sandcastle was 3.6666666666666665 feet tall,",
            "and her sister's was 2.3333333333333335 feet tall."
        ],
        "question": "How much taller was Janet's sandcastle than her sister's?",
        "equation": "3.6666666666666665 - 2.3333333333333335 = x",
        "gold_answer": 1.3333333333333333,
        "verify_condition_index": 1
    },
    {
        "problem": "Nicole found an orange caterpillar and a green caterpillar in her backyard. The green caterpillar was 3 inches long and the orange caterpillar was 1.1666666666666667 inches long. How much longer was the green caterpillar than the orange caterpillar?",
        "conditions": [
            "Nicole found an orange caterpillar and a green caterpillar in her backyard.",
            "The green caterpillar was 3 inches long,",
            "and the orange caterpillar was 1.1666666666666667 inches long."
        ],
        "question": "How much longer was the green caterpillar than the orange caterpillar?",
        "equation": "3 - 1.1666666666666667 = x",
        "gold_answer": 1.8333333333333335,
        "verify_condition_index": 2
    },
    {
        "problem": "Alec and his roommates ate 3.25 pints of ice cream on Friday night and 0.25 of a pint of ice cream on Saturday night. How many pints did they eat in all?",
        "conditions": [
            "Alec and his roommates ate 3.25 pints of ice cream on Friday night,",
            "and 0.25 of a pint of ice cream on Saturday night."
        ],
        "question": "How many pints did they eat in all?",
        "equation": "3.25 + 0.25 = x",
        "gold_answer": 3.5,
        "verify_condition_index": 0
    },
    {
        "problem": "A farmer started the day with 8.75 buckets of seeds. After spending the morning sowing seeds, she now has 6 buckets left. How many buckets of seeds did the farmer sow?",
        "conditions": [
            "A farmer started the day with 8.75 buckets of seeds.",
            "After spending the morning sowing seeds, she now has 6 buckets left."
        ],
        "question": "How many buckets of seeds did the farmer sow?",
        "equation": "8.75 - 6 = x",
        "gold_answer": 2.75,
        "verify_condition_index": 0
    },
    {
        "problem": "Irene just bought a new lamp for her bedside table. The old lamp was 1 foot tall and the new lamp is 2.3333333333333335 feet tall. How much taller is the new lamp than the old lamp?",
        "conditions": [
            "Irene just bought a new lamp for her bedside table.",
            "The old lamp was 1 foot tall,",
            "and the new lamp is 2.3333333333333335 feet tall."
        ],
        "question": "How much taller is the new lamp than the old lamp?",
        "equation": "2.3333333333333335 - 1 = x",
        "gold_answer": 1.3333333333333333,
        "verify_condition_index": 2
    },
    {
        "problem": "Ezra drew a white line that was 7.666666666666667 inches long. Then he drew a blue line that was 3.3333333333333335 inches long. How much longer was the white line than the blue line?",
        "conditions": [
            "Ezra drew a white line that was 7.666666666666667 inches long.",
            "Then he drew a blue line that was 3.3333333333333335 inches long."
        ],
        "question": "How much longer was the white line than the blue line?",
        "equation": "7.666666666666667 - 3.3333333333333335 = x",
        "gold_answer": 4.333333333333333,
        "verify_condition_index": 1
    },
    {
        "problem": "There are 7.75 gallons of water in Becky's fish tank. If Becky adds 7 gallons more, how many gallons will there be in all?",
        "conditions": [
            "There are 7.75 gallons of water in Becky's fish tank."
        ],
        "question": "If Becky adds 7 gallons more, how many gallons will there be in all?",
        "equation": "7.75 + 7 = x",
        "gold_answer": 14.75,
        "verify_condition_index": 0
    },
    {
        "problem": "Wendy ran 19.833333333333332 miles and walked 9.166666666666666 miles. How much farther did Wendy run than walk?",
        "conditions": [
            "Wendy ran 19.833333333333332 miles,",
            "and walked 9.166666666666666 miles."
        ],
        "question": "How much farther did Wendy run than walk?",
        "equation": "19.833333333333332 - 9.166666666666666 = x",
        "gold_answer": 10.666666666666666,
        "verify_condition_index": 0
    },
    {
        "problem": "Kenji and his classmates placed colored blocks on a scale during a science lab. The yellow block weighed 0.6 pounds and the green block weighed 0.4 pounds. How much more did the yellow block weigh than the green block?",
        "conditions": [
            "Kenji and his classmates placed colored blocks on a scale during a science lab.",
            "The yellow block weighed 0.6 pounds,",
            "and the green block weighed 0.4 pounds."
        ],
        "question": "How much more did the yellow block weigh than the green block?",
        "equation": "0.6 - 0.4 = x",
        "gold_answer": 0.2,
        "verify_condition_index": 1
    },
    {
        "problem": "Terrell hiked 8.2 miles on Saturday. Then, on Sunday, he hiked another 1.6 miles. How far did Terrell hike all together?",
        "conditions": [
            "Terrell hiked 8.2 miles on Saturday.",
            "Then, on Sunday, he hiked another 1.6 miles."
        ],
        "question": "How far did Terrell hike all together?",
        "equation": "8.2 + 1.6 = x",
        "gold_answer": 9.8,
        "verify_condition_index": 0
    },
    {
        "problem": "A carpenter bought a piece of wood that was 0.41 meters long. Then she sawed 0.33 meters off the end. How long is the piece of wood now?",
        "conditions": [
            "A carpenter bought a piece of wood that was 0.41 meters long.",
            "Then she sawed 0.33 meters off the end."
        ],
        "question": "How long is the piece of wood now?",
        "equation": "0.41 - 0.33 = x",
        "gold_answer": 0.08,
        "verify_condition_index": 0
    },
    {
        "problem": "Kelly bought 0.1 pounds of peanuts and 0.4 pounds of raisins. How many pounds of snacks did she buy in all?",
        "conditions": [
            "Kelly bought 0.1 pounds of peanuts,",
            "and 0.4 pounds of raisins."
        ],
        "question": "How many pounds of snacks did she buy in all?",
        "equation": "0.1 + 0.4 = x",
        "gold_answer": 0.5,
        "verify_condition_index": 0
    },
    {
        "problem": "Kevin bought two watermelons. The first watermelon was 9.91 pounds, and the second watermelon was 4.11 pounds. How many pounds of watermelon did Kevin buy?",
        "conditions": [
            "Kevin bought two watermelons.",
            "The first watermelon was 9.91 pounds,",
            "and the second watermelon was 4.11 pounds."
        ],
        "question": "How many pounds of watermelon did Kevin buy?",
        "equation": "9.91 + 4.11 = x",
        "gold_answer": 14.02,
        "verify_condition_index": 2
    },
    {
        "problem": "In March it rained 0.81 inches. It rained 0.35 inches less in April than in March. How much did it rain in April?",
        "conditions": [
            "In March it rained 0.81 inches.",
            "It rained 0.35 inches less in April than in March."
        ],
        "question": "How much did it rain in April?",
        "equation": "0.81 - 0.35 = x",
        "gold_answer": 0.46,
        "verify_condition_index": 1
    },
    {
        "problem": "Ron weighed two colored metal balls during a science class. The blue ball weighed 6 pounds and the brown ball weighed 3.12 pounds. If Ron places both balls on the scale at the same time, what will the scale read?",
        "conditions": [
            "Ron weighed two colored metal balls during a science class.",
            "The blue ball weighed 6 pounds,",
            "and the brown ball weighed 3.12 pounds."
        ],
        "question": "If Ron places both balls on the scale at the same time, what will the scale read?",
        "equation": "6 + 3.12 = x",
        "gold_answer": 9.12,
        "verify_condition_index": 2
    },
    {
        "problem": "A bee colony produced 0.36 pounds of honey, but bears ate 0.05 pounds of it. How much honey remains?",
        "conditions": [
            "A bee colony produced 0.36 pounds of honey,",
            "but bears ate 0.05 pounds of it."
        ],
        "question": "How much honey remains?",
        "equation": "0.36 - 0.05 = x",
        "gold_answer": 0.31,
        "verify_condition_index": 0
    },
    {
        "problem": "It rained 0.9 inches on Monday. On Tuesday, it rained 0.7 inches less than on Monday. How much did it rain on Tuesday?",
        "conditions": [
            "It rained 0.9 inches on Monday.",
            "On Tuesday, it rained 0.7 inches less than on Monday."
        ],
        "question": "How much did it rain on Tuesday?",
        "equation": "0.9 - 0.7 = x",
        "gold_answer": 0.2,
        "verify_condition_index": 1
    },
    {
        "problem": "It snowed 0.32 inches on Monday and 0.21 inches on Tuesday. How much did it snow on Monday and Tuesday combined?",
        "conditions": [
            "It snowed 0.32 inches on Monday,",
            "and 0.21 inches on Tuesday."
        ],
        "question": "How much did it snow on Monday and Tuesday combined?",
        "equation": "0.32 + 0.21 = x",
        "gold_answer": 0.53,
        "verify_condition_index": 1
    },
    {
        "problem": "Brennan had 0.25 grams of pepper. Then he used 0.16 grams of the pepper to make some scrambled eggs. How much pepper does Brennan have left?",
        "conditions": [
            "Brennan had 0.25 grams of pepper.",
            "Then he used 0.16 grams of the pepper to make some scrambled eggs."
        ],
        "question": "How much pepper does Brennan have left?",
        "equation": "0.25 - 0.16 = x",
        "gold_answer": 0.09,
        "verify_condition_index": 0
    },
    {
        "problem": "A construction company bought 5.91 tons of gravel and 8.11 tons of sand. How many tons of material did the company buy in all?",
        "conditions": [
            "A construction company bought 5.91 tons of gravel,",
            "and 8.11 tons of sand."
        ],
        "question": "How many tons of material did the company buy in all?",
        "equation": "5.91 + 8.11 = x",
        "gold_answer": 14.02,
        "verify_condition_index": 0
    },
    {
        "problem": "It rained 0.2 inches on Saturday and 0.4 inches on Sunday. How much did it rain on Saturday and Sunday combined?",
        "conditions": [
            "It rained 0.2 inches on Saturday,",
            "and 0.4 inches on Sunday."
        ],
        "question": "How much did it rain on Saturday and Sunday combined?",
        "equation": "0.2 + 0.4 = x",
        "gold_answer": 0.6,
        "verify_condition_index": 0
    },
    {
        "problem": "Pamela bought 9.8 ounces of sugar, and she spilled 5.2 ounces of it on the floor. How much is left?",
        "conditions": [
            "Pamela bought 9.8 ounces of sugar,",
            "and she spilled 5.2 ounces of it on the floor."
        ],
        "question": "How much is left?",
        "equation": "9.8 - 5.2 = x",
        "gold_answer": 4.6,
        "verify_condition_index": 0
    },
    {
        "problem": "Gordon bought 3.42 pounds of fruit for a class party. The class ate 2.2 pounds of the fruit. How much fruit is left?",
        "conditions": [
            "Gordon bought 3.42 pounds of fruit for a class party.",
            "The class ate 2.2 pounds of the fruit."
        ],
        "question": "How much fruit is left?",
        "equation": "3.42 - 2.2 = x",
        "gold_answer": 1.22,
        "verify_condition_index": 0
    },
    {
        "problem": "A chef bought 0.14 kilograms of almonds and 0.38 kilograms of pecans. How many kilograms of nuts did the chef buy in all?",
        "conditions": [
            "A chef bought 0.14 kilograms of almonds,",
            "and 0.38 kilograms of pecans."
        ],
        "question": "How many kilograms of nuts did the chef buy in all?",
        "equation": "0.14 + 0.38 = x",
        "gold_answer": 0.52,
        "verify_condition_index": 0
    },
    {
        "problem": "Marta picked two pumpkins. The first pumpkin weighed 4 pounds, and the second pumpkin weighed 8.7 pounds. How much did the two pumpkins weigh all together?",
        "conditions": [
            "Marta picked two pumpkins.",
            "The first pumpkin weighed 4 pounds,",
            "and the second pumpkin weighed 8.7 pounds."
        ],
        "question": "How much did the two pumpkins weigh all together?",
        "equation": "4 + 8.7 = x",
        "gold_answer": 12.7,
        "verify_condition_index": 2
    },
    {
        "problem": "A truck carrying 4.1 pounds of sand travels to a construction yard and loses 2.4 pounds of sand along the way. How much sand does the truck have when it arrives at the yard?",
        "conditions": [
            "A truck carrying 4.1 pounds of sand travels to a construction yard,",
            "and loses 2.4 pounds of sand along the way."
        ],
        "question": "How much sand does the truck have when it arrives at the yard?",
        "equation": "4.1 - 2.4 = x",
        "gold_answer": 1.7,
        "verify_condition_index": 0
    },
    {
        "problem": "Tori was 4.4 feet tall. Then she grew 2.86 feet taller. How tall is Tori now?",
        "conditions": [
            "Tori was 4.4 feet tall.",
            "Then she grew 2.86 feet taller."
        ],
        "question": "How tall is Tori now?",
        "equation": "4.4 + 2.86 = x",
        "gold_answer": 7.26,
        "verify_condition_index": 0
    },
    {
        "problem": "A carpenter bought a piece of wood that was 8.9 centimeters long. Then he sawed 2.3 centimeters off the end. How long is the piece of wood now?",
        "conditions": [
            "A carpenter bought a piece of wood that was 8.9 centimeters long.",
            "Then he sawed 2.3 centimeters off the end."
        ],
        "question": "How long is the piece of wood now?",
        "equation": "8.9 - 2.3 = x",
        "gold_answer": 6.6,
        "verify_condition_index": 0
    },
    {
        "problem": "How many cookies would you have if you had 37 bags of cookies with 19 cookies in each bag?",
        "conditions": [
            "if you had 37 bags of cookies with 19 cookies in each bag"
        ],
        "question": "How many cookies would you have?",
        "equation": "37*19=x",
        "gold_answer": 703.0,
        "verify_condition_index": 0
    },
    {
        "problem": "The Ferris wheel in Paradise Park has 14 seats. Each seat can hold 6 people. How many people can ride the Ferris wheel at the same time?",
        "conditions": [
            "The Ferris wheel in Paradise Park has 14 seats.",
            "Each seat can hold 6 people."
        ],
        "question": "How many people can ride the Ferris wheel at the same time?",
        "equation": "14*6=x",
        "gold_answer": 84.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 261 fishbowls. Each fishbowl has 23 fish. How many fish are there?",
        "conditions": [
            "There are 261 fishbowls.",
            "Each fishbowl has 23 fish."
        ],
        "question": "How many fish are there?",
        "equation": "261*23=x",
        "gold_answer": 6003.0,
        "verify_condition_index": 1
    },
    {
        "problem": "We ordered 21 pizzas. Each pizza has 8 slices. How many slices of pizza are there altogether?",
        "conditions": [
            "We ordered 21 pizzas.",
            "Each pizza has 8 slices."
        ],
        "question": "How many slices of pizza are there altogether?",
        "equation": "21*8=x",
        "gold_answer": 168.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Emily collected eggs from the hen and put them into 303 baskets. She put 28 eggs into each basket. How many eggs did Emily collect?",
        "conditions": [
            "Emily collected eggs from the hen and put them into 303 baskets.",
            "She put 28 eggs into each basket."
        ],
        "question": "How many eggs did Emily collect?",
        "equation": "303*28=x",
        "gold_answer": 8484.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 37 baskets. There are 17 apples in each basket. How many apples are there in all?",
        "conditions": [
            "There are 37 baskets.",
            "There are 17 apples in each basket."
        ],
        "question": "How many apples are there in all?",
        "equation": "37*17=x",
        "gold_answer": 629.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Bryan took a look at his books as well. If Bryan has 56 books in each of his 9 bookshelves, how many books does he have in total?",
        "conditions": [
            "Bryan took a look at his books as well.",
            "If Bryan has 56 books in each of his 9 bookshelves"
        ],
        "question": "how many books does he have in total?",
        "equation": "56*9=x",
        "gold_answer": 504.0,
        "verify_condition_index": 1
    },
    {
        "problem": "If books came from all the 4 continents that Bryan had been into and he collected 122 books per continent, how many books does he have from all 4 continents combined?",
        "conditions": [
            "If books came from all the 4 continents that Bryan had been into and he collected 122 books per continent"
        ],
        "question": "how many books does he have from all 4 continents combined?",
        "equation": "4*122=x",
        "gold_answer": 488.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Bryan had 8 precious stones in his collection which he sold to his friend from the jewelry store. If the stones were sold at 1785 dollar each, how much money did Bryan get in total?",
        "conditions": [
            "Bryan had 8 precious stones in his collection which he sold to his friend from the jewelry store."
        ],
        "question": "If the stones were sold at 1785 dollar each, how much money did Bryan get in total?",
        "equation": "8*1785=x",
        "gold_answer": 14280.0,
        "verify_condition_index": 0
    },
    {
        "problem": "The farmers reported that they harvest 45 sacks of apples from each of the 8 sections of the orchard daily. How many sacks are harvested every day?",
        "conditions": [
            "The farmers reported that they harvest 45 sacks of apples from each of the 8 sections of the orchard daily."
        ],
        "question": "How many sacks are harvested every day?",
        "equation": "45*8=x",
        "gold_answer": 360.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Lewis then went to see the oranges being harvested. Lewis found out that they harvest 83 sacks per day. How many sacks of oranges will they have after 6 days of harvest?",
        "conditions": [
            "Lewis then went to see the oranges being harvested.",
            "Lewis found out that they harvest 83 sacks per day."
        ],
        "question": "How many sacks of oranges will they have after 6 days of harvest?",
        "equation": "83*6=x",
        "gold_answer": 498.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Lewis saved checking on the grapevines for his last stop. He was told by one of the pickers that they fill 324 drums of grapes per day. How many drums of grapes would be filled in 9 days?",
        "conditions": [
            "Lewis saved checking on the grapevines for his last stop.",
            "He was told by one of the pickers that they fill 324 drums of grapes per day."
        ],
        "question": "How many drums of grapes would be filled in 9 days?",
        "equation": "324*9=x",
        "gold_answer": 2916.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Upon arriving at the circus, they went to the ticket booth and asked how much each ticket cost. If each ticket costs 44 dollars and they bought 7 tickets, how much money did they spend on tickets?",
        "conditions": [
            "Upon arriving at the circus, they went to the ticket booth and asked how much each ticket cost.",
            "If each ticket costs 44 dollars and they bought 7 tickets"
        ],
        "question": "how much money did they spend on tickets?",
        "equation": "44*7=x",
        "gold_answer": 308.0,
        "verify_condition_index": 1
    },
    {
        "problem": "They entered the circus tent and saw that there are 4 sections for the audience. If each section can accommodate 246 people, how many people can the tent accommodate in total?",
        "conditions": [
            "They entered the circus tent and saw that there are 4 sections for the audience."
        ],
        "question": "If each section can accommodate 246 people, how many people can the tent accommodate in total?",
        "equation": "4*246=x",
        "gold_answer": 984.0,
        "verify_condition_index": 0
    },
    {
        "problem": "The first act included 5 clown mobiles, each stuffed with 28 clowns. How many clowns are inside all the clown mobiles combined?",
        "conditions": [
            "The first act included 5 clown mobiles, each stuffed with 28 clowns."
        ],
        "question": "How many clowns are inside all the clown mobiles combined?",
        "equation": "5*28=x",
        "gold_answer": 140.0,
        "verify_condition_index": 0
    },
    {
        "problem": "The next act involved several jugglers. If each juggler is juggling 6 balls at a time, how many balls are needed if there are 378 jugglers putting a show at the same time?",
        "conditions": [
            "The next act involved several jugglers.",
            "If each juggler is juggling 6 balls at a time"
        ],
        "question": "how many balls are needed if there are 378 jugglers putting a show at the same time?",
        "equation": "6*378=x",
        "gold_answer": 2268.0,
        "verify_condition_index": 1
    },
    {
        "problem": "For the final act, the circus brought out dancing animals wearing crowns. If each crown is made with 7 different colored feathers, how many feathers are needed for 934 crowns?",
        "conditions": [
            "For the final act, the circus brought out dancing animals wearing crowns.",
            "If each crown is made with 7 different colored feathers"
        ],
        "question": "how many feathers are needed for 934 crowns?",
        "equation": "7*934=x",
        "gold_answer": 6538.0,
        "verify_condition_index": 1
    },
    {
        "problem": "The library is divided into different sections for different type of books. The science fiction section has 8 books. If each book has 478 pages, how many pages do all the books have in total?",
        "conditions": [
            "The library is divided into different sections for different type of books.",
            "The science fiction section has 8 books."
        ],
        "question": "If each book has 478 pages, how many pages do all the books have in total?",
        "equation": "8*478=x",
        "gold_answer": 3824.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Jack has a section filled with short story booklets. If each booklet has 9 pages and there are 49 booklets in the short story section, how many pages will Jack need to go through if he plans to read them all?",
        "conditions": [
            "Jack has a section filled with short story booklets.",
            "If each booklet has 9 pages and there are 49 booklets in the short story section"
        ],
        "question": "how many pages will Jack need to go through if he plans to read them all?",
        "equation": "9*49=x",
        "gold_answer": 441.0,
        "verify_condition_index": 1
    },
    {
        "problem": "The mini library also has a section for the classics. If Jack has a collection of 6 classic authors, with each author having 33 books, how many books does he have in the classics section?",
        "conditions": [
            "The mini library also has a section for the classics.",
            "If Jack has a collection of 6 classic authors"
        ],
        "question": "with each author having 33 books, how many books does he have in the classics section?",
        "equation": "6*33=x",
        "gold_answer": 198.0,
        "verify_condition_index": 1
    },
    {
        "problem": "She counted her crayons and found out that she has 80 crayons which she will place in crayon boxes. Every box can contain 8 crayons. How many boxes does she need?",
        "conditions": [
            "She counted her crayons and found out that she has 80 crayons which she will place in crayon boxes.",
            "Every box can contain 8 crayons."
        ],
        "question": "How many boxes does she need?",
        "equation": "80/8=x",
        "gold_answer": 10.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There was a stack of 700 sheets of used paper. Lexie wants to place it in boxes for recycling. If every box can contain 100 sheets, how many boxes does Lexie need?",
        "conditions": [
            "There was a stack of 700 sheets of used paper.",
            "Lexie wants to place it in boxes for recycling."
        ],
        "question": "If every box can contain 100 sheets, how many boxes does Lexie need?",
        "equation": "700/7=x",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Lexie's mom gathered all her watercolor paintings and thought of placing an equal number of paintings in 4 rooms in the house. If Lexie has 32 watercolor paintings, how many paintings will be placed in each room?",
        "conditions": [
            "Lexie's mom gathered all her watercolor paintings and thought of placing an equal number of paintings in 4 rooms in the house."
        ],
        "question": "If Lexie has 32 watercolor paintings, how many paintings will be placed in each room?",
        "equation": "4*x=32",
        "gold_answer": 8.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Lexie's younger brother helped pick up all the paper clips in Lexie's room. He was able to collect 81 paper clips. If he wants to distribute the paper clips in 9 boxes, how many paper clips will each box contain?",
        "conditions": [
            "Lexie's younger brother helped pick up all the paper clips in Lexie's room.",
            "He was able to collect 81 paper clips."
        ],
        "question": "If he wants to distribute the paper clips in 9 boxes, how many paper clips will each box contain?",
        "equation": "81/9=x",
        "gold_answer": 9.0,
        "verify_condition_index": 1
    },
    {
        "problem": "The junior ranger asked Christian to help him place 420 seedlings in packets. If every packet needs to contain 7 seeds, how many packets do they need?",
        "conditions": [
            "The junior ranger asked Christian to help him place 420 seedlings in packets."
        ],
        "question": "If every packet needs to contain 7 seeds, how many packets do they need?",
        "equation": "420/7=x",
        "gold_answer": 60.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Christian's mother prepared lemonade. Every pitcher of lemonade can serve 5 glasses. If she was able to serve 30 glasses of lemonade, how many pitchers of lemonade did she prepare?",
        "conditions": [
            "Christian's mother prepared lemonade.",
            "Every pitcher of lemonade can serve 5 glasses."
        ],
        "question": "If she was able to serve 30 glasses of lemonade, how many pitchers of lemonade did she prepare?",
        "equation": "5*x=30",
        "gold_answer": 6.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Christian's father and the senior ranger gathered firewood as they walked towards the lake in the park and brought with them sacks. If every sack can contain around 20 pieces of wood, how many sacks were they able to fill if they gathered 80 pieces of wood?",
        "conditions": [
            "Christian's father and the senior ranger gathered firewood as they walked towards the lake in the park and brought with them sacks.",
            "If every sack can contain around 20 pieces of wood"
        ],
        "question": "how many sacks were they able to fill if they gathered 80 pieces of wood?",
        "equation": "20*x=80",
        "gold_answer": 4.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Christian and the junior ranger brought a bag of 140 nails as they visited every station assigned to the junior ranger. If they left exactly 7 nails in every station they visited, how many stations did Joline and the junior ranger visit?",
        "conditions": [
            "Christian and the junior ranger brought a bag of 140 nails as they visited every station assigned to the junior ranger.",
            "If they left exactly 7 nails in every station they visited"
        ],
        "question": "how many stations did Joline and the junior ranger visit?",
        "equation": "140/7=x",
        "gold_answer": 20.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Sunday morning was spent for making wood carvings which can be sold as souvenir for tourists. They were placed in shelves that can contain 8 wood carvings at a time. If 56 wood carvings were displayed, how many shelves were filled with carvings?",
        "conditions": [
            "Sunday morning was spent for making wood carvings which can be sold as souvenir for tourists.",
            "They were placed in shelves that can contain 8 wood carvings at a time."
        ],
        "question": "If 56 wood carvings were displayed, how many shelves were filled with carvings?",
        "equation": "8*x=56",
        "gold_answer": 7.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Shiela has 6 neighbors who like to collect animal drawings. Shiela drew 54 animals on small pieces of paper. If she plans to give the same number of animal drawings to her neighbors, how many will each of them receive?",
        "conditions": [
            "Shiela has 6 neighbors who like to collect animal drawings.",
            "Shiela drew 54 animals on small pieces of paper."
        ],
        "question": "If she plans to give the same number of animal drawings to her neighbors, how many will each of them receive?",
        "equation": "6*x=54",
        "gold_answer": 9.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Allen, Shiela's brother, likes to play with blocks. Shiela repainted Allen's old blocks in different colors. If Allen has 49 identical blocks and there are 7 blocks for every color of paint used, how many colors did Shiela use?",
        "conditions": [
            "Allen, Shiela's brother, likes to play with blocks.",
            "Shiela repainted Allen's old blocks in different colors.",
            "If Allen has 49 identical blocks and there are 7 blocks for every color of paint used"
        ],
        "question": "how many colors did Shiela use?",
        "equation": "49/7=x",
        "gold_answer": 7.0,
        "verify_condition_index": 2
    },
    {
        "problem": "It has been tradition in Shiela's home to hang a sock above the fireplace for each member of the family. This year, she placed a cinnamon ball every day in the socks for 5 of her family members. How long can she do this if she bought 50 cinnamon balls?",
        "conditions": [
            "It has been tradition in Shiela's home to hang a sock above the fireplace for each member of the family.",
            "This year, she placed a cinnamon ball every day in the socks for 5 of her family members."
        ],
        "question": "How long can she do this if she bought 50 cinnamon balls?",
        "equation": "5*x=50",
        "gold_answer": 10.0,
        "verify_condition_index": 1
    },
    {
        "problem": "9 of Hayley's closest friends like stickers. If she plans to give all of them an equal number of stickers, how many will each receive if she has 72 stickers?",
        "conditions": [
            "9 of Hayley's closest friends like stickers."
        ],
        "question": "If she plans to give all of them an equal number of stickers, how many will each receive if she has 72 stickers?",
        "equation": "9*x=72",
        "gold_answer": 8.0,
        "verify_condition_index": 0
    },
    {
        "problem": "In Haley's class, 5 are boys who love to play marbles. If Haley has 35 marbles, how many will each of the boys receive?",
        "conditions": [
            "In Haley's class, 5 are boys who love to play marbles."
        ],
        "question": "If Haley has 35 marbles, how many will each of the boys receive?",
        "equation": "5*x=35",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "When relatives visit Haley and her family, she and her cousins do origami. If she has 48 origami papers to give away to her 6 cousins, how many will each receive if she gives everyone the same number of origami papers?",
        "conditions": [
            "When relatives visit Haley and her family, she and her cousins do origami.",
            "If she has 48 origami papers to give away to her 6 cousins"
        ],
        "question": "how many will each receive if she gives everyone the same number of origami papers?",
        "equation": "48/6=x",
        "gold_answer": 8.0,
        "verify_condition_index": 1
    },
    {
        "problem": "A large bag of balls was kept under Haley's bed. Her mom placed the balls in bags for children in foster homes. If every bag can contain 4 balls and Haley has 36 balls, how many bags will be used?",
        "conditions": [
            "A large bag of balls was kept under Haley's bed.",
            "Her mom placed the balls in bags for children in foster homes.",
            "If every bag can contain 4 balls and Haley has 36 balls"
        ],
        "question": "how many bags will be used?",
        "equation": "4*x=36",
        "gold_answer": 9.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Haley has 63 magazines in her cabinet. She plans to send it to the recycling office in their area. If she places it in boxes which can contain 9 magazines, how many boxes will Hayley use?",
        "conditions": [
            "Haley has 63 magazines in her cabinet.",
            "She plans to send it to the recycling office in their area."
        ],
        "question": "If she places it in boxes which can contain 9 magazines, how many boxes will Hayley use?",
        "equation": "63/9=x",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Betty bought 88 pink flower stones and wanted to make 8 bracelets out of these stones. How many pink flower stones will each bracelet have if she used the same number of stones in each bracelet?",
        "conditions": [
            "Betty bought 88 pink flower stones,",
            "and wanted to make 8 bracelets out of these stones."
        ],
        "question": "How many pink flower stones will each bracelet have if she used the same number of stones in each bracelet?",
        "equation": "88/8=x",
        "gold_answer": 11.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Betty also bought 140 shiny blue round stones. If 14 pieces of this stone is in each bracelet, how many bracelets of blue shiny round stones will there be?",
        "conditions": [
            "Betty also bought 140 shiny blue round stones."
        ],
        "question": "If 14 pieces of this stone is in each bracelet, how many bracelets of blue shiny round stones will there be?",
        "equation": "140/14=x",
        "gold_answer": 10.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Brenda, Betty's sister, wanted to have 3 bracelets with star-shaped stones. She also bought 36 star-shaped stones from the local store and gave it to Betty. How many star-shaped stones will there be in each of the bracelet Betty makes for Brenda?",
        "conditions": [
            "Brenda, Betty's sister, wanted to have 3 bracelets with star-shaped stones.",
            "She also bought 36 star-shaped stones from the local store and gave it to Betty."
        ],
        "question": "How many star-shaped stones will there be in each of the bracelet Betty makes for Brenda?",
        "equation": "3*x=36",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Shannon, Brenda's neighbor, joined Brenda in making bracelets. She brought 48 heart-shaped stones and wanted to have 8 of this type of stone in each of the bracelet she makes. How many bracelets with heart-shaped stones can Shannon make?",
        "conditions": [
            "Shannon, Brenda's neighbor, joined Brenda in making bracelets.",
            "She brought 48 heart-shaped stones,",
            "and wanted to have 8 of this type of stone in each of the bracelet she makes."
        ],
        "question": "How many bracelets with heart-shaped stones can Shannon make?",
        "equation": "48/8=x",
        "gold_answer": 6.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Brenda's mother made cookies for 5. If she prepared 35 cookies and each of them had the same number of cookies, how many did each of them have?",
        "conditions": [
            "Brenda's mother made cookies for 5."
        ],
        "question": "If she prepared 35 cookies and each of them had the same number of cookies, how many did each of them have?",
        "equation": "5*x=35",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jane had been saving large empty cans to serve as pots for sunflowers. If she has 54 sunflower seeds and there are 9 cans, how many seeds will be placed in each can if she places an equal number of seeds in each can?",
        "conditions": [
            "Jane had been saving large empty cans to serve as pots for sunflowers.",
            "If she has 54 sunflower seeds and there are 9 cans"
        ],
        "question": "how many seeds will be placed in each can if she places an equal number of seeds in each can?",
        "equation": "54/9=x",
        "gold_answer": 6.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Jane's mom picked cherry tomatoes from their backyard. If she gathered 56 cherry tomatoes and is about to place them in small jars which can contain 8 cherry tomatoes at a time, how many jars will she need?",
        "conditions": [
            "Jane's mom picked cherry tomatoes from their backyard.",
            "If she gathered 56 cherry tomatoes and is about to place them in small jars which can contain 8 cherry tomatoes at a time"
        ],
        "question": "how many jars will she need?",
        "equation": "56/8=x",
        "gold_answer": 7.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Jane helped her mom prepare fresh lemonade. If each glass needs 2 lemons, how many glasses of fresh lemonade can she make if they have 18 lemons?",
        "conditions": [
            "Jane helped her mom prepare fresh lemonade.",
            "If each glass needs 2 lemons"
        ],
        "question": "how many glasses of fresh lemonade can she make if they have 18 lemons?",
        "equation": "2*x=18",
        "gold_answer": 9.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Jane's dad brought home 24 marble potatoes. If Jane's mom made potato salad for lunch and served an equal amount of potatoes to Jane, herself and her husband, how many potatoes did each of them have?",
        "conditions": [
            "Jane's dad brought home 24 marble potatoes."
        ],
        "question": "If Jane's mom made potato salad for lunch and served an equal amount of potatoes to Jane, herself and her husband, how many potatoes did each of them have?",
        "equation": "24/3=x",
        "gold_answer": 8.0,
        "verify_condition_index": 0
    },
    {
        "problem": "For dessert, Jane's mom prepared 12 pieces of bite-size cinnamon swirls. If the 3 of them ate an equal number of pieces of cinnamon swirls, how many pieces did Jane eat?",
        "conditions": [
            "For dessert, Jane's mom prepared 12 pieces of bite-size cinnamon swirls."
        ],
        "question": "If the 3 of them ate an equal number of pieces of cinnamon swirls, how many pieces did Jane eat?",
        "equation": "12/3=x",
        "gold_answer": 4.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Ellen had 380 legos, but Ellen lost 57 of them. How many legos does Ellen have now?",
        "conditions": [
            "Ellen had 380 legos,",
            "but Ellen lost 57 of them."
        ],
        "question": "How many legos does Ellen have now?",
        "equation": "380-57=x",
        "gold_answer": 323.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Arthur baked 35 muffins. How many more muffins does Arthur have to bake to have 83 muffins?",
        "conditions": [
            "Arthur baked 35 muffins."
        ],
        "question": "How many more muffins does Arthur have to bake to have 83 muffins?",
        "equation": "35+x=83",
        "gold_answer": 48.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Willy has 1400 crayons. Lucy has 290 crayons. How many more crayons does Willy have then Lucy?",
        "conditions": [
            "Willy has 1400 crayons.",
            "Lucy has 290 crayons."
        ],
        "question": "How many more crayons does Willy have then Lucy?",
        "equation": "1400-290=x",
        "gold_answer": 1110.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 10 stickers on a page. If you have 22 pages of stickers, how many stickers do you have?",
        "conditions": [
            "There are 10 stickers on a page."
        ],
        "question": "If you have 22 pages of stickers, how many stickers do you have?",
        "equation": "10*22=x",
        "gold_answer": 220.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 96 cupcakes for 8 children to share. How much will each person get if they share the cupcakes equally?",
        "conditions": [
            "There are 96 cupcakes for 8 children to share."
        ],
        "question": "How much will each person get if they share the cupcakes equally?",
        "equation": "96/8=x",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Karen has 639 crayons. Cindy has 504 crayons. How many more crayons does Karen have than Cindy?",
        "conditions": [
            "Karen has 639 crayons.",
            "Cindy has 504 crayons."
        ],
        "question": "How many more crayons does Karen have than Cindy?",
        "equation": "639-504=x",
        "gold_answer": 135.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jose has 85 peanuts. Kenya has 48 more than Jose. How many peanuts does Kenya have?",
        "conditions": [
            "Jose has 85 peanuts.",
            "Kenya has 48 more than Jose."
        ],
        "question": "How many peanuts does Kenya have?",
        "equation": "85+48=x",
        "gold_answer": 133.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Lizette has 813 stamps. Lizette has 125 more stamps than Minerva. How many stamps does Minerva have?",
        "conditions": [
            "Lizette has 813 stamps.",
            "Lizette has 125 more stamps than Minerva."
        ],
        "question": "How many stamps does Minerva have?",
        "equation": "813-125=x",
        "gold_answer": 688.0,
        "verify_condition_index": 1
    },
    {
        "problem": "White t-shirts can be purchased in packages of 6. If Mom buys 71 packages, how many white t-shirts will Mom have?",
        "conditions": [
            "White t-shirts can be purchased in packages of 6."
        ],
        "question": "If Mom buys 71 packages, how many white t-shirts will Mom have?",
        "equation": "6*71=x",
        "gold_answer": 426.0,
        "verify_condition_index": 0
    },
    {
        "problem": "I have 648 pencils. If I put 4 pencils in each pencil box, how many pencil boxes will I fill?",
        "conditions": [
            "I have 648 pencils."
        ],
        "question": "If I put 4 pencils in each pencil box, how many pencil boxes will I fill?",
        "equation": "648/4=x",
        "gold_answer": 162.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Uncle Dave bought 143 ice cream sandwiches. If he wants to give them to his 11 hungry nieces, how many can each niece get?",
        "conditions": [
            "Uncle Dave bought 143 ice cream sandwiches."
        ],
        "question": "If he wants to give them to his 11 hungry nieces, how many can each niece get?",
        "equation": "143/11=x",
        "gold_answer": 13.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Megan had 217 markers. Robert gave her 109 more markers. How many markers does Megan have altogether?",
        "conditions": [
            "Megan had 217 markers.",
            "Robert gave her 109 more markers."
        ],
        "question": "How many markers does Megan have altogether?",
        "equation": "217+109=x",
        "gold_answer": 326.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A DVD book holds 126 DVDs. There are 81 DVDs already in the book. How many more DVDs can be put in the book?",
        "conditions": [
            "A DVD book holds 126 DVDs.",
            "There are 81 DVDs already in the book."
        ],
        "question": "How many more DVDs can be put in the book?",
        "equation": "126-81=x",
        "gold_answer": 45.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Carla has some marbles. Carla bought 489 marbles. Now Calra has 2778 marbles all together. How many did Carla start with?",
        "conditions": [
            "Carla has some marbles.",
            "Carla bought 489 marbles.",
            "Now Calra has 2778 marbles all together."
        ],
        "question": "How many did Carla start with?",
        "equation": "489+x=2778",
        "gold_answer": 2289.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Paco had 93 cookies. Paco ate 15 of them. How many cookies did Paco have left?",
        "conditions": [
            "Paco had 93 cookies.",
            "Paco ate 15 of them."
        ],
        "question": "How many cookies did Paco have left?",
        "equation": "93-15=x",
        "gold_answer": 78.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Kelly has 121 Nintendo games. How many does Kelly need to give away so that Kelly will have 22 games left?",
        "conditions": [
            "Kelly has 121 Nintendo games."
        ],
        "question": "How many does Kelly need to give away so that Kelly will have 22 games left?",
        "equation": "121-22=x",
        "gold_answer": 99.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Connie had some marbles. Connie gave 183 to Juan. Now Connie has 593 marbles left. How many did Connie have to start with?",
        "conditions": [
            "Connie had some marbles.",
            "Connie gave 183 to Juan.",
            "Now Connie has 593 marbles left."
        ],
        "question": "How many did Connie have to start with?",
        "equation": "x-183=593",
        "gold_answer": 776.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Connie has 2315 red markers and 1028 blue markers. How many markers does Connie have altogether?",
        "conditions": [
            "Connie has 2315 red markers,",
            "and 1028 blue markers."
        ],
        "question": "How many markers does Connie have altogether?",
        "equation": "2315+1028=x",
        "gold_answer": 3343.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Iesha has 344 books. 136 are about school and the rest are about sports. How many books about sports does Iesha have?",
        "conditions": [
            "Iesha has 344 books.",
            "136 are about school and the rest are about sports."
        ],
        "question": "How many books about sports does Iesha have?",
        "equation": "344-136=x",
        "gold_answer": 208.0,
        "verify_condition_index": 0
    },
    {
        "problem": "James has 1222 balloons. Amy has 513 balloons. How many more balloons does James have than Amy?",
        "conditions": [
            "James has 1222 balloons.",
            "Amy has 513 balloons."
        ],
        "question": "How many more balloons does James have than Amy?",
        "equation": "1222-513=x",
        "gold_answer": 208.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Sean has 223 whistles. Sean has 95 more whistles than Charles. How many whistles does Charles have?",
        "conditions": [
            "Sean has 223 whistles.",
            "Sean has 95 more whistles than Charles."
        ],
        "question": "How many whistles does Charles have?",
        "equation": "223-95=x",
        "gold_answer": 128.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Connie has 323 marbles. Juan has 175 more marbles than Connie. How many marbles does Juan have?",
        "conditions": [
            "Connie has 323 marbles.",
            "Juan has 175 more marbles than Connie."
        ],
        "question": "How many marbles does Juan have?",
        "equation": "323+175=x",
        "gold_answer": 498.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Robin has 27 packages of gum. There are 18 pieces in each package. How many pieces of gum does Robin have?",
        "conditions": [
            "Robin has 27 packages of gum.",
            "There are 18 pieces in each package."
        ],
        "question": "How many pieces of gum does Robin have?",
        "equation": "27*18=x",
        "gold_answer": 486.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Adam has $5.00 to buy an airplane that costs $4.28. How much change will Adam get?",
        "conditions": [
            "Adam has $5.00 to buy an airplane that costs $4.28."
        ],
        "question": "How much change will Adam get?",
        "equation": "5.00-4.28=x",
        "gold_answer": 0.72,
        "verify_condition_index": 0
    },
    {
        "problem": "If each ball costs $1.54, how much must Kyoko pay for 3 balls?",
        "conditions": [
            "If each ball costs $1.54"
        ],
        "question": "how much must Kyoko pay for 3 balls?",
        "equation": "1.54*3=x",
        "gold_answer": 4.62,
        "verify_condition_index": 0
    },
    {
        "problem": "Tony had $20. Tony paid $8 for a ticket to a baseball game. At the game, Tony bought a hot dog for $3. What amount of money did Tony have then?",
        "conditions": [
            "Tony had $20.",
            "Tony paid $8 for a ticket to a baseball game.",
            "At the game, Tony bought a hot dog for $3."
        ],
        "question": "What amount of money did Tony have then?",
        "equation": "20-(8+3)=x",
        "gold_answer": 9.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mr.Guzman bought 48 doughnuts packed equally into 4 boxes. How many doughnuts were in each box?",
        "conditions": [
            "Mr.Guzman bought 48 doughnuts packed equally into 4 boxes."
        ],
        "question": "How many doughnuts were in each box?",
        "equation": "48/4=x",
        "gold_answer": 12.0,
        "verify_condition_index": 0
    },
    {
        "problem": "The Sumata family took a 5 day vacation by car. Each day they drove 250 miles. How many total miles did they drive?",
        "conditions": [
            "The Sumata family took a 5 day vacation by car.",
            "Each day they drove 250 miles."
        ],
        "question": "How many total miles did they drive?",
        "equation": "5*250=x",
        "gold_answer": 1250.0,
        "verify_condition_index": 1
    },
    {
        "problem": "One stamp costs 34 cents. If the cost of each stamp remains the same, how much would 4 stamps cost?",
        "conditions": [
            "One stamp costs 34 cents."
        ],
        "question": "If the cost of each stamp remains the same, how much would 4 stamps cost?",
        "equation": "34*4=x",
        "gold_answer": 134.0,
        "verify_condition_index": 0
    },
    {
        "problem": "The town of Milburg has 5256 grown-ups and 2987 children. How many people live in Milburg?",
        "conditions": [
            "The town of Milburg has 5256 grown-ups,",
            "and 2987 children."
        ],
        "question": "How many people live in Milburg?",
        "equation": "5256+2987=x",
        "gold_answer": 8243.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Lisa rented 4 DVDs for $4.80. How much did each DVD cost to rent?",
        "conditions": [
            "Lisa rented 4 DVDs for $4.80."
        ],
        "question": "How much did each DVD cost to rent?",
        "equation": "4*x=4.80",
        "gold_answer": 1.2,
        "verify_condition_index": 0
    },
    {
        "problem": "There were 3409 pieces of candy in a jar. If 145 pieces were red and the rest were blue, how many were blue?",
        "conditions": [
            "There were 3409 pieces of candy in a jar."
        ],
        "question": "If 145 pieces were red and the rest were blue, how many were blue?",
        "equation": "3409-145=x",
        "gold_answer": 3264.0,
        "verify_condition_index": 0
    },
    {
        "problem": "On Friday, 1250 people visited the zoo. 3 times as many people visited on Saturday than on Friday. How many people visited the zoo on Saturday?",
        "conditions": [
            "On Friday, 1250 people visited the zoo.",
            "3 times as many people visited on Saturday than on Friday."
        ],
        "question": "How many people visited the zoo on Saturday?",
        "equation": "1250*3=x",
        "gold_answer": 3750.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Students went to a concert in 8 buses. Each bus took 45 students. How many students went to the concert?",
        "conditions": [
            "Students went to a concert in 8 buses.",
            "Each bus took 45 students."
        ],
        "question": "How many students went to the concert?",
        "equation": "8*45=x",
        "gold_answer": 360.0,
        "verify_condition_index": 0
    },
    {
        "problem": "There are 124 students making 3 stars each for the school wall. How many stars will they make all together?",
        "conditions": [
            "There are 124 students making 3 stars each for the school wall."
        ],
        "question": "How many stars will they make all together?",
        "equation": "124*3=x",
        "gold_answer": 372.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Marcia spent 300 minutes working on her science project. How many hours did Marcia spend on her science project?",
        "conditions": [
            "Marcia spent 300 minutes working on her science project."
        ],
        "question": "How many hours did Marcia spend on her science project?",
        "equation": "300/60=x",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    },
    {
        "problem": "In one week, an airplane pilot flew 1134 miles on Tuesday and 1475 miles on Thursday. If the pilot flies the same number of miles 3 weeks in a row, how many miles does the pilot fly in all?",
        "conditions": [
            "In one week, an airplane pilot flew 1134 miles on Tuesday",
            "and 1475 miles on Thursday."
        ],
        "question": "If the pilot flies the same number of miles 3 weeks in a row, how many miles does the pilot fly in all?",
        "equation": "3*(1134+1475)=x",
        "gold_answer": 7827.0,
        "verify_condition_index": 0
    },
    {
        "problem": "6 students were sitting at each table in the lunchroom. There are 34 tables. How many students were sitting in the lunchroom?",
        "conditions": [
            "6 students were sitting at each table in the lunchroom.",
            "There are 34 tables."
        ],
        "question": "How many students were sitting in the lunchroom?",
        "equation": "6*34=x",
        "gold_answer": 204.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Tyler had 15 dogs. Each dog had 5 puppies. How many puppies does Tyler now have?",
        "conditions": [
            "Tyler had 15 dogs.",
            "Each dog had 5 puppies."
        ],
        "question": "How many puppies does Tyler now have?",
        "equation": "15*5=x",
        "gold_answer": 75.0,
        "verify_condition_index": 0
    },
    {
        "problem": "The farmer had 127 apples. The farmer gave 88 apples to his neighbor. How many apples does the farmer have now?",
        "conditions": [
            "The farmer had 127 apples.",
            "The farmer gave 88 apples to his neighbor."
        ],
        "question": "How many apples does the farmer have now?",
        "equation": "127-88=x",
        "gold_answer": 39.0,
        "verify_condition_index": 0
    },
    {
        "problem": "John can read 4 books a day. John reads every Monday and Tuesday. How many books would John read in 6 weeks?",
        "conditions": [
            "John can read 4 books a day.",
            "John reads every Monday and Tuesday."
        ],
        "question": "How many books would John read in 6 weeks?",
        "equation": "(4+4)*6=x",
        "gold_answer": 48.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Jill invited 37 people to her birthday party. They each ate 8 pieces of pizza. How many pieces of pizza did they eat?",
        "conditions": [
            "Jill invited 37 people to her birthday party.",
            "They each ate 8 pieces of pizza."
        ],
        "question": "How many pieces of pizza did they eat?",
        "equation": "37*8=x",
        "gold_answer": 296.0,
        "verify_condition_index": 1
    },
    {
        "problem": "The Spurs basketball team has 22 players. Each player has 11 basketballs. How many basketballs do they have in all?",
        "conditions": [
            "The Spurs basketball team has 22 players.",
            "Each player has 11 basketballs."
        ],
        "question": "How many basketballs do they have in all?",
        "equation": "22*11=x",
        "gold_answer": 242.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mrs.Hilt uses 2 ounces of detergent to wash a pound of clothes. How many ounces of soap will Mrs.Hilt use to wash 9 pounds of clothes?",
        "conditions": [
            "Mrs.Hilt uses 2 ounces of detergent to wash a pound of clothes."
        ],
        "question": "How many ounces of soap will Mrs.Hilt use to wash 9 pounds of clothes?",
        "equation": "2*9=x",
        "gold_answer": 18.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mrs.Hilt went to a concert. A total of 65899 people attended the concert. The next week, Mrs.Hilt went to a second concert, which had 119 more people in attendance. How many people were at the second concert?",
        "conditions": [
            "Mrs.Hilt went to a concert.",
            "A total of 65899 people attended the concert.",
            "The next week, Mrs.Hilt went to a second concert, which had 119 more people in attendance."
        ],
        "question": "How many people were at the second concert?",
        "equation": "65899+119=x",
        "gold_answer": 66018.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Mrs.Hilt baked pies last weekend for a holiday dinner. She baked 16 pecan pies and 14 apples pies. If she wants to arrange all of the pies in rows of 5 pies each, how many rows will she have?",
        "conditions": [
            "Mrs.Hilt baked pies last weekend for a holiday dinner.",
            "She baked 16 pecan pies,",
            "and 14 apples pies."
        ],
        "question": "If she wants to arrange all of the pies in rows of 5 pies each, how many rows will she have?",
        "equation": "(16+14)/5=x",
        "gold_answer": 6.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mrs.Hilt needs to share $3.75 equally among 3 total people. How much money will each person get?",
        "conditions": [
            "Mrs.Hilt needs to share $3.75 equally among 3 total people."
        ],
        "question": "How much money will each person get?",
        "equation": "3.75/3=x",
        "gold_answer": 1.25,
        "verify_condition_index": 0
    },
    {
        "problem": "Mrs.Hilt spent 74 cents at the school store. She bought a notebook for 35 cents, a ruler for 18 cents, and 3 pencils. What is the cost of one pencil?",
        "conditions": [
            "Mrs.Hilt spent 74 cents at the school store.",
            "She bought a notebook for 35 cents,",
            "a ruler for 18 cents,",
            "and 3 pencils."
        ],
        "question": "What is the cost of one pencil?",
        "equation": "74=35+18+3*x",
        "gold_answer": 7.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mrs.Hilt has 40 markers. They are divided equally into 7 packages. Mrs.Hilt wants to know how many markers are in each package?",
        "conditions": [
            "Mrs.Hilt has 40 markers.",
            "They are divided equally into 7 packages."
        ],
        "question": "Mrs.Hilt wants to know how many markers are in each package?",
        "equation": "40/7=x",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mrs.Hilt read 4 books. Each book had 17 chapters in it. How many chapters did Mrs.Hilt read?",
        "conditions": [
            "Mrs.Hilt read 4 books.",
            "Each book had 17 chapters in it."
        ],
        "question": "How many chapters did Mrs.Hilt read?",
        "equation": "4*17=x",
        "gold_answer": 68.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mrs.Hilt is baking bread. She needs 5 cups of flour to bake 2 loaves of bread. How much flour will she need to make one loaf of bread?",
        "conditions": [
            "Mrs.Hilt is baking bread.",
            "She needs 5 cups of flour to bake 2 loaves of bread."
        ],
        "question": "How much flour will she need to make one loaf of bread?",
        "equation": "5/2=x",
        "gold_answer": 2.5,
        "verify_condition_index": 1
    },
    {
        "problem": "Mrs.Hilt bought a notebook for $1.30. She paid with nickels. How many nickels did she use to buy the notebook?",
        "conditions": [
            "Mrs.Hilt bought a notebook for $1.30.",
            "She paid with nickels."
        ],
        "question": "How many nickels did she use to buy the notebook?",
        "equation": "1.30/5=x",
        "gold_answer": 26.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mrs.Hilt saw a rollercoaster. 7 students rode the rollercoaster every 5 minutes. How many students rode the rollercoaster in 15 minutes?",
        "conditions": [
            "Mrs.Hilt saw a rollercoaster.",
            "7 students rode the rollercoaster every 5 minutes."
        ],
        "question": "How many students rode the rollercoaster in 15 minutes?",
        "equation": "7*(15/5)=x",
        "gold_answer": 21.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Mrs.Hilt saw 144 bees in the hive. The next day she saw 3 times that many. How many bees did she see on the second day?",
        "conditions": [
            "Mrs.Hilt saw 144 bees in the hive.",
            "The next day she saw 3 times that many."
        ],
        "question": "How many bees did she see on the second day?",
        "equation": "144*3=x",
        "gold_answer": 432.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Mrs.Hilt measured the distance from her desk to the water fountain. It was 30 feet. How many feet will Mrs.Hilt walk on her trips to the fountain if she goes to the water fountain 4 times today?",
        "conditions": [
            "Mrs.Hilt measured the distance from her desk to the water fountain.",
            "It was 30 feet."
        ],
        "question": "How many feet will Mrs.Hilt walk on her trips to the fountain if she goes to the water fountain 4 times today?",
        "equation": "30*4=x",
        "gold_answer": 120.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Lucy has an aquarium with 212 fish. Lucy wants to buy 68 more fish. How many fish would Lucy have then?",
        "conditions": [
            "Lucy has an aquarium with 212 fish.",
            "Lucy wants to buy 68 more fish."
        ],
        "question": "How many fish would Lucy have then?",
        "equation": "212+68=x",
        "gold_answer": 280.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Lucy has 212 fish. How many more fish does Lucy need to buy to have 280 fish?",
        "conditions": [
            "Lucy has 212 fish."
        ],
        "question": "How many more fish does Lucy need to buy to have 280 fish?",
        "equation": "212+x=280",
        "gold_answer": 68.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Chris has been saving his allowance to buy a new pair of soccer cleats and a ball. His grandmother gave Chris $25 for his birthday. His aunt and uncle gave Chris $20 and his parents gave him $75. Now Chris had $279. How much money did Chris have before his birthday?",
        "conditions": [
            "Chris has been saving his allowance to buy a new pair of soccer cleats and a ball.",
            "His grandmother gave Chris $25 for his birthday.",
            "His aunt and uncle gave Chris $20,",
            "and his parents gave him $75.",
            "Now Chris had $279."
        ],
        "question": "How much money did Chris have before his birthday?",
        "equation": "x+25+20+75=279",
        "gold_answer": 159.0,
        "verify_condition_index": 2
    },
    {
        "problem": "Harry Hound had a terrible earache yesterday. When I peered into his ears yesterday, I found 36 frisky fleas having a party in his right ear and 85 baby fleas sleeping peacefully in his left ear. I cleaned out Harry Hound's ears. How many fleas perished?",
        "conditions": [
            "Harry Hound had a terrible earache yesterday.",
            "When I peered into his ears yesterday, I found 36 frisky fleas having a party in his right ear",
            "and 85 baby fleas sleeping peacefully in his left ear.",
            "I cleaned out Harry Hound's ears."
        ],
        "question": "How many fleas perished?",
        "equation": "36+85=x",
        "gold_answer": 121.0,
        "verify_condition_index": 1
    },
    {
        "problem": "A pet supply store has 600 bags of dog food and 327 bags of cat food. How many more bags of dog food are there than cat food?",
        "conditions": [
            "A pet supply store has 600 bags of dog food,",
            "and 327 bags of cat food."
        ],
        "question": "How many more bags of dog food are there than cat food?",
        "equation": "600-327=x",
        "gold_answer": 273.0,
        "verify_condition_index": 1
    },
    {
        "problem": "David has 7 boxes of stuffed toy dogs. Each box has 4 dogs in it. How many dogs are there in all?",
        "conditions": [
            "David has 7 boxes of stuffed toy dogs.",
            "Each box has 4 dogs in it."
        ],
        "question": "How many dogs are there in all?",
        "equation": "7*4=x",
        "gold_answer": 28.0,
        "verify_condition_index": 1
    },
    {
        "problem": "532 people are watching a movie in a theater. The theater has 750 seats. How many seats are empty in the theater?",
        "conditions": [
            "532 people are watching a movie in a theater.",
            "The theater has 750 seats."
        ],
        "question": "How many seats are empty in the theater?",
        "equation": "523+x=750",
        "gold_answer": 218.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Each bag contains 23 pounds of oranges. How many pounds of oranges are in 45 bags?",
        "conditions": [
            "Each bag contains 23 pounds of oranges."
        ],
        "question": "How many pounds of oranges are in 45 bags?",
        "equation": "23*45=x",
        "gold_answer": 1035.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Bert runs 2 miles every day. How many miles will Bert run in 3 weeks?",
        "conditions": [
            "Bert runs 2 miles every day."
        ],
        "question": "How many miles will Bert run in 3 weeks?",
        "equation": "2*(3*7)=x",
        "gold_answer": 42.0,
        "verify_condition_index": 0
    },
    {
        "problem": "For his long distance phone service Milan pays a 2 dollars monthly fee plus 12 cents per minute. Last month , Milan 's long distance bill was 23.36 dollars. For how many minutes was Milan billed for ?",
        "conditions": [
            "For his long distance phone service Milan pays a 2 dollars monthly fee plus 12 cents per minute.",
            "Last month , Milan 's long distance bill was 23.36 dollars."
        ],
        "question": "For how many minutes was Milan billed for ?",
        "equation": "2+((12*0.01)*x)=23.36",
        "gold_answer": 178.0,
        "verify_condition_index": 1
    },
    {
        "problem": "The value of a sport utility vehicle this year is 16,000 dollars , which is 0.8 of what its value was last year. How much is the value of the vehicle last year?",
        "conditions": [
            "The value of a sport utility vehicle this year is 16,000 dollars , which is 0.8 of what its value was last year."
        ],
        "question": "How much is the value of the vehicle last year?",
        "equation": "16000.0/0.8=x",
        "gold_answer": 20000.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Trenton sells electronic supplies. Each week he earns 190 dollars plus commission equal to 0.04 of his sales. This week his goal is to earn no less than 500 dollars. How much sales  he must make to reach his goal?",
        "conditions": [
            "Trenton sells electronic supplies.",
            "Each week he earns 190 dollars plus commission equal to 0.04 of his sales.",
            "This week his goal is to earn no less than 500 dollars."
        ],
        "question": "How much sales  he must make to reach his goal?",
        "equation": "190.0+(0.04*x)=500.0",
        "gold_answer": 7750.0,
        "verify_condition_index": 1
    },
    {
        "problem": "Tony planted a 4 foot tree. The tree grows at a rate of 5 feet every year. How many years will it take to be 29 feet?",
        "conditions": [
            "Tony planted a 4 foot tree.",
            "The tree grows at a rate of 5 feet every year."
        ],
        "question": "How many years will it take to be 29 feet?",
        "equation": "4.0+(5.0*x)=29.0",
        "gold_answer": 5.0,
        "verify_condition_index": 1
    },
    {
        "problem": "The tallest player on the basketball team is 77.75 inches tall. This is 9.5 inches taller than the shortest player. How tall is the shortest player , in inches?",
        "conditions": [
            "The tallest player on the basketball team is 77.75 inches tall.",
            "This is 9.5 inches taller than the shortest player."
        ],
        "question": "How tall is the shortest player , in inches?",
        "equation": "x=77.75-9.5",
        "gold_answer": 68.25,
        "verify_condition_index": 1
    },
    {
        "problem": "0.20 of a number decreased by 4 is equal to 6. Find the number.",
        "conditions": [
            "0.20 of a number decreased by 4 is equal to 6."
        ],
        "question": "Find the number.",
        "equation": "0.2*x-4.0=6.0",
        "gold_answer": 50.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Freeport McMoran projects the world grain supply will be 1800000 metric tons and the supply will be only 0.75 of the world grain demand. What will the world grain demand be?",
        "conditions": [
            "Freeport McMoran projects the world grain supply will be 1800000 metric tons,",
            "and the supply will be only 0.75 of the world grain demand."
        ],
        "question": "What will the world grain demand be?",
        "equation": "1800000.0=0.75*x",
        "gold_answer": 2400000.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A 12 ounce can of cranberry juice sells for 84 cents. What is the cost in cents per ounce.",
        "conditions": [
            "A 12 ounce can of cranberry juice sells for 84 cents."
        ],
        "question": "What is the cost in cents per ounce.",
        "equation": "x=84.0/12.0",
        "gold_answer": 7.0,
        "verify_condition_index": 0
    },
    {
        "problem": "Manuel opened a savings account with an initial deposit of 177 dollars. If he wants to save 500 dollars during the next 19 weeks , how much must he save each week , in dollars?",
        "conditions": [
            "Manuel opened a savings account with an initial deposit of 177 dollars."
        ],
        "question": "If he wants to save 500 dollars during the next 19 weeks , how much must he save each week , in dollars?",
        "equation": "177.0+(19.0*x)=500.0",
        "gold_answer": 17.0,
        "verify_condition_index": 0
    },
    {
        "problem": "A mechanic charged 45 dollars an hour , plus 225 dollars for the parts. If the total bill was 450 dollars , how many hours did the job take?",
        "conditions": [
            "A mechanic charged 45 dollars an hour , plus 225 dollars for the parts."
        ],
        "question": "If the total bill was 450 dollars , how many hours did the job take?",
        "equation": "(45.0*x)+225.0=450.0",
        "gold_answer": 5.0,
        "verify_condition_index": 0
    }
]